<?php
return array (
  110000 => 
  array (
    'id' => '110000',
    'name' => '北京市',
    'level' => 1,
    'pid' => 0,
  ),
  110100 => 
  array (
    'id' => '110100',
    'name' => '市辖区',
    'level' => 2,
    'pid' => '110000',
  ),
  110101 => 
  array (
    'id' => '110101',
    'name' => '东城区',
    'level' => 3,
    'pid' => '110100',
  ),
  110102 => 
  array (
    'id' => '110102',
    'name' => '西城区',
    'level' => 3,
    'pid' => '110100',
  ),
  110105 => 
  array (
    'id' => '110105',
    'name' => '朝阳区',
    'level' => 3,
    'pid' => '110100',
  ),
  110106 => 
  array (
    'id' => '110106',
    'name' => '丰台区',
    'level' => 3,
    'pid' => '110100',
  ),
  110107 => 
  array (
    'id' => '110107',
    'name' => '石景山区',
    'level' => 3,
    'pid' => '110100',
  ),
  110108 => 
  array (
    'id' => '110108',
    'name' => '海淀区',
    'level' => 3,
    'pid' => '110100',
  ),
  110109 => 
  array (
    'id' => '110109',
    'name' => '门头沟区',
    'level' => 3,
    'pid' => '110100',
  ),
  110111 => 
  array (
    'id' => '110111',
    'name' => '房山区',
    'level' => 3,
    'pid' => '110100',
  ),
  110112 => 
  array (
    'id' => '110112',
    'name' => '通州区',
    'level' => 3,
    'pid' => '110100',
  ),
  110113 => 
  array (
    'id' => '110113',
    'name' => '顺义区',
    'level' => 3,
    'pid' => '110100',
  ),
  110114 => 
  array (
    'id' => '110114',
    'name' => '昌平区',
    'level' => 3,
    'pid' => '110100',
  ),
  110115 => 
  array (
    'id' => '110115',
    'name' => '大兴区',
    'level' => 3,
    'pid' => '110100',
  ),
  110116 => 
  array (
    'id' => '110116',
    'name' => '怀柔区',
    'level' => 3,
    'pid' => '110100',
  ),
  110117 => 
  array (
    'id' => '110117',
    'name' => '平谷区',
    'level' => 3,
    'pid' => '110100',
  ),
  110200 => 
  array (
    'id' => '110200',
    'name' => '县',
    'level' => 2,
    'pid' => '110000',
  ),
  110228 => 
  array (
    'id' => '110228',
    'name' => '密云县',
    'level' => 3,
    'pid' => '110200',
  ),
  110229 => 
  array (
    'id' => '110229',
    'name' => '延庆县',
    'level' => 3,
    'pid' => '110200',
  ),
  120000 => 
  array (
    'id' => '120000',
    'name' => '天津市',
    'level' => 1,
    'pid' => 0,
  ),
  120100 => 
  array (
    'id' => '120100',
    'name' => '市辖区',
    'level' => 2,
    'pid' => '120000',
  ),
  120101 => 
  array (
    'id' => '120101',
    'name' => '和平区',
    'level' => 3,
    'pid' => '120100',
  ),
  120102 => 
  array (
    'id' => '120102',
    'name' => '河东区',
    'level' => 3,
    'pid' => '120100',
  ),
  120103 => 
  array (
    'id' => '120103',
    'name' => '河西区',
    'level' => 3,
    'pid' => '120100',
  ),
  120104 => 
  array (
    'id' => '120104',
    'name' => '南开区',
    'level' => 3,
    'pid' => '120100',
  ),
  120105 => 
  array (
    'id' => '120105',
    'name' => '河北区',
    'level' => 3,
    'pid' => '120100',
  ),
  120106 => 
  array (
    'id' => '120106',
    'name' => '红桥区',
    'level' => 3,
    'pid' => '120100',
  ),
  120110 => 
  array (
    'id' => '120110',
    'name' => '东丽区',
    'level' => 3,
    'pid' => '120100',
  ),
  120111 => 
  array (
    'id' => '120111',
    'name' => '西青区',
    'level' => 3,
    'pid' => '120100',
  ),
  120112 => 
  array (
    'id' => '120112',
    'name' => '津南区',
    'level' => 3,
    'pid' => '120100',
  ),
  120113 => 
  array (
    'id' => '120113',
    'name' => '北辰区',
    'level' => 3,
    'pid' => '120100',
  ),
  120114 => 
  array (
    'id' => '120114',
    'name' => '武清区',
    'level' => 3,
    'pid' => '120100',
  ),
  120115 => 
  array (
    'id' => '120115',
    'name' => '宝坻区',
    'level' => 3,
    'pid' => '120100',
  ),
  120116 => 
  array (
    'id' => '120116',
    'name' => '滨海新区',
    'level' => 3,
    'pid' => '120100',
  ),
  120117 => 
  array (
    'id' => '120117',
    'name' => '宁河区',
    'level' => 3,
    'pid' => '120100',
  ),
  120118 => 
  array (
    'id' => '120118',
    'name' => '静海区',
    'level' => 3,
    'pid' => '120100',
  ),
  120200 => 
  array (
    'id' => '120200',
    'name' => '县',
    'level' => 2,
    'pid' => '120000',
  ),
  120225 => 
  array (
    'id' => '120225',
    'name' => '蓟县',
    'level' => 3,
    'pid' => '120200',
  ),
  130000 => 
  array (
    'id' => '130000',
    'name' => '河北省',
    'level' => 1,
    'pid' => 0,
  ),
  130100 => 
  array (
    'id' => '130100',
    'name' => '石家庄市',
    'level' => 2,
    'pid' => '130000',
  ),
  130101 => 
  array (
    'id' => '130101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130100',
  ),
  130102 => 
  array (
    'id' => '130102',
    'name' => '长安区',
    'level' => 3,
    'pid' => '130100',
  ),
  130104 => 
  array (
    'id' => '130104',
    'name' => '桥西区',
    'level' => 3,
    'pid' => '130100',
  ),
  130105 => 
  array (
    'id' => '130105',
    'name' => '新华区',
    'level' => 3,
    'pid' => '130100',
  ),
  130107 => 
  array (
    'id' => '130107',
    'name' => '井陉矿区',
    'level' => 3,
    'pid' => '130100',
  ),
  130108 => 
  array (
    'id' => '130108',
    'name' => '裕华区',
    'level' => 3,
    'pid' => '130100',
  ),
  130109 => 
  array (
    'id' => '130109',
    'name' => '藁城区',
    'level' => 3,
    'pid' => '130100',
  ),
  130110 => 
  array (
    'id' => '130110',
    'name' => '鹿泉区',
    'level' => 3,
    'pid' => '130100',
  ),
  130111 => 
  array (
    'id' => '130111',
    'name' => '栾城区',
    'level' => 3,
    'pid' => '130100',
  ),
  130121 => 
  array (
    'id' => '130121',
    'name' => '井陉县',
    'level' => 3,
    'pid' => '130100',
  ),
  130123 => 
  array (
    'id' => '130123',
    'name' => '正定县',
    'level' => 3,
    'pid' => '130100',
  ),
  130125 => 
  array (
    'id' => '130125',
    'name' => '行唐县',
    'level' => 3,
    'pid' => '130100',
  ),
  130126 => 
  array (
    'id' => '130126',
    'name' => '灵寿县',
    'level' => 3,
    'pid' => '130100',
  ),
  130127 => 
  array (
    'id' => '130127',
    'name' => '高邑县',
    'level' => 3,
    'pid' => '130100',
  ),
  130128 => 
  array (
    'id' => '130128',
    'name' => '深泽县',
    'level' => 3,
    'pid' => '130100',
  ),
  130129 => 
  array (
    'id' => '130129',
    'name' => '赞皇县',
    'level' => 3,
    'pid' => '130100',
  ),
  130130 => 
  array (
    'id' => '130130',
    'name' => '无极县',
    'level' => 3,
    'pid' => '130100',
  ),
  130131 => 
  array (
    'id' => '130131',
    'name' => '平山县',
    'level' => 3,
    'pid' => '130100',
  ),
  130132 => 
  array (
    'id' => '130132',
    'name' => '元氏县',
    'level' => 3,
    'pid' => '130100',
  ),
  130133 => 
  array (
    'id' => '130133',
    'name' => '赵县',
    'level' => 3,
    'pid' => '130100',
  ),
  130183 => 
  array (
    'id' => '130183',
    'name' => '晋州市',
    'level' => 3,
    'pid' => '130100',
  ),
  130184 => 
  array (
    'id' => '130184',
    'name' => '新乐市',
    'level' => 3,
    'pid' => '130100',
  ),
  130200 => 
  array (
    'id' => '130200',
    'name' => '唐山市',
    'level' => 2,
    'pid' => '130000',
  ),
  130201 => 
  array (
    'id' => '130201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130200',
  ),
  130202 => 
  array (
    'id' => '130202',
    'name' => '路南区',
    'level' => 3,
    'pid' => '130200',
  ),
  130203 => 
  array (
    'id' => '130203',
    'name' => '路北区',
    'level' => 3,
    'pid' => '130200',
  ),
  130204 => 
  array (
    'id' => '130204',
    'name' => '古冶区',
    'level' => 3,
    'pid' => '130200',
  ),
  130205 => 
  array (
    'id' => '130205',
    'name' => '开平区',
    'level' => 3,
    'pid' => '130200',
  ),
  130207 => 
  array (
    'id' => '130207',
    'name' => '丰南区',
    'level' => 3,
    'pid' => '130200',
  ),
  130208 => 
  array (
    'id' => '130208',
    'name' => '丰润区',
    'level' => 3,
    'pid' => '130200',
  ),
  130209 => 
  array (
    'id' => '130209',
    'name' => '曹妃甸区',
    'level' => 3,
    'pid' => '130200',
  ),
  130223 => 
  array (
    'id' => '130223',
    'name' => '滦县',
    'level' => 3,
    'pid' => '130200',
  ),
  130224 => 
  array (
    'id' => '130224',
    'name' => '滦南县',
    'level' => 3,
    'pid' => '130200',
  ),
  130225 => 
  array (
    'id' => '130225',
    'name' => '乐亭县',
    'level' => 3,
    'pid' => '130200',
  ),
  130227 => 
  array (
    'id' => '130227',
    'name' => '迁西县',
    'level' => 3,
    'pid' => '130200',
  ),
  130229 => 
  array (
    'id' => '130229',
    'name' => '玉田县',
    'level' => 3,
    'pid' => '130200',
  ),
  130281 => 
  array (
    'id' => '130281',
    'name' => '遵化市',
    'level' => 3,
    'pid' => '130200',
  ),
  130283 => 
  array (
    'id' => '130283',
    'name' => '迁安市',
    'level' => 3,
    'pid' => '130200',
  ),
  130300 => 
  array (
    'id' => '130300',
    'name' => '秦皇岛市',
    'level' => 2,
    'pid' => '130000',
  ),
  130301 => 
  array (
    'id' => '130301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130300',
  ),
  130302 => 
  array (
    'id' => '130302',
    'name' => '海港区',
    'level' => 3,
    'pid' => '130300',
  ),
  130303 => 
  array (
    'id' => '130303',
    'name' => '山海关区',
    'level' => 3,
    'pid' => '130300',
  ),
  130304 => 
  array (
    'id' => '130304',
    'name' => '北戴河区',
    'level' => 3,
    'pid' => '130300',
  ),
  130306 => 
  array (
    'id' => '130306',
    'name' => '抚宁区',
    'level' => 3,
    'pid' => '130300',
  ),
  130321 => 
  array (
    'id' => '130321',
    'name' => '青龙满族自治县',
    'level' => 3,
    'pid' => '130300',
  ),
  130322 => 
  array (
    'id' => '130322',
    'name' => '昌黎县',
    'level' => 3,
    'pid' => '130300',
  ),
  130324 => 
  array (
    'id' => '130324',
    'name' => '卢龙县',
    'level' => 3,
    'pid' => '130300',
  ),
  130400 => 
  array (
    'id' => '130400',
    'name' => '邯郸市',
    'level' => 2,
    'pid' => '130000',
  ),
  130401 => 
  array (
    'id' => '130401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130400',
  ),
  130402 => 
  array (
    'id' => '130402',
    'name' => '邯山区',
    'level' => 3,
    'pid' => '130400',
  ),
  130403 => 
  array (
    'id' => '130403',
    'name' => '丛台区',
    'level' => 3,
    'pid' => '130400',
  ),
  130404 => 
  array (
    'id' => '130404',
    'name' => '复兴区',
    'level' => 3,
    'pid' => '130400',
  ),
  130406 => 
  array (
    'id' => '130406',
    'name' => '峰峰矿区',
    'level' => 3,
    'pid' => '130400',
  ),
  130421 => 
  array (
    'id' => '130421',
    'name' => '邯郸县',
    'level' => 3,
    'pid' => '130400',
  ),
  130423 => 
  array (
    'id' => '130423',
    'name' => '临漳县',
    'level' => 3,
    'pid' => '130400',
  ),
  130424 => 
  array (
    'id' => '130424',
    'name' => '成安县',
    'level' => 3,
    'pid' => '130400',
  ),
  130425 => 
  array (
    'id' => '130425',
    'name' => '大名县',
    'level' => 3,
    'pid' => '130400',
  ),
  130426 => 
  array (
    'id' => '130426',
    'name' => '涉县',
    'level' => 3,
    'pid' => '130400',
  ),
  130427 => 
  array (
    'id' => '130427',
    'name' => '磁县',
    'level' => 3,
    'pid' => '130400',
  ),
  130428 => 
  array (
    'id' => '130428',
    'name' => '肥乡县',
    'level' => 3,
    'pid' => '130400',
  ),
  130429 => 
  array (
    'id' => '130429',
    'name' => '永年县',
    'level' => 3,
    'pid' => '130400',
  ),
  130430 => 
  array (
    'id' => '130430',
    'name' => '邱县',
    'level' => 3,
    'pid' => '130400',
  ),
  130431 => 
  array (
    'id' => '130431',
    'name' => '鸡泽县',
    'level' => 3,
    'pid' => '130400',
  ),
  130432 => 
  array (
    'id' => '130432',
    'name' => '广平县',
    'level' => 3,
    'pid' => '130400',
  ),
  130433 => 
  array (
    'id' => '130433',
    'name' => '馆陶县',
    'level' => 3,
    'pid' => '130400',
  ),
  130434 => 
  array (
    'id' => '130434',
    'name' => '魏县',
    'level' => 3,
    'pid' => '130400',
  ),
  130435 => 
  array (
    'id' => '130435',
    'name' => '曲周县',
    'level' => 3,
    'pid' => '130400',
  ),
  130481 => 
  array (
    'id' => '130481',
    'name' => '武安市',
    'level' => 3,
    'pid' => '130400',
  ),
  130500 => 
  array (
    'id' => '130500',
    'name' => '邢台市',
    'level' => 2,
    'pid' => '130000',
  ),
  130501 => 
  array (
    'id' => '130501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130500',
  ),
  130502 => 
  array (
    'id' => '130502',
    'name' => '桥东区',
    'level' => 3,
    'pid' => '130500',
  ),
  130503 => 
  array (
    'id' => '130503',
    'name' => '桥西区',
    'level' => 3,
    'pid' => '130500',
  ),
  130521 => 
  array (
    'id' => '130521',
    'name' => '邢台县',
    'level' => 3,
    'pid' => '130500',
  ),
  130522 => 
  array (
    'id' => '130522',
    'name' => '临城县',
    'level' => 3,
    'pid' => '130500',
  ),
  130523 => 
  array (
    'id' => '130523',
    'name' => '内丘县',
    'level' => 3,
    'pid' => '130500',
  ),
  130524 => 
  array (
    'id' => '130524',
    'name' => '柏乡县',
    'level' => 3,
    'pid' => '130500',
  ),
  130525 => 
  array (
    'id' => '130525',
    'name' => '隆尧县',
    'level' => 3,
    'pid' => '130500',
  ),
  130526 => 
  array (
    'id' => '130526',
    'name' => '任县',
    'level' => 3,
    'pid' => '130500',
  ),
  130527 => 
  array (
    'id' => '130527',
    'name' => '南和县',
    'level' => 3,
    'pid' => '130500',
  ),
  130528 => 
  array (
    'id' => '130528',
    'name' => '宁晋县',
    'level' => 3,
    'pid' => '130500',
  ),
  130529 => 
  array (
    'id' => '130529',
    'name' => '巨鹿县',
    'level' => 3,
    'pid' => '130500',
  ),
  130530 => 
  array (
    'id' => '130530',
    'name' => '新河县',
    'level' => 3,
    'pid' => '130500',
  ),
  130531 => 
  array (
    'id' => '130531',
    'name' => '广宗县',
    'level' => 3,
    'pid' => '130500',
  ),
  130532 => 
  array (
    'id' => '130532',
    'name' => '平乡县',
    'level' => 3,
    'pid' => '130500',
  ),
  130533 => 
  array (
    'id' => '130533',
    'name' => '威县',
    'level' => 3,
    'pid' => '130500',
  ),
  130534 => 
  array (
    'id' => '130534',
    'name' => '清河县',
    'level' => 3,
    'pid' => '130500',
  ),
  130535 => 
  array (
    'id' => '130535',
    'name' => '临西县',
    'level' => 3,
    'pid' => '130500',
  ),
  130581 => 
  array (
    'id' => '130581',
    'name' => '南宫市',
    'level' => 3,
    'pid' => '130500',
  ),
  130582 => 
  array (
    'id' => '130582',
    'name' => '沙河市',
    'level' => 3,
    'pid' => '130500',
  ),
  130600 => 
  array (
    'id' => '130600',
    'name' => '保定市',
    'level' => 2,
    'pid' => '130000',
  ),
  130601 => 
  array (
    'id' => '130601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130600',
  ),
  130602 => 
  array (
    'id' => '130602',
    'name' => '竞秀区',
    'level' => 3,
    'pid' => '130600',
  ),
  130606 => 
  array (
    'id' => '130606',
    'name' => '莲池区',
    'level' => 3,
    'pid' => '130600',
  ),
  130607 => 
  array (
    'id' => '130607',
    'name' => '满城区',
    'level' => 3,
    'pid' => '130600',
  ),
  130608 => 
  array (
    'id' => '130608',
    'name' => '清苑区',
    'level' => 3,
    'pid' => '130600',
  ),
  130609 => 
  array (
    'id' => '130609',
    'name' => '徐水区',
    'level' => 3,
    'pid' => '130600',
  ),
  130623 => 
  array (
    'id' => '130623',
    'name' => '涞水县',
    'level' => 3,
    'pid' => '130600',
  ),
  130624 => 
  array (
    'id' => '130624',
    'name' => '阜平县',
    'level' => 3,
    'pid' => '130600',
  ),
  130626 => 
  array (
    'id' => '130626',
    'name' => '定兴县',
    'level' => 3,
    'pid' => '130600',
  ),
  130627 => 
  array (
    'id' => '130627',
    'name' => '唐县',
    'level' => 3,
    'pid' => '130600',
  ),
  130628 => 
  array (
    'id' => '130628',
    'name' => '高阳县',
    'level' => 3,
    'pid' => '130600',
  ),
  130629 => 
  array (
    'id' => '130629',
    'name' => '容城县',
    'level' => 3,
    'pid' => '130600',
  ),
  130630 => 
  array (
    'id' => '130630',
    'name' => '涞源县',
    'level' => 3,
    'pid' => '130600',
  ),
  130631 => 
  array (
    'id' => '130631',
    'name' => '望都县',
    'level' => 3,
    'pid' => '130600',
  ),
  130632 => 
  array (
    'id' => '130632',
    'name' => '安新县',
    'level' => 3,
    'pid' => '130600',
  ),
  130633 => 
  array (
    'id' => '130633',
    'name' => '易县',
    'level' => 3,
    'pid' => '130600',
  ),
  130634 => 
  array (
    'id' => '130634',
    'name' => '曲阳县',
    'level' => 3,
    'pid' => '130600',
  ),
  130635 => 
  array (
    'id' => '130635',
    'name' => '蠡县',
    'level' => 3,
    'pid' => '130600',
  ),
  130636 => 
  array (
    'id' => '130636',
    'name' => '顺平县',
    'level' => 3,
    'pid' => '130600',
  ),
  130637 => 
  array (
    'id' => '130637',
    'name' => '博野县',
    'level' => 3,
    'pid' => '130600',
  ),
  130638 => 
  array (
    'id' => '130638',
    'name' => '雄县',
    'level' => 3,
    'pid' => '130600',
  ),
  130681 => 
  array (
    'id' => '130681',
    'name' => '涿州市',
    'level' => 3,
    'pid' => '130600',
  ),
  130683 => 
  array (
    'id' => '130683',
    'name' => '安国市',
    'level' => 3,
    'pid' => '130600',
  ),
  130684 => 
  array (
    'id' => '130684',
    'name' => '高碑店市',
    'level' => 3,
    'pid' => '130600',
  ),
  130700 => 
  array (
    'id' => '130700',
    'name' => '张家口市',
    'level' => 2,
    'pid' => '130000',
  ),
  130701 => 
  array (
    'id' => '130701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130700',
  ),
  130702 => 
  array (
    'id' => '130702',
    'name' => '桥东区',
    'level' => 3,
    'pid' => '130700',
  ),
  130703 => 
  array (
    'id' => '130703',
    'name' => '桥西区',
    'level' => 3,
    'pid' => '130700',
  ),
  130705 => 
  array (
    'id' => '130705',
    'name' => '宣化区',
    'level' => 3,
    'pid' => '130700',
  ),
  130706 => 
  array (
    'id' => '130706',
    'name' => '下花园区',
    'level' => 3,
    'pid' => '130700',
  ),
  130721 => 
  array (
    'id' => '130721',
    'name' => '宣化县',
    'level' => 3,
    'pid' => '130700',
  ),
  130722 => 
  array (
    'id' => '130722',
    'name' => '张北县',
    'level' => 3,
    'pid' => '130700',
  ),
  130723 => 
  array (
    'id' => '130723',
    'name' => '康保县',
    'level' => 3,
    'pid' => '130700',
  ),
  130724 => 
  array (
    'id' => '130724',
    'name' => '沽源县',
    'level' => 3,
    'pid' => '130700',
  ),
  130725 => 
  array (
    'id' => '130725',
    'name' => '尚义县',
    'level' => 3,
    'pid' => '130700',
  ),
  130726 => 
  array (
    'id' => '130726',
    'name' => '蔚县',
    'level' => 3,
    'pid' => '130700',
  ),
  130727 => 
  array (
    'id' => '130727',
    'name' => '阳原县',
    'level' => 3,
    'pid' => '130700',
  ),
  130728 => 
  array (
    'id' => '130728',
    'name' => '怀安县',
    'level' => 3,
    'pid' => '130700',
  ),
  130729 => 
  array (
    'id' => '130729',
    'name' => '万全县',
    'level' => 3,
    'pid' => '130700',
  ),
  130730 => 
  array (
    'id' => '130730',
    'name' => '怀来县',
    'level' => 3,
    'pid' => '130700',
  ),
  130731 => 
  array (
    'id' => '130731',
    'name' => '涿鹿县',
    'level' => 3,
    'pid' => '130700',
  ),
  130732 => 
  array (
    'id' => '130732',
    'name' => '赤城县',
    'level' => 3,
    'pid' => '130700',
  ),
  130733 => 
  array (
    'id' => '130733',
    'name' => '崇礼县',
    'level' => 3,
    'pid' => '130700',
  ),
  130800 => 
  array (
    'id' => '130800',
    'name' => '承德市',
    'level' => 2,
    'pid' => '130000',
  ),
  130801 => 
  array (
    'id' => '130801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130800',
  ),
  130802 => 
  array (
    'id' => '130802',
    'name' => '双桥区',
    'level' => 3,
    'pid' => '130800',
  ),
  130803 => 
  array (
    'id' => '130803',
    'name' => '双滦区',
    'level' => 3,
    'pid' => '130800',
  ),
  130804 => 
  array (
    'id' => '130804',
    'name' => '鹰手营子矿区',
    'level' => 3,
    'pid' => '130800',
  ),
  130821 => 
  array (
    'id' => '130821',
    'name' => '承德县',
    'level' => 3,
    'pid' => '130800',
  ),
  130822 => 
  array (
    'id' => '130822',
    'name' => '兴隆县',
    'level' => 3,
    'pid' => '130800',
  ),
  130823 => 
  array (
    'id' => '130823',
    'name' => '平泉县',
    'level' => 3,
    'pid' => '130800',
  ),
  130824 => 
  array (
    'id' => '130824',
    'name' => '滦平县',
    'level' => 3,
    'pid' => '130800',
  ),
  130825 => 
  array (
    'id' => '130825',
    'name' => '隆化县',
    'level' => 3,
    'pid' => '130800',
  ),
  130826 => 
  array (
    'id' => '130826',
    'name' => '丰宁满族自治县',
    'level' => 3,
    'pid' => '130800',
  ),
  130827 => 
  array (
    'id' => '130827',
    'name' => '宽城满族自治县',
    'level' => 3,
    'pid' => '130800',
  ),
  130828 => 
  array (
    'id' => '130828',
    'name' => '围场满族蒙古族自治县',
    'level' => 3,
    'pid' => '130800',
  ),
  130900 => 
  array (
    'id' => '130900',
    'name' => '沧州市',
    'level' => 2,
    'pid' => '130000',
  ),
  130901 => 
  array (
    'id' => '130901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '130900',
  ),
  130902 => 
  array (
    'id' => '130902',
    'name' => '新华区',
    'level' => 3,
    'pid' => '130900',
  ),
  130903 => 
  array (
    'id' => '130903',
    'name' => '运河区',
    'level' => 3,
    'pid' => '130900',
  ),
  130921 => 
  array (
    'id' => '130921',
    'name' => '沧县',
    'level' => 3,
    'pid' => '130900',
  ),
  130922 => 
  array (
    'id' => '130922',
    'name' => '青县',
    'level' => 3,
    'pid' => '130900',
  ),
  130923 => 
  array (
    'id' => '130923',
    'name' => '东光县',
    'level' => 3,
    'pid' => '130900',
  ),
  130924 => 
  array (
    'id' => '130924',
    'name' => '海兴县',
    'level' => 3,
    'pid' => '130900',
  ),
  130925 => 
  array (
    'id' => '130925',
    'name' => '盐山县',
    'level' => 3,
    'pid' => '130900',
  ),
  130926 => 
  array (
    'id' => '130926',
    'name' => '肃宁县',
    'level' => 3,
    'pid' => '130900',
  ),
  130927 => 
  array (
    'id' => '130927',
    'name' => '南皮县',
    'level' => 3,
    'pid' => '130900',
  ),
  130928 => 
  array (
    'id' => '130928',
    'name' => '吴桥县',
    'level' => 3,
    'pid' => '130900',
  ),
  130929 => 
  array (
    'id' => '130929',
    'name' => '献县',
    'level' => 3,
    'pid' => '130900',
  ),
  130930 => 
  array (
    'id' => '130930',
    'name' => '孟村回族自治县',
    'level' => 3,
    'pid' => '130900',
  ),
  130981 => 
  array (
    'id' => '130981',
    'name' => '泊头市',
    'level' => 3,
    'pid' => '130900',
  ),
  130982 => 
  array (
    'id' => '130982',
    'name' => '任丘市',
    'level' => 3,
    'pid' => '130900',
  ),
  130983 => 
  array (
    'id' => '130983',
    'name' => '黄骅市',
    'level' => 3,
    'pid' => '130900',
  ),
  130984 => 
  array (
    'id' => '130984',
    'name' => '河间市',
    'level' => 3,
    'pid' => '130900',
  ),
  131000 => 
  array (
    'id' => '131000',
    'name' => '廊坊市',
    'level' => 2,
    'pid' => '130000',
  ),
  131001 => 
  array (
    'id' => '131001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '131000',
  ),
  131002 => 
  array (
    'id' => '131002',
    'name' => '安次区',
    'level' => 3,
    'pid' => '131000',
  ),
  131003 => 
  array (
    'id' => '131003',
    'name' => '广阳区',
    'level' => 3,
    'pid' => '131000',
  ),
  131022 => 
  array (
    'id' => '131022',
    'name' => '固安县',
    'level' => 3,
    'pid' => '131000',
  ),
  131023 => 
  array (
    'id' => '131023',
    'name' => '永清县',
    'level' => 3,
    'pid' => '131000',
  ),
  131024 => 
  array (
    'id' => '131024',
    'name' => '香河县',
    'level' => 3,
    'pid' => '131000',
  ),
  131025 => 
  array (
    'id' => '131025',
    'name' => '大城县',
    'level' => 3,
    'pid' => '131000',
  ),
  131026 => 
  array (
    'id' => '131026',
    'name' => '文安县',
    'level' => 3,
    'pid' => '131000',
  ),
  131028 => 
  array (
    'id' => '131028',
    'name' => '大厂回族自治县',
    'level' => 3,
    'pid' => '131000',
  ),
  131081 => 
  array (
    'id' => '131081',
    'name' => '霸州市',
    'level' => 3,
    'pid' => '131000',
  ),
  131082 => 
  array (
    'id' => '131082',
    'name' => '三河市',
    'level' => 3,
    'pid' => '131000',
  ),
  131100 => 
  array (
    'id' => '131100',
    'name' => '衡水市',
    'level' => 2,
    'pid' => '130000',
  ),
  131101 => 
  array (
    'id' => '131101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '131100',
  ),
  131102 => 
  array (
    'id' => '131102',
    'name' => '桃城区',
    'level' => 3,
    'pid' => '131100',
  ),
  131121 => 
  array (
    'id' => '131121',
    'name' => '枣强县',
    'level' => 3,
    'pid' => '131100',
  ),
  131122 => 
  array (
    'id' => '131122',
    'name' => '武邑县',
    'level' => 3,
    'pid' => '131100',
  ),
  131123 => 
  array (
    'id' => '131123',
    'name' => '武强县',
    'level' => 3,
    'pid' => '131100',
  ),
  131124 => 
  array (
    'id' => '131124',
    'name' => '饶阳县',
    'level' => 3,
    'pid' => '131100',
  ),
  131125 => 
  array (
    'id' => '131125',
    'name' => '安平县',
    'level' => 3,
    'pid' => '131100',
  ),
  131126 => 
  array (
    'id' => '131126',
    'name' => '故城县',
    'level' => 3,
    'pid' => '131100',
  ),
  131127 => 
  array (
    'id' => '131127',
    'name' => '景县',
    'level' => 3,
    'pid' => '131100',
  ),
  131128 => 
  array (
    'id' => '131128',
    'name' => '阜城县',
    'level' => 3,
    'pid' => '131100',
  ),
  131181 => 
  array (
    'id' => '131181',
    'name' => '冀州市',
    'level' => 3,
    'pid' => '131100',
  ),
  131182 => 
  array (
    'id' => '131182',
    'name' => '深州市',
    'level' => 3,
    'pid' => '131100',
  ),
  139000 => 
  array (
    'id' => '139000',
    'name' => '省直辖县级行政区划',
    'level' => 2,
    'pid' => '130000',
  ),
  139001 => 
  array (
    'id' => '139001',
    'name' => '定州市',
    'level' => 3,
    'pid' => '139000',
  ),
  139002 => 
  array (
    'id' => '139002',
    'name' => '辛集市',
    'level' => 3,
    'pid' => '139000',
  ),
  140000 => 
  array (
    'id' => '140000',
    'name' => '山西省',
    'level' => 1,
    'pid' => 0,
  ),
  140100 => 
  array (
    'id' => '140100',
    'name' => '太原市',
    'level' => 2,
    'pid' => '140000',
  ),
  140101 => 
  array (
    'id' => '140101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140100',
  ),
  140105 => 
  array (
    'id' => '140105',
    'name' => '小店区',
    'level' => 3,
    'pid' => '140100',
  ),
  140106 => 
  array (
    'id' => '140106',
    'name' => '迎泽区',
    'level' => 3,
    'pid' => '140100',
  ),
  140107 => 
  array (
    'id' => '140107',
    'name' => '杏花岭区',
    'level' => 3,
    'pid' => '140100',
  ),
  140108 => 
  array (
    'id' => '140108',
    'name' => '尖草坪区',
    'level' => 3,
    'pid' => '140100',
  ),
  140109 => 
  array (
    'id' => '140109',
    'name' => '万柏林区',
    'level' => 3,
    'pid' => '140100',
  ),
  140110 => 
  array (
    'id' => '140110',
    'name' => '晋源区',
    'level' => 3,
    'pid' => '140100',
  ),
  140121 => 
  array (
    'id' => '140121',
    'name' => '清徐县',
    'level' => 3,
    'pid' => '140100',
  ),
  140122 => 
  array (
    'id' => '140122',
    'name' => '阳曲县',
    'level' => 3,
    'pid' => '140100',
  ),
  140123 => 
  array (
    'id' => '140123',
    'name' => '娄烦县',
    'level' => 3,
    'pid' => '140100',
  ),
  140181 => 
  array (
    'id' => '140181',
    'name' => '古交市',
    'level' => 3,
    'pid' => '140100',
  ),
  140200 => 
  array (
    'id' => '140200',
    'name' => '大同市',
    'level' => 2,
    'pid' => '140000',
  ),
  140201 => 
  array (
    'id' => '140201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140200',
  ),
  140202 => 
  array (
    'id' => '140202',
    'name' => '城区',
    'level' => 3,
    'pid' => '140200',
  ),
  140203 => 
  array (
    'id' => '140203',
    'name' => '矿区',
    'level' => 3,
    'pid' => '140200',
  ),
  140211 => 
  array (
    'id' => '140211',
    'name' => '南郊区',
    'level' => 3,
    'pid' => '140200',
  ),
  140212 => 
  array (
    'id' => '140212',
    'name' => '新荣区',
    'level' => 3,
    'pid' => '140200',
  ),
  140221 => 
  array (
    'id' => '140221',
    'name' => '阳高县',
    'level' => 3,
    'pid' => '140200',
  ),
  140222 => 
  array (
    'id' => '140222',
    'name' => '天镇县',
    'level' => 3,
    'pid' => '140200',
  ),
  140223 => 
  array (
    'id' => '140223',
    'name' => '广灵县',
    'level' => 3,
    'pid' => '140200',
  ),
  140224 => 
  array (
    'id' => '140224',
    'name' => '灵丘县',
    'level' => 3,
    'pid' => '140200',
  ),
  140225 => 
  array (
    'id' => '140225',
    'name' => '浑源县',
    'level' => 3,
    'pid' => '140200',
  ),
  140226 => 
  array (
    'id' => '140226',
    'name' => '左云县',
    'level' => 3,
    'pid' => '140200',
  ),
  140227 => 
  array (
    'id' => '140227',
    'name' => '大同县',
    'level' => 3,
    'pid' => '140200',
  ),
  140300 => 
  array (
    'id' => '140300',
    'name' => '阳泉市',
    'level' => 2,
    'pid' => '140000',
  ),
  140301 => 
  array (
    'id' => '140301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140300',
  ),
  140302 => 
  array (
    'id' => '140302',
    'name' => '城区',
    'level' => 3,
    'pid' => '140300',
  ),
  140303 => 
  array (
    'id' => '140303',
    'name' => '矿区',
    'level' => 3,
    'pid' => '140300',
  ),
  140311 => 
  array (
    'id' => '140311',
    'name' => '郊区',
    'level' => 3,
    'pid' => '140300',
  ),
  140321 => 
  array (
    'id' => '140321',
    'name' => '平定县',
    'level' => 3,
    'pid' => '140300',
  ),
  140322 => 
  array (
    'id' => '140322',
    'name' => '盂县',
    'level' => 3,
    'pid' => '140300',
  ),
  140400 => 
  array (
    'id' => '140400',
    'name' => '长治市',
    'level' => 2,
    'pid' => '140000',
  ),
  140401 => 
  array (
    'id' => '140401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140400',
  ),
  140402 => 
  array (
    'id' => '140402',
    'name' => '城区',
    'level' => 3,
    'pid' => '140400',
  ),
  140411 => 
  array (
    'id' => '140411',
    'name' => '郊区',
    'level' => 3,
    'pid' => '140400',
  ),
  140421 => 
  array (
    'id' => '140421',
    'name' => '长治县',
    'level' => 3,
    'pid' => '140400',
  ),
  140423 => 
  array (
    'id' => '140423',
    'name' => '襄垣县',
    'level' => 3,
    'pid' => '140400',
  ),
  140424 => 
  array (
    'id' => '140424',
    'name' => '屯留县',
    'level' => 3,
    'pid' => '140400',
  ),
  140425 => 
  array (
    'id' => '140425',
    'name' => '平顺县',
    'level' => 3,
    'pid' => '140400',
  ),
  140426 => 
  array (
    'id' => '140426',
    'name' => '黎城县',
    'level' => 3,
    'pid' => '140400',
  ),
  140427 => 
  array (
    'id' => '140427',
    'name' => '壶关县',
    'level' => 3,
    'pid' => '140400',
  ),
  140428 => 
  array (
    'id' => '140428',
    'name' => '长子县',
    'level' => 3,
    'pid' => '140400',
  ),
  140429 => 
  array (
    'id' => '140429',
    'name' => '武乡县',
    'level' => 3,
    'pid' => '140400',
  ),
  140430 => 
  array (
    'id' => '140430',
    'name' => '沁县',
    'level' => 3,
    'pid' => '140400',
  ),
  140431 => 
  array (
    'id' => '140431',
    'name' => '沁源县',
    'level' => 3,
    'pid' => '140400',
  ),
  140481 => 
  array (
    'id' => '140481',
    'name' => '潞城市',
    'level' => 3,
    'pid' => '140400',
  ),
  140500 => 
  array (
    'id' => '140500',
    'name' => '晋城市',
    'level' => 2,
    'pid' => '140000',
  ),
  140501 => 
  array (
    'id' => '140501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140500',
  ),
  140502 => 
  array (
    'id' => '140502',
    'name' => '城区',
    'level' => 3,
    'pid' => '140500',
  ),
  140521 => 
  array (
    'id' => '140521',
    'name' => '沁水县',
    'level' => 3,
    'pid' => '140500',
  ),
  140522 => 
  array (
    'id' => '140522',
    'name' => '阳城县',
    'level' => 3,
    'pid' => '140500',
  ),
  140524 => 
  array (
    'id' => '140524',
    'name' => '陵川县',
    'level' => 3,
    'pid' => '140500',
  ),
  140525 => 
  array (
    'id' => '140525',
    'name' => '泽州县',
    'level' => 3,
    'pid' => '140500',
  ),
  140581 => 
  array (
    'id' => '140581',
    'name' => '高平市',
    'level' => 3,
    'pid' => '140500',
  ),
  140600 => 
  array (
    'id' => '140600',
    'name' => '朔州市',
    'level' => 2,
    'pid' => '140000',
  ),
  140601 => 
  array (
    'id' => '140601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140600',
  ),
  140602 => 
  array (
    'id' => '140602',
    'name' => '朔城区',
    'level' => 3,
    'pid' => '140600',
  ),
  140603 => 
  array (
    'id' => '140603',
    'name' => '平鲁区',
    'level' => 3,
    'pid' => '140600',
  ),
  140621 => 
  array (
    'id' => '140621',
    'name' => '山阴县',
    'level' => 3,
    'pid' => '140600',
  ),
  140622 => 
  array (
    'id' => '140622',
    'name' => '应县',
    'level' => 3,
    'pid' => '140600',
  ),
  140623 => 
  array (
    'id' => '140623',
    'name' => '右玉县',
    'level' => 3,
    'pid' => '140600',
  ),
  140624 => 
  array (
    'id' => '140624',
    'name' => '怀仁县',
    'level' => 3,
    'pid' => '140600',
  ),
  140700 => 
  array (
    'id' => '140700',
    'name' => '晋中市',
    'level' => 2,
    'pid' => '140000',
  ),
  140701 => 
  array (
    'id' => '140701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140700',
  ),
  140702 => 
  array (
    'id' => '140702',
    'name' => '榆次区',
    'level' => 3,
    'pid' => '140700',
  ),
  140721 => 
  array (
    'id' => '140721',
    'name' => '榆社县',
    'level' => 3,
    'pid' => '140700',
  ),
  140722 => 
  array (
    'id' => '140722',
    'name' => '左权县',
    'level' => 3,
    'pid' => '140700',
  ),
  140723 => 
  array (
    'id' => '140723',
    'name' => '和顺县',
    'level' => 3,
    'pid' => '140700',
  ),
  140724 => 
  array (
    'id' => '140724',
    'name' => '昔阳县',
    'level' => 3,
    'pid' => '140700',
  ),
  140725 => 
  array (
    'id' => '140725',
    'name' => '寿阳县',
    'level' => 3,
    'pid' => '140700',
  ),
  140726 => 
  array (
    'id' => '140726',
    'name' => '太谷县',
    'level' => 3,
    'pid' => '140700',
  ),
  140727 => 
  array (
    'id' => '140727',
    'name' => '祁县',
    'level' => 3,
    'pid' => '140700',
  ),
  140728 => 
  array (
    'id' => '140728',
    'name' => '平遥县',
    'level' => 3,
    'pid' => '140700',
  ),
  140729 => 
  array (
    'id' => '140729',
    'name' => '灵石县',
    'level' => 3,
    'pid' => '140700',
  ),
  140781 => 
  array (
    'id' => '140781',
    'name' => '介休市',
    'level' => 3,
    'pid' => '140700',
  ),
  140800 => 
  array (
    'id' => '140800',
    'name' => '运城市',
    'level' => 2,
    'pid' => '140000',
  ),
  140801 => 
  array (
    'id' => '140801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140800',
  ),
  140802 => 
  array (
    'id' => '140802',
    'name' => '盐湖区',
    'level' => 3,
    'pid' => '140800',
  ),
  140821 => 
  array (
    'id' => '140821',
    'name' => '临猗县',
    'level' => 3,
    'pid' => '140800',
  ),
  140822 => 
  array (
    'id' => '140822',
    'name' => '万荣县',
    'level' => 3,
    'pid' => '140800',
  ),
  140823 => 
  array (
    'id' => '140823',
    'name' => '闻喜县',
    'level' => 3,
    'pid' => '140800',
  ),
  140824 => 
  array (
    'id' => '140824',
    'name' => '稷山县',
    'level' => 3,
    'pid' => '140800',
  ),
  140825 => 
  array (
    'id' => '140825',
    'name' => '新绛县',
    'level' => 3,
    'pid' => '140800',
  ),
  140826 => 
  array (
    'id' => '140826',
    'name' => '绛县',
    'level' => 3,
    'pid' => '140800',
  ),
  140827 => 
  array (
    'id' => '140827',
    'name' => '垣曲县',
    'level' => 3,
    'pid' => '140800',
  ),
  140828 => 
  array (
    'id' => '140828',
    'name' => '夏县',
    'level' => 3,
    'pid' => '140800',
  ),
  140829 => 
  array (
    'id' => '140829',
    'name' => '平陆县',
    'level' => 3,
    'pid' => '140800',
  ),
  140830 => 
  array (
    'id' => '140830',
    'name' => '芮城县',
    'level' => 3,
    'pid' => '140800',
  ),
  140881 => 
  array (
    'id' => '140881',
    'name' => '永济市',
    'level' => 3,
    'pid' => '140800',
  ),
  140882 => 
  array (
    'id' => '140882',
    'name' => '河津市',
    'level' => 3,
    'pid' => '140800',
  ),
  140900 => 
  array (
    'id' => '140900',
    'name' => '忻州市',
    'level' => 2,
    'pid' => '140000',
  ),
  140901 => 
  array (
    'id' => '140901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '140900',
  ),
  140902 => 
  array (
    'id' => '140902',
    'name' => '忻府区',
    'level' => 3,
    'pid' => '140900',
  ),
  140921 => 
  array (
    'id' => '140921',
    'name' => '定襄县',
    'level' => 3,
    'pid' => '140900',
  ),
  140922 => 
  array (
    'id' => '140922',
    'name' => '五台县',
    'level' => 3,
    'pid' => '140900',
  ),
  140923 => 
  array (
    'id' => '140923',
    'name' => '代县',
    'level' => 3,
    'pid' => '140900',
  ),
  140924 => 
  array (
    'id' => '140924',
    'name' => '繁峙县',
    'level' => 3,
    'pid' => '140900',
  ),
  140925 => 
  array (
    'id' => '140925',
    'name' => '宁武县',
    'level' => 3,
    'pid' => '140900',
  ),
  140926 => 
  array (
    'id' => '140926',
    'name' => '静乐县',
    'level' => 3,
    'pid' => '140900',
  ),
  140927 => 
  array (
    'id' => '140927',
    'name' => '神池县',
    'level' => 3,
    'pid' => '140900',
  ),
  140928 => 
  array (
    'id' => '140928',
    'name' => '五寨县',
    'level' => 3,
    'pid' => '140900',
  ),
  140929 => 
  array (
    'id' => '140929',
    'name' => '岢岚县',
    'level' => 3,
    'pid' => '140900',
  ),
  140930 => 
  array (
    'id' => '140930',
    'name' => '河曲县',
    'level' => 3,
    'pid' => '140900',
  ),
  140931 => 
  array (
    'id' => '140931',
    'name' => '保德县',
    'level' => 3,
    'pid' => '140900',
  ),
  140932 => 
  array (
    'id' => '140932',
    'name' => '偏关县',
    'level' => 3,
    'pid' => '140900',
  ),
  140981 => 
  array (
    'id' => '140981',
    'name' => '原平市',
    'level' => 3,
    'pid' => '140900',
  ),
  141000 => 
  array (
    'id' => '141000',
    'name' => '临汾市',
    'level' => 2,
    'pid' => '140000',
  ),
  141001 => 
  array (
    'id' => '141001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '141000',
  ),
  141002 => 
  array (
    'id' => '141002',
    'name' => '尧都区',
    'level' => 3,
    'pid' => '141000',
  ),
  141021 => 
  array (
    'id' => '141021',
    'name' => '曲沃县',
    'level' => 3,
    'pid' => '141000',
  ),
  141022 => 
  array (
    'id' => '141022',
    'name' => '翼城县',
    'level' => 3,
    'pid' => '141000',
  ),
  141023 => 
  array (
    'id' => '141023',
    'name' => '襄汾县',
    'level' => 3,
    'pid' => '141000',
  ),
  141024 => 
  array (
    'id' => '141024',
    'name' => '洪洞县',
    'level' => 3,
    'pid' => '141000',
  ),
  141025 => 
  array (
    'id' => '141025',
    'name' => '古县',
    'level' => 3,
    'pid' => '141000',
  ),
  141026 => 
  array (
    'id' => '141026',
    'name' => '安泽县',
    'level' => 3,
    'pid' => '141000',
  ),
  141027 => 
  array (
    'id' => '141027',
    'name' => '浮山县',
    'level' => 3,
    'pid' => '141000',
  ),
  141028 => 
  array (
    'id' => '141028',
    'name' => '吉县',
    'level' => 3,
    'pid' => '141000',
  ),
  141029 => 
  array (
    'id' => '141029',
    'name' => '乡宁县',
    'level' => 3,
    'pid' => '141000',
  ),
  141030 => 
  array (
    'id' => '141030',
    'name' => '大宁县',
    'level' => 3,
    'pid' => '141000',
  ),
  141031 => 
  array (
    'id' => '141031',
    'name' => '隰县',
    'level' => 3,
    'pid' => '141000',
  ),
  141032 => 
  array (
    'id' => '141032',
    'name' => '永和县',
    'level' => 3,
    'pid' => '141000',
  ),
  141033 => 
  array (
    'id' => '141033',
    'name' => '蒲县',
    'level' => 3,
    'pid' => '141000',
  ),
  141034 => 
  array (
    'id' => '141034',
    'name' => '汾西县',
    'level' => 3,
    'pid' => '141000',
  ),
  141081 => 
  array (
    'id' => '141081',
    'name' => '侯马市',
    'level' => 3,
    'pid' => '141000',
  ),
  141082 => 
  array (
    'id' => '141082',
    'name' => '霍州市',
    'level' => 3,
    'pid' => '141000',
  ),
  141100 => 
  array (
    'id' => '141100',
    'name' => '吕梁市',
    'level' => 2,
    'pid' => '140000',
  ),
  141101 => 
  array (
    'id' => '141101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '141100',
  ),
  141102 => 
  array (
    'id' => '141102',
    'name' => '离石区',
    'level' => 3,
    'pid' => '141100',
  ),
  141121 => 
  array (
    'id' => '141121',
    'name' => '文水县',
    'level' => 3,
    'pid' => '141100',
  ),
  141122 => 
  array (
    'id' => '141122',
    'name' => '交城县',
    'level' => 3,
    'pid' => '141100',
  ),
  141123 => 
  array (
    'id' => '141123',
    'name' => '兴县',
    'level' => 3,
    'pid' => '141100',
  ),
  141124 => 
  array (
    'id' => '141124',
    'name' => '临县',
    'level' => 3,
    'pid' => '141100',
  ),
  141125 => 
  array (
    'id' => '141125',
    'name' => '柳林县',
    'level' => 3,
    'pid' => '141100',
  ),
  141126 => 
  array (
    'id' => '141126',
    'name' => '石楼县',
    'level' => 3,
    'pid' => '141100',
  ),
  141127 => 
  array (
    'id' => '141127',
    'name' => '岚县',
    'level' => 3,
    'pid' => '141100',
  ),
  141128 => 
  array (
    'id' => '141128',
    'name' => '方山县',
    'level' => 3,
    'pid' => '141100',
  ),
  141129 => 
  array (
    'id' => '141129',
    'name' => '中阳县',
    'level' => 3,
    'pid' => '141100',
  ),
  141130 => 
  array (
    'id' => '141130',
    'name' => '交口县',
    'level' => 3,
    'pid' => '141100',
  ),
  141181 => 
  array (
    'id' => '141181',
    'name' => '孝义市',
    'level' => 3,
    'pid' => '141100',
  ),
  141182 => 
  array (
    'id' => '141182',
    'name' => '汾阳市',
    'level' => 3,
    'pid' => '141100',
  ),
  150000 => 
  array (
    'id' => '150000',
    'name' => '内蒙古自治区',
    'level' => 1,
    'pid' => 0,
  ),
  150100 => 
  array (
    'id' => '150100',
    'name' => '呼和浩特市',
    'level' => 2,
    'pid' => '150000',
  ),
  150101 => 
  array (
    'id' => '150101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150100',
  ),
  150102 => 
  array (
    'id' => '150102',
    'name' => '新城区',
    'level' => 3,
    'pid' => '150100',
  ),
  150103 => 
  array (
    'id' => '150103',
    'name' => '回民区',
    'level' => 3,
    'pid' => '150100',
  ),
  150104 => 
  array (
    'id' => '150104',
    'name' => '玉泉区',
    'level' => 3,
    'pid' => '150100',
  ),
  150105 => 
  array (
    'id' => '150105',
    'name' => '赛罕区',
    'level' => 3,
    'pid' => '150100',
  ),
  150121 => 
  array (
    'id' => '150121',
    'name' => '土默特左旗',
    'level' => 3,
    'pid' => '150100',
  ),
  150122 => 
  array (
    'id' => '150122',
    'name' => '托克托县',
    'level' => 3,
    'pid' => '150100',
  ),
  150123 => 
  array (
    'id' => '150123',
    'name' => '和林格尔县',
    'level' => 3,
    'pid' => '150100',
  ),
  150124 => 
  array (
    'id' => '150124',
    'name' => '清水河县',
    'level' => 3,
    'pid' => '150100',
  ),
  150125 => 
  array (
    'id' => '150125',
    'name' => '武川县',
    'level' => 3,
    'pid' => '150100',
  ),
  150200 => 
  array (
    'id' => '150200',
    'name' => '包头市',
    'level' => 2,
    'pid' => '150000',
  ),
  150201 => 
  array (
    'id' => '150201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150200',
  ),
  150202 => 
  array (
    'id' => '150202',
    'name' => '东河区',
    'level' => 3,
    'pid' => '150200',
  ),
  150203 => 
  array (
    'id' => '150203',
    'name' => '昆都仑区',
    'level' => 3,
    'pid' => '150200',
  ),
  150204 => 
  array (
    'id' => '150204',
    'name' => '青山区',
    'level' => 3,
    'pid' => '150200',
  ),
  150205 => 
  array (
    'id' => '150205',
    'name' => '石拐区',
    'level' => 3,
    'pid' => '150200',
  ),
  150206 => 
  array (
    'id' => '150206',
    'name' => '白云鄂博矿区',
    'level' => 3,
    'pid' => '150200',
  ),
  150207 => 
  array (
    'id' => '150207',
    'name' => '九原区',
    'level' => 3,
    'pid' => '150200',
  ),
  150221 => 
  array (
    'id' => '150221',
    'name' => '土默特右旗',
    'level' => 3,
    'pid' => '150200',
  ),
  150222 => 
  array (
    'id' => '150222',
    'name' => '固阳县',
    'level' => 3,
    'pid' => '150200',
  ),
  150223 => 
  array (
    'id' => '150223',
    'name' => '达尔罕茂明安联合旗',
    'level' => 3,
    'pid' => '150200',
  ),
  150300 => 
  array (
    'id' => '150300',
    'name' => '乌海市',
    'level' => 2,
    'pid' => '150000',
  ),
  150301 => 
  array (
    'id' => '150301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150300',
  ),
  150302 => 
  array (
    'id' => '150302',
    'name' => '海勃湾区',
    'level' => 3,
    'pid' => '150300',
  ),
  150303 => 
  array (
    'id' => '150303',
    'name' => '海南区',
    'level' => 3,
    'pid' => '150300',
  ),
  150304 => 
  array (
    'id' => '150304',
    'name' => '乌达区',
    'level' => 3,
    'pid' => '150300',
  ),
  150400 => 
  array (
    'id' => '150400',
    'name' => '赤峰市',
    'level' => 2,
    'pid' => '150000',
  ),
  150401 => 
  array (
    'id' => '150401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150400',
  ),
  150402 => 
  array (
    'id' => '150402',
    'name' => '红山区',
    'level' => 3,
    'pid' => '150400',
  ),
  150403 => 
  array (
    'id' => '150403',
    'name' => '元宝山区',
    'level' => 3,
    'pid' => '150400',
  ),
  150404 => 
  array (
    'id' => '150404',
    'name' => '松山区',
    'level' => 3,
    'pid' => '150400',
  ),
  150421 => 
  array (
    'id' => '150421',
    'name' => '阿鲁科尔沁旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150422 => 
  array (
    'id' => '150422',
    'name' => '巴林左旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150423 => 
  array (
    'id' => '150423',
    'name' => '巴林右旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150424 => 
  array (
    'id' => '150424',
    'name' => '林西县',
    'level' => 3,
    'pid' => '150400',
  ),
  150425 => 
  array (
    'id' => '150425',
    'name' => '克什克腾旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150426 => 
  array (
    'id' => '150426',
    'name' => '翁牛特旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150428 => 
  array (
    'id' => '150428',
    'name' => '喀喇沁旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150429 => 
  array (
    'id' => '150429',
    'name' => '宁城县',
    'level' => 3,
    'pid' => '150400',
  ),
  150430 => 
  array (
    'id' => '150430',
    'name' => '敖汉旗',
    'level' => 3,
    'pid' => '150400',
  ),
  150500 => 
  array (
    'id' => '150500',
    'name' => '通辽市',
    'level' => 2,
    'pid' => '150000',
  ),
  150501 => 
  array (
    'id' => '150501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150500',
  ),
  150502 => 
  array (
    'id' => '150502',
    'name' => '科尔沁区',
    'level' => 3,
    'pid' => '150500',
  ),
  150521 => 
  array (
    'id' => '150521',
    'name' => '科尔沁左翼中旗',
    'level' => 3,
    'pid' => '150500',
  ),
  150522 => 
  array (
    'id' => '150522',
    'name' => '科尔沁左翼后旗',
    'level' => 3,
    'pid' => '150500',
  ),
  150523 => 
  array (
    'id' => '150523',
    'name' => '开鲁县',
    'level' => 3,
    'pid' => '150500',
  ),
  150524 => 
  array (
    'id' => '150524',
    'name' => '库伦旗',
    'level' => 3,
    'pid' => '150500',
  ),
  150525 => 
  array (
    'id' => '150525',
    'name' => '奈曼旗',
    'level' => 3,
    'pid' => '150500',
  ),
  150526 => 
  array (
    'id' => '150526',
    'name' => '扎鲁特旗',
    'level' => 3,
    'pid' => '150500',
  ),
  150581 => 
  array (
    'id' => '150581',
    'name' => '霍林郭勒市',
    'level' => 3,
    'pid' => '150500',
  ),
  150600 => 
  array (
    'id' => '150600',
    'name' => '鄂尔多斯市',
    'level' => 2,
    'pid' => '150000',
  ),
  150601 => 
  array (
    'id' => '150601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150600',
  ),
  150602 => 
  array (
    'id' => '150602',
    'name' => '东胜区',
    'level' => 3,
    'pid' => '150600',
  ),
  150621 => 
  array (
    'id' => '150621',
    'name' => '达拉特旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150622 => 
  array (
    'id' => '150622',
    'name' => '准格尔旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150623 => 
  array (
    'id' => '150623',
    'name' => '鄂托克前旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150624 => 
  array (
    'id' => '150624',
    'name' => '鄂托克旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150625 => 
  array (
    'id' => '150625',
    'name' => '杭锦旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150626 => 
  array (
    'id' => '150626',
    'name' => '乌审旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150627 => 
  array (
    'id' => '150627',
    'name' => '伊金霍洛旗',
    'level' => 3,
    'pid' => '150600',
  ),
  150700 => 
  array (
    'id' => '150700',
    'name' => '呼伦贝尔市',
    'level' => 2,
    'pid' => '150000',
  ),
  150701 => 
  array (
    'id' => '150701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150700',
  ),
  150702 => 
  array (
    'id' => '150702',
    'name' => '海拉尔区',
    'level' => 3,
    'pid' => '150700',
  ),
  150703 => 
  array (
    'id' => '150703',
    'name' => '扎赉诺尔区',
    'level' => 3,
    'pid' => '150700',
  ),
  150721 => 
  array (
    'id' => '150721',
    'name' => '阿荣旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150722 => 
  array (
    'id' => '150722',
    'name' => '莫力达瓦达斡尔族自治旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150723 => 
  array (
    'id' => '150723',
    'name' => '鄂伦春自治旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150724 => 
  array (
    'id' => '150724',
    'name' => '鄂温克族自治旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150725 => 
  array (
    'id' => '150725',
    'name' => '陈巴尔虎旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150726 => 
  array (
    'id' => '150726',
    'name' => '新巴尔虎左旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150727 => 
  array (
    'id' => '150727',
    'name' => '新巴尔虎右旗',
    'level' => 3,
    'pid' => '150700',
  ),
  150781 => 
  array (
    'id' => '150781',
    'name' => '满洲里市',
    'level' => 3,
    'pid' => '150700',
  ),
  150782 => 
  array (
    'id' => '150782',
    'name' => '牙克石市',
    'level' => 3,
    'pid' => '150700',
  ),
  150783 => 
  array (
    'id' => '150783',
    'name' => '扎兰屯市',
    'level' => 3,
    'pid' => '150700',
  ),
  150784 => 
  array (
    'id' => '150784',
    'name' => '额尔古纳市',
    'level' => 3,
    'pid' => '150700',
  ),
  150785 => 
  array (
    'id' => '150785',
    'name' => '根河市',
    'level' => 3,
    'pid' => '150700',
  ),
  150800 => 
  array (
    'id' => '150800',
    'name' => '巴彦淖尔市',
    'level' => 2,
    'pid' => '150000',
  ),
  150801 => 
  array (
    'id' => '150801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150800',
  ),
  150802 => 
  array (
    'id' => '150802',
    'name' => '临河区',
    'level' => 3,
    'pid' => '150800',
  ),
  150821 => 
  array (
    'id' => '150821',
    'name' => '五原县',
    'level' => 3,
    'pid' => '150800',
  ),
  150822 => 
  array (
    'id' => '150822',
    'name' => '磴口县',
    'level' => 3,
    'pid' => '150800',
  ),
  150823 => 
  array (
    'id' => '150823',
    'name' => '乌拉特前旗',
    'level' => 3,
    'pid' => '150800',
  ),
  150824 => 
  array (
    'id' => '150824',
    'name' => '乌拉特中旗',
    'level' => 3,
    'pid' => '150800',
  ),
  150825 => 
  array (
    'id' => '150825',
    'name' => '乌拉特后旗',
    'level' => 3,
    'pid' => '150800',
  ),
  150826 => 
  array (
    'id' => '150826',
    'name' => '杭锦后旗',
    'level' => 3,
    'pid' => '150800',
  ),
  150900 => 
  array (
    'id' => '150900',
    'name' => '乌兰察布市',
    'level' => 2,
    'pid' => '150000',
  ),
  150901 => 
  array (
    'id' => '150901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '150900',
  ),
  150902 => 
  array (
    'id' => '150902',
    'name' => '集宁区',
    'level' => 3,
    'pid' => '150900',
  ),
  150921 => 
  array (
    'id' => '150921',
    'name' => '卓资县',
    'level' => 3,
    'pid' => '150900',
  ),
  150922 => 
  array (
    'id' => '150922',
    'name' => '化德县',
    'level' => 3,
    'pid' => '150900',
  ),
  150923 => 
  array (
    'id' => '150923',
    'name' => '商都县',
    'level' => 3,
    'pid' => '150900',
  ),
  150924 => 
  array (
    'id' => '150924',
    'name' => '兴和县',
    'level' => 3,
    'pid' => '150900',
  ),
  150925 => 
  array (
    'id' => '150925',
    'name' => '凉城县',
    'level' => 3,
    'pid' => '150900',
  ),
  150926 => 
  array (
    'id' => '150926',
    'name' => '察哈尔右翼前旗',
    'level' => 3,
    'pid' => '150900',
  ),
  150927 => 
  array (
    'id' => '150927',
    'name' => '察哈尔右翼中旗',
    'level' => 3,
    'pid' => '150900',
  ),
  150928 => 
  array (
    'id' => '150928',
    'name' => '察哈尔右翼后旗',
    'level' => 3,
    'pid' => '150900',
  ),
  150929 => 
  array (
    'id' => '150929',
    'name' => '四子王旗',
    'level' => 3,
    'pid' => '150900',
  ),
  150981 => 
  array (
    'id' => '150981',
    'name' => '丰镇市',
    'level' => 3,
    'pid' => '150900',
  ),
  152200 => 
  array (
    'id' => '152200',
    'name' => '兴安盟',
    'level' => 2,
    'pid' => '150000',
  ),
  152201 => 
  array (
    'id' => '152201',
    'name' => '乌兰浩特市',
    'level' => 3,
    'pid' => '152200',
  ),
  152202 => 
  array (
    'id' => '152202',
    'name' => '阿尔山市',
    'level' => 3,
    'pid' => '152200',
  ),
  152221 => 
  array (
    'id' => '152221',
    'name' => '科尔沁右翼前旗',
    'level' => 3,
    'pid' => '152200',
  ),
  152222 => 
  array (
    'id' => '152222',
    'name' => '科尔沁右翼中旗',
    'level' => 3,
    'pid' => '152200',
  ),
  152223 => 
  array (
    'id' => '152223',
    'name' => '扎赉特旗',
    'level' => 3,
    'pid' => '152200',
  ),
  152224 => 
  array (
    'id' => '152224',
    'name' => '突泉县',
    'level' => 3,
    'pid' => '152200',
  ),
  152500 => 
  array (
    'id' => '152500',
    'name' => '锡林郭勒盟',
    'level' => 2,
    'pid' => '150000',
  ),
  152501 => 
  array (
    'id' => '152501',
    'name' => '二连浩特市',
    'level' => 3,
    'pid' => '152500',
  ),
  152502 => 
  array (
    'id' => '152502',
    'name' => '锡林浩特市',
    'level' => 3,
    'pid' => '152500',
  ),
  152522 => 
  array (
    'id' => '152522',
    'name' => '阿巴嘎旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152523 => 
  array (
    'id' => '152523',
    'name' => '苏尼特左旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152524 => 
  array (
    'id' => '152524',
    'name' => '苏尼特右旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152525 => 
  array (
    'id' => '152525',
    'name' => '东乌珠穆沁旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152526 => 
  array (
    'id' => '152526',
    'name' => '西乌珠穆沁旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152527 => 
  array (
    'id' => '152527',
    'name' => '太仆寺旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152528 => 
  array (
    'id' => '152528',
    'name' => '镶黄旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152529 => 
  array (
    'id' => '152529',
    'name' => '正镶白旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152530 => 
  array (
    'id' => '152530',
    'name' => '正蓝旗',
    'level' => 3,
    'pid' => '152500',
  ),
  152531 => 
  array (
    'id' => '152531',
    'name' => '多伦县',
    'level' => 3,
    'pid' => '152500',
  ),
  152900 => 
  array (
    'id' => '152900',
    'name' => '阿拉善盟',
    'level' => 2,
    'pid' => '150000',
  ),
  152921 => 
  array (
    'id' => '152921',
    'name' => '阿拉善左旗',
    'level' => 3,
    'pid' => '152900',
  ),
  152922 => 
  array (
    'id' => '152922',
    'name' => '阿拉善右旗',
    'level' => 3,
    'pid' => '152900',
  ),
  152923 => 
  array (
    'id' => '152923',
    'name' => '额济纳旗',
    'level' => 3,
    'pid' => '152900',
  ),
  210000 => 
  array (
    'id' => '210000',
    'name' => '辽宁省',
    'level' => 1,
    'pid' => 0,
  ),
  210100 => 
  array (
    'id' => '210100',
    'name' => '沈阳市',
    'level' => 2,
    'pid' => '210000',
  ),
  210101 => 
  array (
    'id' => '210101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210100',
  ),
  210102 => 
  array (
    'id' => '210102',
    'name' => '和平区',
    'level' => 3,
    'pid' => '210100',
  ),
  210103 => 
  array (
    'id' => '210103',
    'name' => '沈河区',
    'level' => 3,
    'pid' => '210100',
  ),
  210104 => 
  array (
    'id' => '210104',
    'name' => '大东区',
    'level' => 3,
    'pid' => '210100',
  ),
  210105 => 
  array (
    'id' => '210105',
    'name' => '皇姑区',
    'level' => 3,
    'pid' => '210100',
  ),
  210106 => 
  array (
    'id' => '210106',
    'name' => '铁西区',
    'level' => 3,
    'pid' => '210100',
  ),
  210111 => 
  array (
    'id' => '210111',
    'name' => '苏家屯区',
    'level' => 3,
    'pid' => '210100',
  ),
  210112 => 
  array (
    'id' => '210112',
    'name' => '浑南区',
    'level' => 3,
    'pid' => '210100',
  ),
  210113 => 
  array (
    'id' => '210113',
    'name' => '沈北新区',
    'level' => 3,
    'pid' => '210100',
  ),
  210114 => 
  array (
    'id' => '210114',
    'name' => '于洪区',
    'level' => 3,
    'pid' => '210100',
  ),
  210122 => 
  array (
    'id' => '210122',
    'name' => '辽中县',
    'level' => 3,
    'pid' => '210100',
  ),
  210123 => 
  array (
    'id' => '210123',
    'name' => '康平县',
    'level' => 3,
    'pid' => '210100',
  ),
  210124 => 
  array (
    'id' => '210124',
    'name' => '法库县',
    'level' => 3,
    'pid' => '210100',
  ),
  210181 => 
  array (
    'id' => '210181',
    'name' => '新民市',
    'level' => 3,
    'pid' => '210100',
  ),
  210200 => 
  array (
    'id' => '210200',
    'name' => '大连市',
    'level' => 2,
    'pid' => '210000',
  ),
  210201 => 
  array (
    'id' => '210201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210200',
  ),
  210202 => 
  array (
    'id' => '210202',
    'name' => '中山区',
    'level' => 3,
    'pid' => '210200',
  ),
  210203 => 
  array (
    'id' => '210203',
    'name' => '西岗区',
    'level' => 3,
    'pid' => '210200',
  ),
  210204 => 
  array (
    'id' => '210204',
    'name' => '沙河口区',
    'level' => 3,
    'pid' => '210200',
  ),
  210211 => 
  array (
    'id' => '210211',
    'name' => '甘井子区',
    'level' => 3,
    'pid' => '210200',
  ),
  210212 => 
  array (
    'id' => '210212',
    'name' => '旅顺口区',
    'level' => 3,
    'pid' => '210200',
  ),
  210213 => 
  array (
    'id' => '210213',
    'name' => '金州区',
    'level' => 3,
    'pid' => '210200',
  ),
  210224 => 
  array (
    'id' => '210224',
    'name' => '长海县',
    'level' => 3,
    'pid' => '210200',
  ),
  210281 => 
  array (
    'id' => '210281',
    'name' => '瓦房店市',
    'level' => 3,
    'pid' => '210200',
  ),
  210282 => 
  array (
    'id' => '210282',
    'name' => '普兰店市',
    'level' => 3,
    'pid' => '210200',
  ),
  210283 => 
  array (
    'id' => '210283',
    'name' => '庄河市',
    'level' => 3,
    'pid' => '210200',
  ),
  210300 => 
  array (
    'id' => '210300',
    'name' => '鞍山市',
    'level' => 2,
    'pid' => '210000',
  ),
  210301 => 
  array (
    'id' => '210301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210300',
  ),
  210302 => 
  array (
    'id' => '210302',
    'name' => '铁东区',
    'level' => 3,
    'pid' => '210300',
  ),
  210303 => 
  array (
    'id' => '210303',
    'name' => '铁西区',
    'level' => 3,
    'pid' => '210300',
  ),
  210304 => 
  array (
    'id' => '210304',
    'name' => '立山区',
    'level' => 3,
    'pid' => '210300',
  ),
  210311 => 
  array (
    'id' => '210311',
    'name' => '千山区',
    'level' => 3,
    'pid' => '210300',
  ),
  210321 => 
  array (
    'id' => '210321',
    'name' => '台安县',
    'level' => 3,
    'pid' => '210300',
  ),
  210323 => 
  array (
    'id' => '210323',
    'name' => '岫岩满族自治县',
    'level' => 3,
    'pid' => '210300',
  ),
  210381 => 
  array (
    'id' => '210381',
    'name' => '海城市',
    'level' => 3,
    'pid' => '210300',
  ),
  210400 => 
  array (
    'id' => '210400',
    'name' => '抚顺市',
    'level' => 2,
    'pid' => '210000',
  ),
  210401 => 
  array (
    'id' => '210401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210400',
  ),
  210402 => 
  array (
    'id' => '210402',
    'name' => '新抚区',
    'level' => 3,
    'pid' => '210400',
  ),
  210403 => 
  array (
    'id' => '210403',
    'name' => '东洲区',
    'level' => 3,
    'pid' => '210400',
  ),
  210404 => 
  array (
    'id' => '210404',
    'name' => '望花区',
    'level' => 3,
    'pid' => '210400',
  ),
  210411 => 
  array (
    'id' => '210411',
    'name' => '顺城区',
    'level' => 3,
    'pid' => '210400',
  ),
  210421 => 
  array (
    'id' => '210421',
    'name' => '抚顺县',
    'level' => 3,
    'pid' => '210400',
  ),
  210422 => 
  array (
    'id' => '210422',
    'name' => '新宾满族自治县',
    'level' => 3,
    'pid' => '210400',
  ),
  210423 => 
  array (
    'id' => '210423',
    'name' => '清原满族自治县',
    'level' => 3,
    'pid' => '210400',
  ),
  210500 => 
  array (
    'id' => '210500',
    'name' => '本溪市',
    'level' => 2,
    'pid' => '210000',
  ),
  210501 => 
  array (
    'id' => '210501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210500',
  ),
  210502 => 
  array (
    'id' => '210502',
    'name' => '平山区',
    'level' => 3,
    'pid' => '210500',
  ),
  210503 => 
  array (
    'id' => '210503',
    'name' => '溪湖区',
    'level' => 3,
    'pid' => '210500',
  ),
  210504 => 
  array (
    'id' => '210504',
    'name' => '明山区',
    'level' => 3,
    'pid' => '210500',
  ),
  210505 => 
  array (
    'id' => '210505',
    'name' => '南芬区',
    'level' => 3,
    'pid' => '210500',
  ),
  210521 => 
  array (
    'id' => '210521',
    'name' => '本溪满族自治县',
    'level' => 3,
    'pid' => '210500',
  ),
  210522 => 
  array (
    'id' => '210522',
    'name' => '桓仁满族自治县',
    'level' => 3,
    'pid' => '210500',
  ),
  210600 => 
  array (
    'id' => '210600',
    'name' => '丹东市',
    'level' => 2,
    'pid' => '210000',
  ),
  210601 => 
  array (
    'id' => '210601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210600',
  ),
  210602 => 
  array (
    'id' => '210602',
    'name' => '元宝区',
    'level' => 3,
    'pid' => '210600',
  ),
  210603 => 
  array (
    'id' => '210603',
    'name' => '振兴区',
    'level' => 3,
    'pid' => '210600',
  ),
  210604 => 
  array (
    'id' => '210604',
    'name' => '振安区',
    'level' => 3,
    'pid' => '210600',
  ),
  210624 => 
  array (
    'id' => '210624',
    'name' => '宽甸满族自治县',
    'level' => 3,
    'pid' => '210600',
  ),
  210681 => 
  array (
    'id' => '210681',
    'name' => '东港市',
    'level' => 3,
    'pid' => '210600',
  ),
  210682 => 
  array (
    'id' => '210682',
    'name' => '凤城市',
    'level' => 3,
    'pid' => '210600',
  ),
  210700 => 
  array (
    'id' => '210700',
    'name' => '锦州市',
    'level' => 2,
    'pid' => '210000',
  ),
  210701 => 
  array (
    'id' => '210701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210700',
  ),
  210702 => 
  array (
    'id' => '210702',
    'name' => '古塔区',
    'level' => 3,
    'pid' => '210700',
  ),
  210703 => 
  array (
    'id' => '210703',
    'name' => '凌河区',
    'level' => 3,
    'pid' => '210700',
  ),
  210711 => 
  array (
    'id' => '210711',
    'name' => '太和区',
    'level' => 3,
    'pid' => '210700',
  ),
  210726 => 
  array (
    'id' => '210726',
    'name' => '黑山县',
    'level' => 3,
    'pid' => '210700',
  ),
  210727 => 
  array (
    'id' => '210727',
    'name' => '义县',
    'level' => 3,
    'pid' => '210700',
  ),
  210781 => 
  array (
    'id' => '210781',
    'name' => '凌海市',
    'level' => 3,
    'pid' => '210700',
  ),
  210782 => 
  array (
    'id' => '210782',
    'name' => '北镇市',
    'level' => 3,
    'pid' => '210700',
  ),
  210800 => 
  array (
    'id' => '210800',
    'name' => '营口市',
    'level' => 2,
    'pid' => '210000',
  ),
  210801 => 
  array (
    'id' => '210801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210800',
  ),
  210802 => 
  array (
    'id' => '210802',
    'name' => '站前区',
    'level' => 3,
    'pid' => '210800',
  ),
  210803 => 
  array (
    'id' => '210803',
    'name' => '西市区',
    'level' => 3,
    'pid' => '210800',
  ),
  210804 => 
  array (
    'id' => '210804',
    'name' => '鲅鱼圈区',
    'level' => 3,
    'pid' => '210800',
  ),
  210811 => 
  array (
    'id' => '210811',
    'name' => '老边区',
    'level' => 3,
    'pid' => '210800',
  ),
  210881 => 
  array (
    'id' => '210881',
    'name' => '盖州市',
    'level' => 3,
    'pid' => '210800',
  ),
  210882 => 
  array (
    'id' => '210882',
    'name' => '大石桥市',
    'level' => 3,
    'pid' => '210800',
  ),
  210900 => 
  array (
    'id' => '210900',
    'name' => '阜新市',
    'level' => 2,
    'pid' => '210000',
  ),
  210901 => 
  array (
    'id' => '210901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '210900',
  ),
  210902 => 
  array (
    'id' => '210902',
    'name' => '海州区',
    'level' => 3,
    'pid' => '210900',
  ),
  210903 => 
  array (
    'id' => '210903',
    'name' => '新邱区',
    'level' => 3,
    'pid' => '210900',
  ),
  210904 => 
  array (
    'id' => '210904',
    'name' => '太平区',
    'level' => 3,
    'pid' => '210900',
  ),
  210905 => 
  array (
    'id' => '210905',
    'name' => '清河门区',
    'level' => 3,
    'pid' => '210900',
  ),
  210911 => 
  array (
    'id' => '210911',
    'name' => '细河区',
    'level' => 3,
    'pid' => '210900',
  ),
  210921 => 
  array (
    'id' => '210921',
    'name' => '阜新蒙古族自治县',
    'level' => 3,
    'pid' => '210900',
  ),
  210922 => 
  array (
    'id' => '210922',
    'name' => '彰武县',
    'level' => 3,
    'pid' => '210900',
  ),
  211000 => 
  array (
    'id' => '211000',
    'name' => '辽阳市',
    'level' => 2,
    'pid' => '210000',
  ),
  211001 => 
  array (
    'id' => '211001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '211000',
  ),
  211002 => 
  array (
    'id' => '211002',
    'name' => '白塔区',
    'level' => 3,
    'pid' => '211000',
  ),
  211003 => 
  array (
    'id' => '211003',
    'name' => '文圣区',
    'level' => 3,
    'pid' => '211000',
  ),
  211004 => 
  array (
    'id' => '211004',
    'name' => '宏伟区',
    'level' => 3,
    'pid' => '211000',
  ),
  211005 => 
  array (
    'id' => '211005',
    'name' => '弓长岭区',
    'level' => 3,
    'pid' => '211000',
  ),
  211011 => 
  array (
    'id' => '211011',
    'name' => '太子河区',
    'level' => 3,
    'pid' => '211000',
  ),
  211021 => 
  array (
    'id' => '211021',
    'name' => '辽阳县',
    'level' => 3,
    'pid' => '211000',
  ),
  211081 => 
  array (
    'id' => '211081',
    'name' => '灯塔市',
    'level' => 3,
    'pid' => '211000',
  ),
  211100 => 
  array (
    'id' => '211100',
    'name' => '盘锦市',
    'level' => 2,
    'pid' => '210000',
  ),
  211101 => 
  array (
    'id' => '211101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '211100',
  ),
  211102 => 
  array (
    'id' => '211102',
    'name' => '双台子区',
    'level' => 3,
    'pid' => '211100',
  ),
  211103 => 
  array (
    'id' => '211103',
    'name' => '兴隆台区',
    'level' => 3,
    'pid' => '211100',
  ),
  211121 => 
  array (
    'id' => '211121',
    'name' => '大洼县',
    'level' => 3,
    'pid' => '211100',
  ),
  211122 => 
  array (
    'id' => '211122',
    'name' => '盘山县',
    'level' => 3,
    'pid' => '211100',
  ),
  211200 => 
  array (
    'id' => '211200',
    'name' => '铁岭市',
    'level' => 2,
    'pid' => '210000',
  ),
  211201 => 
  array (
    'id' => '211201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '211200',
  ),
  211202 => 
  array (
    'id' => '211202',
    'name' => '银州区',
    'level' => 3,
    'pid' => '211200',
  ),
  211204 => 
  array (
    'id' => '211204',
    'name' => '清河区',
    'level' => 3,
    'pid' => '211200',
  ),
  211221 => 
  array (
    'id' => '211221',
    'name' => '铁岭县',
    'level' => 3,
    'pid' => '211200',
  ),
  211223 => 
  array (
    'id' => '211223',
    'name' => '西丰县',
    'level' => 3,
    'pid' => '211200',
  ),
  211224 => 
  array (
    'id' => '211224',
    'name' => '昌图县',
    'level' => 3,
    'pid' => '211200',
  ),
  211281 => 
  array (
    'id' => '211281',
    'name' => '调兵山市',
    'level' => 3,
    'pid' => '211200',
  ),
  211282 => 
  array (
    'id' => '211282',
    'name' => '开原市',
    'level' => 3,
    'pid' => '211200',
  ),
  211300 => 
  array (
    'id' => '211300',
    'name' => '朝阳市',
    'level' => 2,
    'pid' => '210000',
  ),
  211301 => 
  array (
    'id' => '211301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '211300',
  ),
  211302 => 
  array (
    'id' => '211302',
    'name' => '双塔区',
    'level' => 3,
    'pid' => '211300',
  ),
  211303 => 
  array (
    'id' => '211303',
    'name' => '龙城区',
    'level' => 3,
    'pid' => '211300',
  ),
  211321 => 
  array (
    'id' => '211321',
    'name' => '朝阳县',
    'level' => 3,
    'pid' => '211300',
  ),
  211322 => 
  array (
    'id' => '211322',
    'name' => '建平县',
    'level' => 3,
    'pid' => '211300',
  ),
  211324 => 
  array (
    'id' => '211324',
    'name' => '喀喇沁左翼蒙古族自治县',
    'level' => 3,
    'pid' => '211300',
  ),
  211381 => 
  array (
    'id' => '211381',
    'name' => '北票市',
    'level' => 3,
    'pid' => '211300',
  ),
  211382 => 
  array (
    'id' => '211382',
    'name' => '凌源市',
    'level' => 3,
    'pid' => '211300',
  ),
  211400 => 
  array (
    'id' => '211400',
    'name' => '葫芦岛市',
    'level' => 2,
    'pid' => '210000',
  ),
  211401 => 
  array (
    'id' => '211401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '211400',
  ),
  211402 => 
  array (
    'id' => '211402',
    'name' => '连山区',
    'level' => 3,
    'pid' => '211400',
  ),
  211403 => 
  array (
    'id' => '211403',
    'name' => '龙港区',
    'level' => 3,
    'pid' => '211400',
  ),
  211404 => 
  array (
    'id' => '211404',
    'name' => '南票区',
    'level' => 3,
    'pid' => '211400',
  ),
  211421 => 
  array (
    'id' => '211421',
    'name' => '绥中县',
    'level' => 3,
    'pid' => '211400',
  ),
  211422 => 
  array (
    'id' => '211422',
    'name' => '建昌县',
    'level' => 3,
    'pid' => '211400',
  ),
  211481 => 
  array (
    'id' => '211481',
    'name' => '兴城市',
    'level' => 3,
    'pid' => '211400',
  ),
  220000 => 
  array (
    'id' => '220000',
    'name' => '吉林省',
    'level' => 1,
    'pid' => 0,
  ),
  220100 => 
  array (
    'id' => '220100',
    'name' => '长春市',
    'level' => 2,
    'pid' => '220000',
  ),
  220101 => 
  array (
    'id' => '220101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220100',
  ),
  220102 => 
  array (
    'id' => '220102',
    'name' => '南关区',
    'level' => 3,
    'pid' => '220100',
  ),
  220103 => 
  array (
    'id' => '220103',
    'name' => '宽城区',
    'level' => 3,
    'pid' => '220100',
  ),
  220104 => 
  array (
    'id' => '220104',
    'name' => '朝阳区',
    'level' => 3,
    'pid' => '220100',
  ),
  220105 => 
  array (
    'id' => '220105',
    'name' => '二道区',
    'level' => 3,
    'pid' => '220100',
  ),
  220106 => 
  array (
    'id' => '220106',
    'name' => '绿园区',
    'level' => 3,
    'pid' => '220100',
  ),
  220112 => 
  array (
    'id' => '220112',
    'name' => '双阳区',
    'level' => 3,
    'pid' => '220100',
  ),
  220113 => 
  array (
    'id' => '220113',
    'name' => '九台区',
    'level' => 3,
    'pid' => '220100',
  ),
  220122 => 
  array (
    'id' => '220122',
    'name' => '农安县',
    'level' => 3,
    'pid' => '220100',
  ),
  220182 => 
  array (
    'id' => '220182',
    'name' => '榆树市',
    'level' => 3,
    'pid' => '220100',
  ),
  220183 => 
  array (
    'id' => '220183',
    'name' => '德惠市',
    'level' => 3,
    'pid' => '220100',
  ),
  220200 => 
  array (
    'id' => '220200',
    'name' => '吉林市',
    'level' => 2,
    'pid' => '220000',
  ),
  220201 => 
  array (
    'id' => '220201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220200',
  ),
  220202 => 
  array (
    'id' => '220202',
    'name' => '昌邑区',
    'level' => 3,
    'pid' => '220200',
  ),
  220203 => 
  array (
    'id' => '220203',
    'name' => '龙潭区',
    'level' => 3,
    'pid' => '220200',
  ),
  220204 => 
  array (
    'id' => '220204',
    'name' => '船营区',
    'level' => 3,
    'pid' => '220200',
  ),
  220211 => 
  array (
    'id' => '220211',
    'name' => '丰满区',
    'level' => 3,
    'pid' => '220200',
  ),
  220221 => 
  array (
    'id' => '220221',
    'name' => '永吉县',
    'level' => 3,
    'pid' => '220200',
  ),
  220281 => 
  array (
    'id' => '220281',
    'name' => '蛟河市',
    'level' => 3,
    'pid' => '220200',
  ),
  220282 => 
  array (
    'id' => '220282',
    'name' => '桦甸市',
    'level' => 3,
    'pid' => '220200',
  ),
  220283 => 
  array (
    'id' => '220283',
    'name' => '舒兰市',
    'level' => 3,
    'pid' => '220200',
  ),
  220284 => 
  array (
    'id' => '220284',
    'name' => '磐石市',
    'level' => 3,
    'pid' => '220200',
  ),
  220300 => 
  array (
    'id' => '220300',
    'name' => '四平市',
    'level' => 2,
    'pid' => '220000',
  ),
  220301 => 
  array (
    'id' => '220301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220300',
  ),
  220302 => 
  array (
    'id' => '220302',
    'name' => '铁西区',
    'level' => 3,
    'pid' => '220300',
  ),
  220303 => 
  array (
    'id' => '220303',
    'name' => '铁东区',
    'level' => 3,
    'pid' => '220300',
  ),
  220322 => 
  array (
    'id' => '220322',
    'name' => '梨树县',
    'level' => 3,
    'pid' => '220300',
  ),
  220323 => 
  array (
    'id' => '220323',
    'name' => '伊通满族自治县',
    'level' => 3,
    'pid' => '220300',
  ),
  220381 => 
  array (
    'id' => '220381',
    'name' => '公主岭市',
    'level' => 3,
    'pid' => '220300',
  ),
  220382 => 
  array (
    'id' => '220382',
    'name' => '双辽市',
    'level' => 3,
    'pid' => '220300',
  ),
  220400 => 
  array (
    'id' => '220400',
    'name' => '辽源市',
    'level' => 2,
    'pid' => '220000',
  ),
  220401 => 
  array (
    'id' => '220401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220400',
  ),
  220402 => 
  array (
    'id' => '220402',
    'name' => '龙山区',
    'level' => 3,
    'pid' => '220400',
  ),
  220403 => 
  array (
    'id' => '220403',
    'name' => '西安区',
    'level' => 3,
    'pid' => '220400',
  ),
  220421 => 
  array (
    'id' => '220421',
    'name' => '东丰县',
    'level' => 3,
    'pid' => '220400',
  ),
  220422 => 
  array (
    'id' => '220422',
    'name' => '东辽县',
    'level' => 3,
    'pid' => '220400',
  ),
  220500 => 
  array (
    'id' => '220500',
    'name' => '通化市',
    'level' => 2,
    'pid' => '220000',
  ),
  220501 => 
  array (
    'id' => '220501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220500',
  ),
  220502 => 
  array (
    'id' => '220502',
    'name' => '东昌区',
    'level' => 3,
    'pid' => '220500',
  ),
  220503 => 
  array (
    'id' => '220503',
    'name' => '二道江区',
    'level' => 3,
    'pid' => '220500',
  ),
  220521 => 
  array (
    'id' => '220521',
    'name' => '通化县',
    'level' => 3,
    'pid' => '220500',
  ),
  220523 => 
  array (
    'id' => '220523',
    'name' => '辉南县',
    'level' => 3,
    'pid' => '220500',
  ),
  220524 => 
  array (
    'id' => '220524',
    'name' => '柳河县',
    'level' => 3,
    'pid' => '220500',
  ),
  220581 => 
  array (
    'id' => '220581',
    'name' => '梅河口市',
    'level' => 3,
    'pid' => '220500',
  ),
  220582 => 
  array (
    'id' => '220582',
    'name' => '集安市',
    'level' => 3,
    'pid' => '220500',
  ),
  220600 => 
  array (
    'id' => '220600',
    'name' => '白山市',
    'level' => 2,
    'pid' => '220000',
  ),
  220601 => 
  array (
    'id' => '220601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220600',
  ),
  220602 => 
  array (
    'id' => '220602',
    'name' => '浑江区',
    'level' => 3,
    'pid' => '220600',
  ),
  220605 => 
  array (
    'id' => '220605',
    'name' => '江源区',
    'level' => 3,
    'pid' => '220600',
  ),
  220621 => 
  array (
    'id' => '220621',
    'name' => '抚松县',
    'level' => 3,
    'pid' => '220600',
  ),
  220622 => 
  array (
    'id' => '220622',
    'name' => '靖宇县',
    'level' => 3,
    'pid' => '220600',
  ),
  220623 => 
  array (
    'id' => '220623',
    'name' => '长白朝鲜族自治县',
    'level' => 3,
    'pid' => '220600',
  ),
  220681 => 
  array (
    'id' => '220681',
    'name' => '临江市',
    'level' => 3,
    'pid' => '220600',
  ),
  220700 => 
  array (
    'id' => '220700',
    'name' => '松原市',
    'level' => 2,
    'pid' => '220000',
  ),
  220701 => 
  array (
    'id' => '220701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220700',
  ),
  220702 => 
  array (
    'id' => '220702',
    'name' => '宁江区',
    'level' => 3,
    'pid' => '220700',
  ),
  220721 => 
  array (
    'id' => '220721',
    'name' => '前郭尔罗斯蒙古族自治县',
    'level' => 3,
    'pid' => '220700',
  ),
  220722 => 
  array (
    'id' => '220722',
    'name' => '长岭县',
    'level' => 3,
    'pid' => '220700',
  ),
  220723 => 
  array (
    'id' => '220723',
    'name' => '乾安县',
    'level' => 3,
    'pid' => '220700',
  ),
  220781 => 
  array (
    'id' => '220781',
    'name' => '扶余市',
    'level' => 3,
    'pid' => '220700',
  ),
  220800 => 
  array (
    'id' => '220800',
    'name' => '白城市',
    'level' => 2,
    'pid' => '220000',
  ),
  220801 => 
  array (
    'id' => '220801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '220800',
  ),
  220802 => 
  array (
    'id' => '220802',
    'name' => '洮北区',
    'level' => 3,
    'pid' => '220800',
  ),
  220821 => 
  array (
    'id' => '220821',
    'name' => '镇赉县',
    'level' => 3,
    'pid' => '220800',
  ),
  220822 => 
  array (
    'id' => '220822',
    'name' => '通榆县',
    'level' => 3,
    'pid' => '220800',
  ),
  220881 => 
  array (
    'id' => '220881',
    'name' => '洮南市',
    'level' => 3,
    'pid' => '220800',
  ),
  220882 => 
  array (
    'id' => '220882',
    'name' => '大安市',
    'level' => 3,
    'pid' => '220800',
  ),
  222400 => 
  array (
    'id' => '222400',
    'name' => '延边朝鲜族自治州',
    'level' => 2,
    'pid' => '220000',
  ),
  222401 => 
  array (
    'id' => '222401',
    'name' => '延吉市',
    'level' => 3,
    'pid' => '222400',
  ),
  222402 => 
  array (
    'id' => '222402',
    'name' => '图们市',
    'level' => 3,
    'pid' => '222400',
  ),
  222403 => 
  array (
    'id' => '222403',
    'name' => '敦化市',
    'level' => 3,
    'pid' => '222400',
  ),
  222404 => 
  array (
    'id' => '222404',
    'name' => '珲春市',
    'level' => 3,
    'pid' => '222400',
  ),
  222405 => 
  array (
    'id' => '222405',
    'name' => '龙井市',
    'level' => 3,
    'pid' => '222400',
  ),
  222406 => 
  array (
    'id' => '222406',
    'name' => '和龙市',
    'level' => 3,
    'pid' => '222400',
  ),
  222424 => 
  array (
    'id' => '222424',
    'name' => '汪清县',
    'level' => 3,
    'pid' => '222400',
  ),
  222426 => 
  array (
    'id' => '222426',
    'name' => '安图县',
    'level' => 3,
    'pid' => '222400',
  ),
  230000 => 
  array (
    'id' => '230000',
    'name' => '黑龙江省',
    'level' => 1,
    'pid' => 0,
  ),
  230100 => 
  array (
    'id' => '230100',
    'name' => '哈尔滨市',
    'level' => 2,
    'pid' => '230000',
  ),
  230101 => 
  array (
    'id' => '230101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230100',
  ),
  230102 => 
  array (
    'id' => '230102',
    'name' => '道里区',
    'level' => 3,
    'pid' => '230100',
  ),
  230103 => 
  array (
    'id' => '230103',
    'name' => '南岗区',
    'level' => 3,
    'pid' => '230100',
  ),
  230104 => 
  array (
    'id' => '230104',
    'name' => '道外区',
    'level' => 3,
    'pid' => '230100',
  ),
  230108 => 
  array (
    'id' => '230108',
    'name' => '平房区',
    'level' => 3,
    'pid' => '230100',
  ),
  230109 => 
  array (
    'id' => '230109',
    'name' => '松北区',
    'level' => 3,
    'pid' => '230100',
  ),
  230110 => 
  array (
    'id' => '230110',
    'name' => '香坊区',
    'level' => 3,
    'pid' => '230100',
  ),
  230111 => 
  array (
    'id' => '230111',
    'name' => '呼兰区',
    'level' => 3,
    'pid' => '230100',
  ),
  230112 => 
  array (
    'id' => '230112',
    'name' => '阿城区',
    'level' => 3,
    'pid' => '230100',
  ),
  230113 => 
  array (
    'id' => '230113',
    'name' => '双城区',
    'level' => 3,
    'pid' => '230100',
  ),
  230123 => 
  array (
    'id' => '230123',
    'name' => '依兰县',
    'level' => 3,
    'pid' => '230100',
  ),
  230124 => 
  array (
    'id' => '230124',
    'name' => '方正县',
    'level' => 3,
    'pid' => '230100',
  ),
  230125 => 
  array (
    'id' => '230125',
    'name' => '宾县',
    'level' => 3,
    'pid' => '230100',
  ),
  230126 => 
  array (
    'id' => '230126',
    'name' => '巴彦县',
    'level' => 3,
    'pid' => '230100',
  ),
  230127 => 
  array (
    'id' => '230127',
    'name' => '木兰县',
    'level' => 3,
    'pid' => '230100',
  ),
  230128 => 
  array (
    'id' => '230128',
    'name' => '通河县',
    'level' => 3,
    'pid' => '230100',
  ),
  230129 => 
  array (
    'id' => '230129',
    'name' => '延寿县',
    'level' => 3,
    'pid' => '230100',
  ),
  230183 => 
  array (
    'id' => '230183',
    'name' => '尚志市',
    'level' => 3,
    'pid' => '230100',
  ),
  230184 => 
  array (
    'id' => '230184',
    'name' => '五常市',
    'level' => 3,
    'pid' => '230100',
  ),
  230200 => 
  array (
    'id' => '230200',
    'name' => '齐齐哈尔市',
    'level' => 2,
    'pid' => '230000',
  ),
  230201 => 
  array (
    'id' => '230201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230200',
  ),
  230202 => 
  array (
    'id' => '230202',
    'name' => '龙沙区',
    'level' => 3,
    'pid' => '230200',
  ),
  230203 => 
  array (
    'id' => '230203',
    'name' => '建华区',
    'level' => 3,
    'pid' => '230200',
  ),
  230204 => 
  array (
    'id' => '230204',
    'name' => '铁锋区',
    'level' => 3,
    'pid' => '230200',
  ),
  230205 => 
  array (
    'id' => '230205',
    'name' => '昂昂溪区',
    'level' => 3,
    'pid' => '230200',
  ),
  230206 => 
  array (
    'id' => '230206',
    'name' => '富拉尔基区',
    'level' => 3,
    'pid' => '230200',
  ),
  230207 => 
  array (
    'id' => '230207',
    'name' => '碾子山区',
    'level' => 3,
    'pid' => '230200',
  ),
  230208 => 
  array (
    'id' => '230208',
    'name' => '梅里斯达斡尔族区',
    'level' => 3,
    'pid' => '230200',
  ),
  230221 => 
  array (
    'id' => '230221',
    'name' => '龙江县',
    'level' => 3,
    'pid' => '230200',
  ),
  230223 => 
  array (
    'id' => '230223',
    'name' => '依安县',
    'level' => 3,
    'pid' => '230200',
  ),
  230224 => 
  array (
    'id' => '230224',
    'name' => '泰来县',
    'level' => 3,
    'pid' => '230200',
  ),
  230225 => 
  array (
    'id' => '230225',
    'name' => '甘南县',
    'level' => 3,
    'pid' => '230200',
  ),
  230227 => 
  array (
    'id' => '230227',
    'name' => '富裕县',
    'level' => 3,
    'pid' => '230200',
  ),
  230229 => 
  array (
    'id' => '230229',
    'name' => '克山县',
    'level' => 3,
    'pid' => '230200',
  ),
  230230 => 
  array (
    'id' => '230230',
    'name' => '克东县',
    'level' => 3,
    'pid' => '230200',
  ),
  230231 => 
  array (
    'id' => '230231',
    'name' => '拜泉县',
    'level' => 3,
    'pid' => '230200',
  ),
  230281 => 
  array (
    'id' => '230281',
    'name' => '讷河市',
    'level' => 3,
    'pid' => '230200',
  ),
  230300 => 
  array (
    'id' => '230300',
    'name' => '鸡西市',
    'level' => 2,
    'pid' => '230000',
  ),
  230301 => 
  array (
    'id' => '230301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230300',
  ),
  230302 => 
  array (
    'id' => '230302',
    'name' => '鸡冠区',
    'level' => 3,
    'pid' => '230300',
  ),
  230303 => 
  array (
    'id' => '230303',
    'name' => '恒山区',
    'level' => 3,
    'pid' => '230300',
  ),
  230304 => 
  array (
    'id' => '230304',
    'name' => '滴道区',
    'level' => 3,
    'pid' => '230300',
  ),
  230305 => 
  array (
    'id' => '230305',
    'name' => '梨树区',
    'level' => 3,
    'pid' => '230300',
  ),
  230306 => 
  array (
    'id' => '230306',
    'name' => '城子河区',
    'level' => 3,
    'pid' => '230300',
  ),
  230307 => 
  array (
    'id' => '230307',
    'name' => '麻山区',
    'level' => 3,
    'pid' => '230300',
  ),
  230321 => 
  array (
    'id' => '230321',
    'name' => '鸡东县',
    'level' => 3,
    'pid' => '230300',
  ),
  230381 => 
  array (
    'id' => '230381',
    'name' => '虎林市',
    'level' => 3,
    'pid' => '230300',
  ),
  230382 => 
  array (
    'id' => '230382',
    'name' => '密山市',
    'level' => 3,
    'pid' => '230300',
  ),
  230400 => 
  array (
    'id' => '230400',
    'name' => '鹤岗市',
    'level' => 2,
    'pid' => '230000',
  ),
  230401 => 
  array (
    'id' => '230401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230400',
  ),
  230402 => 
  array (
    'id' => '230402',
    'name' => '向阳区',
    'level' => 3,
    'pid' => '230400',
  ),
  230403 => 
  array (
    'id' => '230403',
    'name' => '工农区',
    'level' => 3,
    'pid' => '230400',
  ),
  230404 => 
  array (
    'id' => '230404',
    'name' => '南山区',
    'level' => 3,
    'pid' => '230400',
  ),
  230405 => 
  array (
    'id' => '230405',
    'name' => '兴安区',
    'level' => 3,
    'pid' => '230400',
  ),
  230406 => 
  array (
    'id' => '230406',
    'name' => '东山区',
    'level' => 3,
    'pid' => '230400',
  ),
  230407 => 
  array (
    'id' => '230407',
    'name' => '兴山区',
    'level' => 3,
    'pid' => '230400',
  ),
  230421 => 
  array (
    'id' => '230421',
    'name' => '萝北县',
    'level' => 3,
    'pid' => '230400',
  ),
  230422 => 
  array (
    'id' => '230422',
    'name' => '绥滨县',
    'level' => 3,
    'pid' => '230400',
  ),
  230500 => 
  array (
    'id' => '230500',
    'name' => '双鸭山市',
    'level' => 2,
    'pid' => '230000',
  ),
  230501 => 
  array (
    'id' => '230501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230500',
  ),
  230502 => 
  array (
    'id' => '230502',
    'name' => '尖山区',
    'level' => 3,
    'pid' => '230500',
  ),
  230503 => 
  array (
    'id' => '230503',
    'name' => '岭东区',
    'level' => 3,
    'pid' => '230500',
  ),
  230505 => 
  array (
    'id' => '230505',
    'name' => '四方台区',
    'level' => 3,
    'pid' => '230500',
  ),
  230506 => 
  array (
    'id' => '230506',
    'name' => '宝山区',
    'level' => 3,
    'pid' => '230500',
  ),
  230521 => 
  array (
    'id' => '230521',
    'name' => '集贤县',
    'level' => 3,
    'pid' => '230500',
  ),
  230522 => 
  array (
    'id' => '230522',
    'name' => '友谊县',
    'level' => 3,
    'pid' => '230500',
  ),
  230523 => 
  array (
    'id' => '230523',
    'name' => '宝清县',
    'level' => 3,
    'pid' => '230500',
  ),
  230524 => 
  array (
    'id' => '230524',
    'name' => '饶河县',
    'level' => 3,
    'pid' => '230500',
  ),
  230600 => 
  array (
    'id' => '230600',
    'name' => '大庆市',
    'level' => 2,
    'pid' => '230000',
  ),
  230601 => 
  array (
    'id' => '230601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230600',
  ),
  230602 => 
  array (
    'id' => '230602',
    'name' => '萨尔图区',
    'level' => 3,
    'pid' => '230600',
  ),
  230603 => 
  array (
    'id' => '230603',
    'name' => '龙凤区',
    'level' => 3,
    'pid' => '230600',
  ),
  230604 => 
  array (
    'id' => '230604',
    'name' => '让胡路区',
    'level' => 3,
    'pid' => '230600',
  ),
  230605 => 
  array (
    'id' => '230605',
    'name' => '红岗区',
    'level' => 3,
    'pid' => '230600',
  ),
  230606 => 
  array (
    'id' => '230606',
    'name' => '大同区',
    'level' => 3,
    'pid' => '230600',
  ),
  230621 => 
  array (
    'id' => '230621',
    'name' => '肇州县',
    'level' => 3,
    'pid' => '230600',
  ),
  230622 => 
  array (
    'id' => '230622',
    'name' => '肇源县',
    'level' => 3,
    'pid' => '230600',
  ),
  230623 => 
  array (
    'id' => '230623',
    'name' => '林甸县',
    'level' => 3,
    'pid' => '230600',
  ),
  230624 => 
  array (
    'id' => '230624',
    'name' => '杜尔伯特蒙古族自治县',
    'level' => 3,
    'pid' => '230600',
  ),
  230700 => 
  array (
    'id' => '230700',
    'name' => '伊春市',
    'level' => 2,
    'pid' => '230000',
  ),
  230701 => 
  array (
    'id' => '230701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230700',
  ),
  230702 => 
  array (
    'id' => '230702',
    'name' => '伊春区',
    'level' => 3,
    'pid' => '230700',
  ),
  230703 => 
  array (
    'id' => '230703',
    'name' => '南岔区',
    'level' => 3,
    'pid' => '230700',
  ),
  230704 => 
  array (
    'id' => '230704',
    'name' => '友好区',
    'level' => 3,
    'pid' => '230700',
  ),
  230705 => 
  array (
    'id' => '230705',
    'name' => '西林区',
    'level' => 3,
    'pid' => '230700',
  ),
  230706 => 
  array (
    'id' => '230706',
    'name' => '翠峦区',
    'level' => 3,
    'pid' => '230700',
  ),
  230707 => 
  array (
    'id' => '230707',
    'name' => '新青区',
    'level' => 3,
    'pid' => '230700',
  ),
  230708 => 
  array (
    'id' => '230708',
    'name' => '美溪区',
    'level' => 3,
    'pid' => '230700',
  ),
  230709 => 
  array (
    'id' => '230709',
    'name' => '金山屯区',
    'level' => 3,
    'pid' => '230700',
  ),
  230710 => 
  array (
    'id' => '230710',
    'name' => '五营区',
    'level' => 3,
    'pid' => '230700',
  ),
  230711 => 
  array (
    'id' => '230711',
    'name' => '乌马河区',
    'level' => 3,
    'pid' => '230700',
  ),
  230712 => 
  array (
    'id' => '230712',
    'name' => '汤旺河区',
    'level' => 3,
    'pid' => '230700',
  ),
  230713 => 
  array (
    'id' => '230713',
    'name' => '带岭区',
    'level' => 3,
    'pid' => '230700',
  ),
  230714 => 
  array (
    'id' => '230714',
    'name' => '乌伊岭区',
    'level' => 3,
    'pid' => '230700',
  ),
  230715 => 
  array (
    'id' => '230715',
    'name' => '红星区',
    'level' => 3,
    'pid' => '230700',
  ),
  230716 => 
  array (
    'id' => '230716',
    'name' => '上甘岭区',
    'level' => 3,
    'pid' => '230700',
  ),
  230722 => 
  array (
    'id' => '230722',
    'name' => '嘉荫县',
    'level' => 3,
    'pid' => '230700',
  ),
  230781 => 
  array (
    'id' => '230781',
    'name' => '铁力市',
    'level' => 3,
    'pid' => '230700',
  ),
  230800 => 
  array (
    'id' => '230800',
    'name' => '佳木斯市',
    'level' => 2,
    'pid' => '230000',
  ),
  230801 => 
  array (
    'id' => '230801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230800',
  ),
  230803 => 
  array (
    'id' => '230803',
    'name' => '向阳区',
    'level' => 3,
    'pid' => '230800',
  ),
  230804 => 
  array (
    'id' => '230804',
    'name' => '前进区',
    'level' => 3,
    'pid' => '230800',
  ),
  230805 => 
  array (
    'id' => '230805',
    'name' => '东风区',
    'level' => 3,
    'pid' => '230800',
  ),
  230811 => 
  array (
    'id' => '230811',
    'name' => '郊区',
    'level' => 3,
    'pid' => '230800',
  ),
  230822 => 
  array (
    'id' => '230822',
    'name' => '桦南县',
    'level' => 3,
    'pid' => '230800',
  ),
  230826 => 
  array (
    'id' => '230826',
    'name' => '桦川县',
    'level' => 3,
    'pid' => '230800',
  ),
  230828 => 
  array (
    'id' => '230828',
    'name' => '汤原县',
    'level' => 3,
    'pid' => '230800',
  ),
  230833 => 
  array (
    'id' => '230833',
    'name' => '抚远县',
    'level' => 3,
    'pid' => '230800',
  ),
  230881 => 
  array (
    'id' => '230881',
    'name' => '同江市',
    'level' => 3,
    'pid' => '230800',
  ),
  230882 => 
  array (
    'id' => '230882',
    'name' => '富锦市',
    'level' => 3,
    'pid' => '230800',
  ),
  230900 => 
  array (
    'id' => '230900',
    'name' => '七台河市',
    'level' => 2,
    'pid' => '230000',
  ),
  230901 => 
  array (
    'id' => '230901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '230900',
  ),
  230902 => 
  array (
    'id' => '230902',
    'name' => '新兴区',
    'level' => 3,
    'pid' => '230900',
  ),
  230903 => 
  array (
    'id' => '230903',
    'name' => '桃山区',
    'level' => 3,
    'pid' => '230900',
  ),
  230904 => 
  array (
    'id' => '230904',
    'name' => '茄子河区',
    'level' => 3,
    'pid' => '230900',
  ),
  230921 => 
  array (
    'id' => '230921',
    'name' => '勃利县',
    'level' => 3,
    'pid' => '230900',
  ),
  231000 => 
  array (
    'id' => '231000',
    'name' => '牡丹江市',
    'level' => 2,
    'pid' => '230000',
  ),
  231001 => 
  array (
    'id' => '231001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '231000',
  ),
  231002 => 
  array (
    'id' => '231002',
    'name' => '东安区',
    'level' => 3,
    'pid' => '231000',
  ),
  231003 => 
  array (
    'id' => '231003',
    'name' => '阳明区',
    'level' => 3,
    'pid' => '231000',
  ),
  231004 => 
  array (
    'id' => '231004',
    'name' => '爱民区',
    'level' => 3,
    'pid' => '231000',
  ),
  231005 => 
  array (
    'id' => '231005',
    'name' => '西安区',
    'level' => 3,
    'pid' => '231000',
  ),
  231024 => 
  array (
    'id' => '231024',
    'name' => '东宁县',
    'level' => 3,
    'pid' => '231000',
  ),
  231025 => 
  array (
    'id' => '231025',
    'name' => '林口县',
    'level' => 3,
    'pid' => '231000',
  ),
  231081 => 
  array (
    'id' => '231081',
    'name' => '绥芬河市',
    'level' => 3,
    'pid' => '231000',
  ),
  231083 => 
  array (
    'id' => '231083',
    'name' => '海林市',
    'level' => 3,
    'pid' => '231000',
  ),
  231084 => 
  array (
    'id' => '231084',
    'name' => '宁安市',
    'level' => 3,
    'pid' => '231000',
  ),
  231085 => 
  array (
    'id' => '231085',
    'name' => '穆棱市',
    'level' => 3,
    'pid' => '231000',
  ),
  231100 => 
  array (
    'id' => '231100',
    'name' => '黑河市',
    'level' => 2,
    'pid' => '230000',
  ),
  231101 => 
  array (
    'id' => '231101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '231100',
  ),
  231102 => 
  array (
    'id' => '231102',
    'name' => '爱辉区',
    'level' => 3,
    'pid' => '231100',
  ),
  231121 => 
  array (
    'id' => '231121',
    'name' => '嫩江县',
    'level' => 3,
    'pid' => '231100',
  ),
  231123 => 
  array (
    'id' => '231123',
    'name' => '逊克县',
    'level' => 3,
    'pid' => '231100',
  ),
  231124 => 
  array (
    'id' => '231124',
    'name' => '孙吴县',
    'level' => 3,
    'pid' => '231100',
  ),
  231181 => 
  array (
    'id' => '231181',
    'name' => '北安市',
    'level' => 3,
    'pid' => '231100',
  ),
  231182 => 
  array (
    'id' => '231182',
    'name' => '五大连池市',
    'level' => 3,
    'pid' => '231100',
  ),
  231200 => 
  array (
    'id' => '231200',
    'name' => '绥化市',
    'level' => 2,
    'pid' => '230000',
  ),
  231201 => 
  array (
    'id' => '231201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '231200',
  ),
  231202 => 
  array (
    'id' => '231202',
    'name' => '北林区',
    'level' => 3,
    'pid' => '231200',
  ),
  231221 => 
  array (
    'id' => '231221',
    'name' => '望奎县',
    'level' => 3,
    'pid' => '231200',
  ),
  231222 => 
  array (
    'id' => '231222',
    'name' => '兰西县',
    'level' => 3,
    'pid' => '231200',
  ),
  231223 => 
  array (
    'id' => '231223',
    'name' => '青冈县',
    'level' => 3,
    'pid' => '231200',
  ),
  231224 => 
  array (
    'id' => '231224',
    'name' => '庆安县',
    'level' => 3,
    'pid' => '231200',
  ),
  231225 => 
  array (
    'id' => '231225',
    'name' => '明水县',
    'level' => 3,
    'pid' => '231200',
  ),
  231226 => 
  array (
    'id' => '231226',
    'name' => '绥棱县',
    'level' => 3,
    'pid' => '231200',
  ),
  231281 => 
  array (
    'id' => '231281',
    'name' => '安达市',
    'level' => 3,
    'pid' => '231200',
  ),
  231282 => 
  array (
    'id' => '231282',
    'name' => '肇东市',
    'level' => 3,
    'pid' => '231200',
  ),
  231283 => 
  array (
    'id' => '231283',
    'name' => '海伦市',
    'level' => 3,
    'pid' => '231200',
  ),
  232700 => 
  array (
    'id' => '232700',
    'name' => '大兴安岭地区',
    'level' => 2,
    'pid' => '230000',
  ),
  232721 => 
  array (
    'id' => '232721',
    'name' => '呼玛县',
    'level' => 3,
    'pid' => '232700',
  ),
  232722 => 
  array (
    'id' => '232722',
    'name' => '塔河县',
    'level' => 3,
    'pid' => '232700',
  ),
  232723 => 
  array (
    'id' => '232723',
    'name' => '漠河县',
    'level' => 3,
    'pid' => '232700',
  ),
  310000 => 
  array (
    'id' => '310000',
    'name' => '上海市',
    'level' => 1,
    'pid' => 0,
  ),
  310100 => 
  array (
    'id' => '310100',
    'name' => '市辖区',
    'level' => 2,
    'pid' => '310000',
  ),
  310101 => 
  array (
    'id' => '310101',
    'name' => '黄浦区',
    'level' => 3,
    'pid' => '310100',
  ),
  310104 => 
  array (
    'id' => '310104',
    'name' => '徐汇区',
    'level' => 3,
    'pid' => '310100',
  ),
  310105 => 
  array (
    'id' => '310105',
    'name' => '长宁区',
    'level' => 3,
    'pid' => '310100',
  ),
  310106 => 
  array (
    'id' => '310106',
    'name' => '静安区',
    'level' => 3,
    'pid' => '310100',
  ),
  310107 => 
  array (
    'id' => '310107',
    'name' => '普陀区',
    'level' => 3,
    'pid' => '310100',
  ),
  310108 => 
  array (
    'id' => '310108',
    'name' => '闸北区',
    'level' => 3,
    'pid' => '310100',
  ),
  310109 => 
  array (
    'id' => '310109',
    'name' => '虹口区',
    'level' => 3,
    'pid' => '310100',
  ),
  310110 => 
  array (
    'id' => '310110',
    'name' => '杨浦区',
    'level' => 3,
    'pid' => '310100',
  ),
  310112 => 
  array (
    'id' => '310112',
    'name' => '闵行区',
    'level' => 3,
    'pid' => '310100',
  ),
  310113 => 
  array (
    'id' => '310113',
    'name' => '宝山区',
    'level' => 3,
    'pid' => '310100',
  ),
  310114 => 
  array (
    'id' => '310114',
    'name' => '嘉定区',
    'level' => 3,
    'pid' => '310100',
  ),
  310115 => 
  array (
    'id' => '310115',
    'name' => '浦东新区',
    'level' => 3,
    'pid' => '310100',
  ),
  310116 => 
  array (
    'id' => '310116',
    'name' => '金山区',
    'level' => 3,
    'pid' => '310100',
  ),
  310117 => 
  array (
    'id' => '310117',
    'name' => '松江区',
    'level' => 3,
    'pid' => '310100',
  ),
  310118 => 
  array (
    'id' => '310118',
    'name' => '青浦区',
    'level' => 3,
    'pid' => '310100',
  ),
  310120 => 
  array (
    'id' => '310120',
    'name' => '奉贤区',
    'level' => 3,
    'pid' => '310100',
  ),
  310200 => 
  array (
    'id' => '310200',
    'name' => '县',
    'level' => 2,
    'pid' => '310000',
  ),
  310230 => 
  array (
    'id' => '310230',
    'name' => '崇明县',
    'level' => 3,
    'pid' => '310200',
  ),
  320000 => 
  array (
    'id' => '320000',
    'name' => '江苏省',
    'level' => 1,
    'pid' => 0,
  ),
  320100 => 
  array (
    'id' => '320100',
    'name' => '南京市',
    'level' => 2,
    'pid' => '320000',
  ),
  320101 => 
  array (
    'id' => '320101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320100',
  ),
  320102 => 
  array (
    'id' => '320102',
    'name' => '玄武区',
    'level' => 3,
    'pid' => '320100',
  ),
  320104 => 
  array (
    'id' => '320104',
    'name' => '秦淮区',
    'level' => 3,
    'pid' => '320100',
  ),
  320105 => 
  array (
    'id' => '320105',
    'name' => '建邺区',
    'level' => 3,
    'pid' => '320100',
  ),
  320106 => 
  array (
    'id' => '320106',
    'name' => '鼓楼区',
    'level' => 3,
    'pid' => '320100',
  ),
  320111 => 
  array (
    'id' => '320111',
    'name' => '浦口区',
    'level' => 3,
    'pid' => '320100',
  ),
  320113 => 
  array (
    'id' => '320113',
    'name' => '栖霞区',
    'level' => 3,
    'pid' => '320100',
  ),
  320114 => 
  array (
    'id' => '320114',
    'name' => '雨花台区',
    'level' => 3,
    'pid' => '320100',
  ),
  320115 => 
  array (
    'id' => '320115',
    'name' => '江宁区',
    'level' => 3,
    'pid' => '320100',
  ),
  320116 => 
  array (
    'id' => '320116',
    'name' => '六合区',
    'level' => 3,
    'pid' => '320100',
  ),
  320117 => 
  array (
    'id' => '320117',
    'name' => '溧水区',
    'level' => 3,
    'pid' => '320100',
  ),
  320118 => 
  array (
    'id' => '320118',
    'name' => '高淳区',
    'level' => 3,
    'pid' => '320100',
  ),
  320200 => 
  array (
    'id' => '320200',
    'name' => '无锡市',
    'level' => 2,
    'pid' => '320000',
  ),
  320201 => 
  array (
    'id' => '320201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320200',
  ),
  320202 => 
  array (
    'id' => '320202',
    'name' => '崇安区',
    'level' => 3,
    'pid' => '320200',
  ),
  320203 => 
  array (
    'id' => '320203',
    'name' => '南长区',
    'level' => 3,
    'pid' => '320200',
  ),
  320204 => 
  array (
    'id' => '320204',
    'name' => '北塘区',
    'level' => 3,
    'pid' => '320200',
  ),
  320205 => 
  array (
    'id' => '320205',
    'name' => '锡山区',
    'level' => 3,
    'pid' => '320200',
  ),
  320206 => 
  array (
    'id' => '320206',
    'name' => '惠山区',
    'level' => 3,
    'pid' => '320200',
  ),
  320211 => 
  array (
    'id' => '320211',
    'name' => '滨湖区',
    'level' => 3,
    'pid' => '320200',
  ),
  320281 => 
  array (
    'id' => '320281',
    'name' => '江阴市',
    'level' => 3,
    'pid' => '320200',
  ),
  320282 => 
  array (
    'id' => '320282',
    'name' => '宜兴市',
    'level' => 3,
    'pid' => '320200',
  ),
  320300 => 
  array (
    'id' => '320300',
    'name' => '徐州市',
    'level' => 2,
    'pid' => '320000',
  ),
  320301 => 
  array (
    'id' => '320301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320300',
  ),
  320302 => 
  array (
    'id' => '320302',
    'name' => '鼓楼区',
    'level' => 3,
    'pid' => '320300',
  ),
  320303 => 
  array (
    'id' => '320303',
    'name' => '云龙区',
    'level' => 3,
    'pid' => '320300',
  ),
  320305 => 
  array (
    'id' => '320305',
    'name' => '贾汪区',
    'level' => 3,
    'pid' => '320300',
  ),
  320311 => 
  array (
    'id' => '320311',
    'name' => '泉山区',
    'level' => 3,
    'pid' => '320300',
  ),
  320312 => 
  array (
    'id' => '320312',
    'name' => '铜山区',
    'level' => 3,
    'pid' => '320300',
  ),
  320321 => 
  array (
    'id' => '320321',
    'name' => '丰县',
    'level' => 3,
    'pid' => '320300',
  ),
  320322 => 
  array (
    'id' => '320322',
    'name' => '沛县',
    'level' => 3,
    'pid' => '320300',
  ),
  320324 => 
  array (
    'id' => '320324',
    'name' => '睢宁县',
    'level' => 3,
    'pid' => '320300',
  ),
  320381 => 
  array (
    'id' => '320381',
    'name' => '新沂市',
    'level' => 3,
    'pid' => '320300',
  ),
  320382 => 
  array (
    'id' => '320382',
    'name' => '邳州市',
    'level' => 3,
    'pid' => '320300',
  ),
  320400 => 
  array (
    'id' => '320400',
    'name' => '常州市',
    'level' => 2,
    'pid' => '320000',
  ),
  320401 => 
  array (
    'id' => '320401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320400',
  ),
  320402 => 
  array (
    'id' => '320402',
    'name' => '天宁区',
    'level' => 3,
    'pid' => '320400',
  ),
  320404 => 
  array (
    'id' => '320404',
    'name' => '钟楼区',
    'level' => 3,
    'pid' => '320400',
  ),
  320411 => 
  array (
    'id' => '320411',
    'name' => '新北区',
    'level' => 3,
    'pid' => '320400',
  ),
  320412 => 
  array (
    'id' => '320412',
    'name' => '武进区',
    'level' => 3,
    'pid' => '320400',
  ),
  320413 => 
  array (
    'id' => '320413',
    'name' => '金坛区',
    'level' => 3,
    'pid' => '320400',
  ),
  320481 => 
  array (
    'id' => '320481',
    'name' => '溧阳市',
    'level' => 3,
    'pid' => '320400',
  ),
  320500 => 
  array (
    'id' => '320500',
    'name' => '苏州市',
    'level' => 2,
    'pid' => '320000',
  ),
  320501 => 
  array (
    'id' => '320501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320500',
  ),
  320505 => 
  array (
    'id' => '320505',
    'name' => '虎丘区',
    'level' => 3,
    'pid' => '320500',
  ),
  320506 => 
  array (
    'id' => '320506',
    'name' => '吴中区',
    'level' => 3,
    'pid' => '320500',
  ),
  320507 => 
  array (
    'id' => '320507',
    'name' => '相城区',
    'level' => 3,
    'pid' => '320500',
  ),
  320508 => 
  array (
    'id' => '320508',
    'name' => '姑苏区',
    'level' => 3,
    'pid' => '320500',
  ),
  320509 => 
  array (
    'id' => '320509',
    'name' => '吴江区',
    'level' => 3,
    'pid' => '320500',
  ),
  320581 => 
  array (
    'id' => '320581',
    'name' => '常熟市',
    'level' => 3,
    'pid' => '320500',
  ),
  320582 => 
  array (
    'id' => '320582',
    'name' => '张家港市',
    'level' => 3,
    'pid' => '320500',
  ),
  320583 => 
  array (
    'id' => '320583',
    'name' => '昆山市',
    'level' => 3,
    'pid' => '320500',
  ),
  320585 => 
  array (
    'id' => '320585',
    'name' => '太仓市',
    'level' => 3,
    'pid' => '320500',
  ),
  320600 => 
  array (
    'id' => '320600',
    'name' => '南通市',
    'level' => 2,
    'pid' => '320000',
  ),
  320601 => 
  array (
    'id' => '320601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320600',
  ),
  320602 => 
  array (
    'id' => '320602',
    'name' => '崇川区',
    'level' => 3,
    'pid' => '320600',
  ),
  320611 => 
  array (
    'id' => '320611',
    'name' => '港闸区',
    'level' => 3,
    'pid' => '320600',
  ),
  320612 => 
  array (
    'id' => '320612',
    'name' => '通州区',
    'level' => 3,
    'pid' => '320600',
  ),
  320621 => 
  array (
    'id' => '320621',
    'name' => '海安县',
    'level' => 3,
    'pid' => '320600',
  ),
  320623 => 
  array (
    'id' => '320623',
    'name' => '如东县',
    'level' => 3,
    'pid' => '320600',
  ),
  320681 => 
  array (
    'id' => '320681',
    'name' => '启东市',
    'level' => 3,
    'pid' => '320600',
  ),
  320682 => 
  array (
    'id' => '320682',
    'name' => '如皋市',
    'level' => 3,
    'pid' => '320600',
  ),
  320684 => 
  array (
    'id' => '320684',
    'name' => '海门市',
    'level' => 3,
    'pid' => '320600',
  ),
  320700 => 
  array (
    'id' => '320700',
    'name' => '连云港市',
    'level' => 2,
    'pid' => '320000',
  ),
  320701 => 
  array (
    'id' => '320701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320700',
  ),
  320703 => 
  array (
    'id' => '320703',
    'name' => '连云区',
    'level' => 3,
    'pid' => '320700',
  ),
  320706 => 
  array (
    'id' => '320706',
    'name' => '海州区',
    'level' => 3,
    'pid' => '320700',
  ),
  320707 => 
  array (
    'id' => '320707',
    'name' => '赣榆区',
    'level' => 3,
    'pid' => '320700',
  ),
  320722 => 
  array (
    'id' => '320722',
    'name' => '东海县',
    'level' => 3,
    'pid' => '320700',
  ),
  320723 => 
  array (
    'id' => '320723',
    'name' => '灌云县',
    'level' => 3,
    'pid' => '320700',
  ),
  320724 => 
  array (
    'id' => '320724',
    'name' => '灌南县',
    'level' => 3,
    'pid' => '320700',
  ),
  320800 => 
  array (
    'id' => '320800',
    'name' => '淮安市',
    'level' => 2,
    'pid' => '320000',
  ),
  320801 => 
  array (
    'id' => '320801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320800',
  ),
  320802 => 
  array (
    'id' => '320802',
    'name' => '清河区',
    'level' => 3,
    'pid' => '320800',
  ),
  320803 => 
  array (
    'id' => '320803',
    'name' => '淮安区',
    'level' => 3,
    'pid' => '320800',
  ),
  320804 => 
  array (
    'id' => '320804',
    'name' => '淮阴区',
    'level' => 3,
    'pid' => '320800',
  ),
  320811 => 
  array (
    'id' => '320811',
    'name' => '清浦区',
    'level' => 3,
    'pid' => '320800',
  ),
  320826 => 
  array (
    'id' => '320826',
    'name' => '涟水县',
    'level' => 3,
    'pid' => '320800',
  ),
  320829 => 
  array (
    'id' => '320829',
    'name' => '洪泽县',
    'level' => 3,
    'pid' => '320800',
  ),
  320830 => 
  array (
    'id' => '320830',
    'name' => '盱眙县',
    'level' => 3,
    'pid' => '320800',
  ),
  320831 => 
  array (
    'id' => '320831',
    'name' => '金湖县',
    'level' => 3,
    'pid' => '320800',
  ),
  320900 => 
  array (
    'id' => '320900',
    'name' => '盐城市',
    'level' => 2,
    'pid' => '320000',
  ),
  320901 => 
  array (
    'id' => '320901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '320900',
  ),
  320902 => 
  array (
    'id' => '320902',
    'name' => '亭湖区',
    'level' => 3,
    'pid' => '320900',
  ),
  320903 => 
  array (
    'id' => '320903',
    'name' => '盐都区',
    'level' => 3,
    'pid' => '320900',
  ),
  320904 => 
  array (
    'id' => '320904',
    'name' => '大丰区',
    'level' => 3,
    'pid' => '320900',
  ),
  320921 => 
  array (
    'id' => '320921',
    'name' => '响水县',
    'level' => 3,
    'pid' => '320900',
  ),
  320922 => 
  array (
    'id' => '320922',
    'name' => '滨海县',
    'level' => 3,
    'pid' => '320900',
  ),
  320923 => 
  array (
    'id' => '320923',
    'name' => '阜宁县',
    'level' => 3,
    'pid' => '320900',
  ),
  320924 => 
  array (
    'id' => '320924',
    'name' => '射阳县',
    'level' => 3,
    'pid' => '320900',
  ),
  320925 => 
  array (
    'id' => '320925',
    'name' => '建湖县',
    'level' => 3,
    'pid' => '320900',
  ),
  320981 => 
  array (
    'id' => '320981',
    'name' => '东台市',
    'level' => 3,
    'pid' => '320900',
  ),
  321000 => 
  array (
    'id' => '321000',
    'name' => '扬州市',
    'level' => 2,
    'pid' => '320000',
  ),
  321001 => 
  array (
    'id' => '321001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '321000',
  ),
  321002 => 
  array (
    'id' => '321002',
    'name' => '广陵区',
    'level' => 3,
    'pid' => '321000',
  ),
  321003 => 
  array (
    'id' => '321003',
    'name' => '邗江区',
    'level' => 3,
    'pid' => '321000',
  ),
  321012 => 
  array (
    'id' => '321012',
    'name' => '江都区',
    'level' => 3,
    'pid' => '321000',
  ),
  321023 => 
  array (
    'id' => '321023',
    'name' => '宝应县',
    'level' => 3,
    'pid' => '321000',
  ),
  321081 => 
  array (
    'id' => '321081',
    'name' => '仪征市',
    'level' => 3,
    'pid' => '321000',
  ),
  321084 => 
  array (
    'id' => '321084',
    'name' => '高邮市',
    'level' => 3,
    'pid' => '321000',
  ),
  321100 => 
  array (
    'id' => '321100',
    'name' => '镇江市',
    'level' => 2,
    'pid' => '320000',
  ),
  321101 => 
  array (
    'id' => '321101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '321100',
  ),
  321102 => 
  array (
    'id' => '321102',
    'name' => '京口区',
    'level' => 3,
    'pid' => '321100',
  ),
  321111 => 
  array (
    'id' => '321111',
    'name' => '润州区',
    'level' => 3,
    'pid' => '321100',
  ),
  321112 => 
  array (
    'id' => '321112',
    'name' => '丹徒区',
    'level' => 3,
    'pid' => '321100',
  ),
  321181 => 
  array (
    'id' => '321181',
    'name' => '丹阳市',
    'level' => 3,
    'pid' => '321100',
  ),
  321182 => 
  array (
    'id' => '321182',
    'name' => '扬中市',
    'level' => 3,
    'pid' => '321100',
  ),
  321183 => 
  array (
    'id' => '321183',
    'name' => '句容市',
    'level' => 3,
    'pid' => '321100',
  ),
  321200 => 
  array (
    'id' => '321200',
    'name' => '泰州市',
    'level' => 2,
    'pid' => '320000',
  ),
  321201 => 
  array (
    'id' => '321201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '321200',
  ),
  321202 => 
  array (
    'id' => '321202',
    'name' => '海陵区',
    'level' => 3,
    'pid' => '321200',
  ),
  321203 => 
  array (
    'id' => '321203',
    'name' => '高港区',
    'level' => 3,
    'pid' => '321200',
  ),
  321204 => 
  array (
    'id' => '321204',
    'name' => '姜堰区',
    'level' => 3,
    'pid' => '321200',
  ),
  321281 => 
  array (
    'id' => '321281',
    'name' => '兴化市',
    'level' => 3,
    'pid' => '321200',
  ),
  321282 => 
  array (
    'id' => '321282',
    'name' => '靖江市',
    'level' => 3,
    'pid' => '321200',
  ),
  321283 => 
  array (
    'id' => '321283',
    'name' => '泰兴市',
    'level' => 3,
    'pid' => '321200',
  ),
  321300 => 
  array (
    'id' => '321300',
    'name' => '宿迁市',
    'level' => 2,
    'pid' => '320000',
  ),
  321301 => 
  array (
    'id' => '321301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '321300',
  ),
  321302 => 
  array (
    'id' => '321302',
    'name' => '宿城区',
    'level' => 3,
    'pid' => '321300',
  ),
  321311 => 
  array (
    'id' => '321311',
    'name' => '宿豫区',
    'level' => 3,
    'pid' => '321300',
  ),
  321322 => 
  array (
    'id' => '321322',
    'name' => '沭阳县',
    'level' => 3,
    'pid' => '321300',
  ),
  321323 => 
  array (
    'id' => '321323',
    'name' => '泗阳县',
    'level' => 3,
    'pid' => '321300',
  ),
  321324 => 
  array (
    'id' => '321324',
    'name' => '泗洪县',
    'level' => 3,
    'pid' => '321300',
  ),
  330000 => 
  array (
    'id' => '330000',
    'name' => '浙江省',
    'level' => 1,
    'pid' => 0,
  ),
  330100 => 
  array (
    'id' => '330100',
    'name' => '杭州市',
    'level' => 2,
    'pid' => '330000',
  ),
  330101 => 
  array (
    'id' => '330101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330100',
  ),
  330102 => 
  array (
    'id' => '330102',
    'name' => '上城区',
    'level' => 3,
    'pid' => '330100',
  ),
  330103 => 
  array (
    'id' => '330103',
    'name' => '下城区',
    'level' => 3,
    'pid' => '330100',
  ),
  330104 => 
  array (
    'id' => '330104',
    'name' => '江干区',
    'level' => 3,
    'pid' => '330100',
  ),
  330105 => 
  array (
    'id' => '330105',
    'name' => '拱墅区',
    'level' => 3,
    'pid' => '330100',
  ),
  330106 => 
  array (
    'id' => '330106',
    'name' => '西湖区',
    'level' => 3,
    'pid' => '330100',
  ),
  330108 => 
  array (
    'id' => '330108',
    'name' => '滨江区',
    'level' => 3,
    'pid' => '330100',
  ),
  330109 => 
  array (
    'id' => '330109',
    'name' => '萧山区',
    'level' => 3,
    'pid' => '330100',
  ),
  330110 => 
  array (
    'id' => '330110',
    'name' => '余杭区',
    'level' => 3,
    'pid' => '330100',
  ),
  330111 => 
  array (
    'id' => '330111',
    'name' => '富阳区',
    'level' => 3,
    'pid' => '330100',
  ),
  330122 => 
  array (
    'id' => '330122',
    'name' => '桐庐县',
    'level' => 3,
    'pid' => '330100',
  ),
  330127 => 
  array (
    'id' => '330127',
    'name' => '淳安县',
    'level' => 3,
    'pid' => '330100',
  ),
  330182 => 
  array (
    'id' => '330182',
    'name' => '建德市',
    'level' => 3,
    'pid' => '330100',
  ),
  330185 => 
  array (
    'id' => '330185',
    'name' => '临安市',
    'level' => 3,
    'pid' => '330100',
  ),
  330200 => 
  array (
    'id' => '330200',
    'name' => '宁波市',
    'level' => 2,
    'pid' => '330000',
  ),
  330201 => 
  array (
    'id' => '330201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330200',
  ),
  330203 => 
  array (
    'id' => '330203',
    'name' => '海曙区',
    'level' => 3,
    'pid' => '330200',
  ),
  330204 => 
  array (
    'id' => '330204',
    'name' => '江东区',
    'level' => 3,
    'pid' => '330200',
  ),
  330205 => 
  array (
    'id' => '330205',
    'name' => '江北区',
    'level' => 3,
    'pid' => '330200',
  ),
  330206 => 
  array (
    'id' => '330206',
    'name' => '北仑区',
    'level' => 3,
    'pid' => '330200',
  ),
  330211 => 
  array (
    'id' => '330211',
    'name' => '镇海区',
    'level' => 3,
    'pid' => '330200',
  ),
  330212 => 
  array (
    'id' => '330212',
    'name' => '鄞州区',
    'level' => 3,
    'pid' => '330200',
  ),
  330225 => 
  array (
    'id' => '330225',
    'name' => '象山县',
    'level' => 3,
    'pid' => '330200',
  ),
  330226 => 
  array (
    'id' => '330226',
    'name' => '宁海县',
    'level' => 3,
    'pid' => '330200',
  ),
  330281 => 
  array (
    'id' => '330281',
    'name' => '余姚市',
    'level' => 3,
    'pid' => '330200',
  ),
  330282 => 
  array (
    'id' => '330282',
    'name' => '慈溪市',
    'level' => 3,
    'pid' => '330200',
  ),
  330283 => 
  array (
    'id' => '330283',
    'name' => '奉化市',
    'level' => 3,
    'pid' => '330200',
  ),
  330300 => 
  array (
    'id' => '330300',
    'name' => '温州市',
    'level' => 2,
    'pid' => '330000',
  ),
  330301 => 
  array (
    'id' => '330301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330300',
  ),
  330302 => 
  array (
    'id' => '330302',
    'name' => '鹿城区',
    'level' => 3,
    'pid' => '330300',
  ),
  330303 => 
  array (
    'id' => '330303',
    'name' => '龙湾区',
    'level' => 3,
    'pid' => '330300',
  ),
  330304 => 
  array (
    'id' => '330304',
    'name' => '瓯海区',
    'level' => 3,
    'pid' => '330300',
  ),
  330305 => 
  array (
    'id' => '330305',
    'name' => '洞头区',
    'level' => 3,
    'pid' => '330300',
  ),
  330324 => 
  array (
    'id' => '330324',
    'name' => '永嘉县',
    'level' => 3,
    'pid' => '330300',
  ),
  330326 => 
  array (
    'id' => '330326',
    'name' => '平阳县',
    'level' => 3,
    'pid' => '330300',
  ),
  330327 => 
  array (
    'id' => '330327',
    'name' => '苍南县',
    'level' => 3,
    'pid' => '330300',
  ),
  330328 => 
  array (
    'id' => '330328',
    'name' => '文成县',
    'level' => 3,
    'pid' => '330300',
  ),
  330329 => 
  array (
    'id' => '330329',
    'name' => '泰顺县',
    'level' => 3,
    'pid' => '330300',
  ),
  330381 => 
  array (
    'id' => '330381',
    'name' => '瑞安市',
    'level' => 3,
    'pid' => '330300',
  ),
  330382 => 
  array (
    'id' => '330382',
    'name' => '乐清市',
    'level' => 3,
    'pid' => '330300',
  ),
  330400 => 
  array (
    'id' => '330400',
    'name' => '嘉兴市',
    'level' => 2,
    'pid' => '330000',
  ),
  330401 => 
  array (
    'id' => '330401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330400',
  ),
  330402 => 
  array (
    'id' => '330402',
    'name' => '南湖区',
    'level' => 3,
    'pid' => '330400',
  ),
  330411 => 
  array (
    'id' => '330411',
    'name' => '秀洲区',
    'level' => 3,
    'pid' => '330400',
  ),
  330421 => 
  array (
    'id' => '330421',
    'name' => '嘉善县',
    'level' => 3,
    'pid' => '330400',
  ),
  330424 => 
  array (
    'id' => '330424',
    'name' => '海盐县',
    'level' => 3,
    'pid' => '330400',
  ),
  330481 => 
  array (
    'id' => '330481',
    'name' => '海宁市',
    'level' => 3,
    'pid' => '330400',
  ),
  330482 => 
  array (
    'id' => '330482',
    'name' => '平湖市',
    'level' => 3,
    'pid' => '330400',
  ),
  330483 => 
  array (
    'id' => '330483',
    'name' => '桐乡市',
    'level' => 3,
    'pid' => '330400',
  ),
  330500 => 
  array (
    'id' => '330500',
    'name' => '湖州市',
    'level' => 2,
    'pid' => '330000',
  ),
  330501 => 
  array (
    'id' => '330501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330500',
  ),
  330502 => 
  array (
    'id' => '330502',
    'name' => '吴兴区',
    'level' => 3,
    'pid' => '330500',
  ),
  330503 => 
  array (
    'id' => '330503',
    'name' => '南浔区',
    'level' => 3,
    'pid' => '330500',
  ),
  330521 => 
  array (
    'id' => '330521',
    'name' => '德清县',
    'level' => 3,
    'pid' => '330500',
  ),
  330522 => 
  array (
    'id' => '330522',
    'name' => '长兴县',
    'level' => 3,
    'pid' => '330500',
  ),
  330523 => 
  array (
    'id' => '330523',
    'name' => '安吉县',
    'level' => 3,
    'pid' => '330500',
  ),
  330600 => 
  array (
    'id' => '330600',
    'name' => '绍兴市',
    'level' => 2,
    'pid' => '330000',
  ),
  330601 => 
  array (
    'id' => '330601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330600',
  ),
  330602 => 
  array (
    'id' => '330602',
    'name' => '越城区',
    'level' => 3,
    'pid' => '330600',
  ),
  330603 => 
  array (
    'id' => '330603',
    'name' => '柯桥区',
    'level' => 3,
    'pid' => '330600',
  ),
  330604 => 
  array (
    'id' => '330604',
    'name' => '上虞区',
    'level' => 3,
    'pid' => '330600',
  ),
  330624 => 
  array (
    'id' => '330624',
    'name' => '新昌县',
    'level' => 3,
    'pid' => '330600',
  ),
  330681 => 
  array (
    'id' => '330681',
    'name' => '诸暨市',
    'level' => 3,
    'pid' => '330600',
  ),
  330683 => 
  array (
    'id' => '330683',
    'name' => '嵊州市',
    'level' => 3,
    'pid' => '330600',
  ),
  330700 => 
  array (
    'id' => '330700',
    'name' => '金华市',
    'level' => 2,
    'pid' => '330000',
  ),
  330701 => 
  array (
    'id' => '330701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330700',
  ),
  330702 => 
  array (
    'id' => '330702',
    'name' => '婺城区',
    'level' => 3,
    'pid' => '330700',
  ),
  330703 => 
  array (
    'id' => '330703',
    'name' => '金东区',
    'level' => 3,
    'pid' => '330700',
  ),
  330723 => 
  array (
    'id' => '330723',
    'name' => '武义县',
    'level' => 3,
    'pid' => '330700',
  ),
  330726 => 
  array (
    'id' => '330726',
    'name' => '浦江县',
    'level' => 3,
    'pid' => '330700',
  ),
  330727 => 
  array (
    'id' => '330727',
    'name' => '磐安县',
    'level' => 3,
    'pid' => '330700',
  ),
  330781 => 
  array (
    'id' => '330781',
    'name' => '兰溪市',
    'level' => 3,
    'pid' => '330700',
  ),
  330782 => 
  array (
    'id' => '330782',
    'name' => '义乌市',
    'level' => 3,
    'pid' => '330700',
  ),
  330783 => 
  array (
    'id' => '330783',
    'name' => '东阳市',
    'level' => 3,
    'pid' => '330700',
  ),
  330784 => 
  array (
    'id' => '330784',
    'name' => '永康市',
    'level' => 3,
    'pid' => '330700',
  ),
  330800 => 
  array (
    'id' => '330800',
    'name' => '衢州市',
    'level' => 2,
    'pid' => '330000',
  ),
  330801 => 
  array (
    'id' => '330801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330800',
  ),
  330802 => 
  array (
    'id' => '330802',
    'name' => '柯城区',
    'level' => 3,
    'pid' => '330800',
  ),
  330803 => 
  array (
    'id' => '330803',
    'name' => '衢江区',
    'level' => 3,
    'pid' => '330800',
  ),
  330822 => 
  array (
    'id' => '330822',
    'name' => '常山县',
    'level' => 3,
    'pid' => '330800',
  ),
  330824 => 
  array (
    'id' => '330824',
    'name' => '开化县',
    'level' => 3,
    'pid' => '330800',
  ),
  330825 => 
  array (
    'id' => '330825',
    'name' => '龙游县',
    'level' => 3,
    'pid' => '330800',
  ),
  330881 => 
  array (
    'id' => '330881',
    'name' => '江山市',
    'level' => 3,
    'pid' => '330800',
  ),
  330900 => 
  array (
    'id' => '330900',
    'name' => '舟山市',
    'level' => 2,
    'pid' => '330000',
  ),
  330901 => 
  array (
    'id' => '330901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '330900',
  ),
  330902 => 
  array (
    'id' => '330902',
    'name' => '定海区',
    'level' => 3,
    'pid' => '330900',
  ),
  330903 => 
  array (
    'id' => '330903',
    'name' => '普陀区',
    'level' => 3,
    'pid' => '330900',
  ),
  330921 => 
  array (
    'id' => '330921',
    'name' => '岱山县',
    'level' => 3,
    'pid' => '330900',
  ),
  330922 => 
  array (
    'id' => '330922',
    'name' => '嵊泗县',
    'level' => 3,
    'pid' => '330900',
  ),
  331000 => 
  array (
    'id' => '331000',
    'name' => '台州市',
    'level' => 2,
    'pid' => '330000',
  ),
  331001 => 
  array (
    'id' => '331001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '331000',
  ),
  331002 => 
  array (
    'id' => '331002',
    'name' => '椒江区',
    'level' => 3,
    'pid' => '331000',
  ),
  331003 => 
  array (
    'id' => '331003',
    'name' => '黄岩区',
    'level' => 3,
    'pid' => '331000',
  ),
  331004 => 
  array (
    'id' => '331004',
    'name' => '路桥区',
    'level' => 3,
    'pid' => '331000',
  ),
  331021 => 
  array (
    'id' => '331021',
    'name' => '玉环县',
    'level' => 3,
    'pid' => '331000',
  ),
  331022 => 
  array (
    'id' => '331022',
    'name' => '三门县',
    'level' => 3,
    'pid' => '331000',
  ),
  331023 => 
  array (
    'id' => '331023',
    'name' => '天台县',
    'level' => 3,
    'pid' => '331000',
  ),
  331024 => 
  array (
    'id' => '331024',
    'name' => '仙居县',
    'level' => 3,
    'pid' => '331000',
  ),
  331081 => 
  array (
    'id' => '331081',
    'name' => '温岭市',
    'level' => 3,
    'pid' => '331000',
  ),
  331082 => 
  array (
    'id' => '331082',
    'name' => '临海市',
    'level' => 3,
    'pid' => '331000',
  ),
  331100 => 
  array (
    'id' => '331100',
    'name' => '丽水市',
    'level' => 2,
    'pid' => '330000',
  ),
  331101 => 
  array (
    'id' => '331101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '331100',
  ),
  331102 => 
  array (
    'id' => '331102',
    'name' => '莲都区',
    'level' => 3,
    'pid' => '331100',
  ),
  331121 => 
  array (
    'id' => '331121',
    'name' => '青田县',
    'level' => 3,
    'pid' => '331100',
  ),
  331122 => 
  array (
    'id' => '331122',
    'name' => '缙云县',
    'level' => 3,
    'pid' => '331100',
  ),
  331123 => 
  array (
    'id' => '331123',
    'name' => '遂昌县',
    'level' => 3,
    'pid' => '331100',
  ),
  331124 => 
  array (
    'id' => '331124',
    'name' => '松阳县',
    'level' => 3,
    'pid' => '331100',
  ),
  331125 => 
  array (
    'id' => '331125',
    'name' => '云和县',
    'level' => 3,
    'pid' => '331100',
  ),
  331126 => 
  array (
    'id' => '331126',
    'name' => '庆元县',
    'level' => 3,
    'pid' => '331100',
  ),
  331127 => 
  array (
    'id' => '331127',
    'name' => '景宁畲族自治县',
    'level' => 3,
    'pid' => '331100',
  ),
  331181 => 
  array (
    'id' => '331181',
    'name' => '龙泉市',
    'level' => 3,
    'pid' => '331100',
  ),
  340000 => 
  array (
    'id' => '340000',
    'name' => '安徽省',
    'level' => 1,
    'pid' => 0,
  ),
  340100 => 
  array (
    'id' => '340100',
    'name' => '合肥市',
    'level' => 2,
    'pid' => '340000',
  ),
  340101 => 
  array (
    'id' => '340101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340100',
  ),
  340102 => 
  array (
    'id' => '340102',
    'name' => '瑶海区',
    'level' => 3,
    'pid' => '340100',
  ),
  340103 => 
  array (
    'id' => '340103',
    'name' => '庐阳区',
    'level' => 3,
    'pid' => '340100',
  ),
  340104 => 
  array (
    'id' => '340104',
    'name' => '蜀山区',
    'level' => 3,
    'pid' => '340100',
  ),
  340111 => 
  array (
    'id' => '340111',
    'name' => '包河区',
    'level' => 3,
    'pid' => '340100',
  ),
  340121 => 
  array (
    'id' => '340121',
    'name' => '长丰县',
    'level' => 3,
    'pid' => '340100',
  ),
  340122 => 
  array (
    'id' => '340122',
    'name' => '肥东县',
    'level' => 3,
    'pid' => '340100',
  ),
  340123 => 
  array (
    'id' => '340123',
    'name' => '肥西县',
    'level' => 3,
    'pid' => '340100',
  ),
  340124 => 
  array (
    'id' => '340124',
    'name' => '庐江县',
    'level' => 3,
    'pid' => '340100',
  ),
  340181 => 
  array (
    'id' => '340181',
    'name' => '巢湖市',
    'level' => 3,
    'pid' => '340100',
  ),
  340200 => 
  array (
    'id' => '340200',
    'name' => '芜湖市',
    'level' => 2,
    'pid' => '340000',
  ),
  340201 => 
  array (
    'id' => '340201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340200',
  ),
  340202 => 
  array (
    'id' => '340202',
    'name' => '镜湖区',
    'level' => 3,
    'pid' => '340200',
  ),
  340203 => 
  array (
    'id' => '340203',
    'name' => '弋江区',
    'level' => 3,
    'pid' => '340200',
  ),
  340207 => 
  array (
    'id' => '340207',
    'name' => '鸠江区',
    'level' => 3,
    'pid' => '340200',
  ),
  340208 => 
  array (
    'id' => '340208',
    'name' => '三山区',
    'level' => 3,
    'pid' => '340200',
  ),
  340221 => 
  array (
    'id' => '340221',
    'name' => '芜湖县',
    'level' => 3,
    'pid' => '340200',
  ),
  340222 => 
  array (
    'id' => '340222',
    'name' => '繁昌县',
    'level' => 3,
    'pid' => '340200',
  ),
  340223 => 
  array (
    'id' => '340223',
    'name' => '南陵县',
    'level' => 3,
    'pid' => '340200',
  ),
  340225 => 
  array (
    'id' => '340225',
    'name' => '无为县',
    'level' => 3,
    'pid' => '340200',
  ),
  340300 => 
  array (
    'id' => '340300',
    'name' => '蚌埠市',
    'level' => 2,
    'pid' => '340000',
  ),
  340301 => 
  array (
    'id' => '340301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340300',
  ),
  340302 => 
  array (
    'id' => '340302',
    'name' => '龙子湖区',
    'level' => 3,
    'pid' => '340300',
  ),
  340303 => 
  array (
    'id' => '340303',
    'name' => '蚌山区',
    'level' => 3,
    'pid' => '340300',
  ),
  340304 => 
  array (
    'id' => '340304',
    'name' => '禹会区',
    'level' => 3,
    'pid' => '340300',
  ),
  340311 => 
  array (
    'id' => '340311',
    'name' => '淮上区',
    'level' => 3,
    'pid' => '340300',
  ),
  340321 => 
  array (
    'id' => '340321',
    'name' => '怀远县',
    'level' => 3,
    'pid' => '340300',
  ),
  340322 => 
  array (
    'id' => '340322',
    'name' => '五河县',
    'level' => 3,
    'pid' => '340300',
  ),
  340323 => 
  array (
    'id' => '340323',
    'name' => '固镇县',
    'level' => 3,
    'pid' => '340300',
  ),
  340400 => 
  array (
    'id' => '340400',
    'name' => '淮南市',
    'level' => 2,
    'pid' => '340000',
  ),
  340401 => 
  array (
    'id' => '340401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340400',
  ),
  340402 => 
  array (
    'id' => '340402',
    'name' => '大通区',
    'level' => 3,
    'pid' => '340400',
  ),
  340403 => 
  array (
    'id' => '340403',
    'name' => '田家庵区',
    'level' => 3,
    'pid' => '340400',
  ),
  340404 => 
  array (
    'id' => '340404',
    'name' => '谢家集区',
    'level' => 3,
    'pid' => '340400',
  ),
  340405 => 
  array (
    'id' => '340405',
    'name' => '八公山区',
    'level' => 3,
    'pid' => '340400',
  ),
  340406 => 
  array (
    'id' => '340406',
    'name' => '潘集区',
    'level' => 3,
    'pid' => '340400',
  ),
  340421 => 
  array (
    'id' => '340421',
    'name' => '凤台县',
    'level' => 3,
    'pid' => '340400',
  ),
  340500 => 
  array (
    'id' => '340500',
    'name' => '马鞍山市',
    'level' => 2,
    'pid' => '340000',
  ),
  340501 => 
  array (
    'id' => '340501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340500',
  ),
  340503 => 
  array (
    'id' => '340503',
    'name' => '花山区',
    'level' => 3,
    'pid' => '340500',
  ),
  340504 => 
  array (
    'id' => '340504',
    'name' => '雨山区',
    'level' => 3,
    'pid' => '340500',
  ),
  340506 => 
  array (
    'id' => '340506',
    'name' => '博望区',
    'level' => 3,
    'pid' => '340500',
  ),
  340521 => 
  array (
    'id' => '340521',
    'name' => '当涂县',
    'level' => 3,
    'pid' => '340500',
  ),
  340522 => 
  array (
    'id' => '340522',
    'name' => '含山县',
    'level' => 3,
    'pid' => '340500',
  ),
  340523 => 
  array (
    'id' => '340523',
    'name' => '和县',
    'level' => 3,
    'pid' => '340500',
  ),
  340600 => 
  array (
    'id' => '340600',
    'name' => '淮北市',
    'level' => 2,
    'pid' => '340000',
  ),
  340601 => 
  array (
    'id' => '340601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340600',
  ),
  340602 => 
  array (
    'id' => '340602',
    'name' => '杜集区',
    'level' => 3,
    'pid' => '340600',
  ),
  340603 => 
  array (
    'id' => '340603',
    'name' => '相山区',
    'level' => 3,
    'pid' => '340600',
  ),
  340604 => 
  array (
    'id' => '340604',
    'name' => '烈山区',
    'level' => 3,
    'pid' => '340600',
  ),
  340621 => 
  array (
    'id' => '340621',
    'name' => '濉溪县',
    'level' => 3,
    'pid' => '340600',
  ),
  340700 => 
  array (
    'id' => '340700',
    'name' => '铜陵市',
    'level' => 2,
    'pid' => '340000',
  ),
  340701 => 
  array (
    'id' => '340701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340700',
  ),
  340702 => 
  array (
    'id' => '340702',
    'name' => '铜官山区',
    'level' => 3,
    'pid' => '340700',
  ),
  340703 => 
  array (
    'id' => '340703',
    'name' => '狮子山区',
    'level' => 3,
    'pid' => '340700',
  ),
  340711 => 
  array (
    'id' => '340711',
    'name' => '郊区',
    'level' => 3,
    'pid' => '340700',
  ),
  340721 => 
  array (
    'id' => '340721',
    'name' => '铜陵县',
    'level' => 3,
    'pid' => '340700',
  ),
  340800 => 
  array (
    'id' => '340800',
    'name' => '安庆市',
    'level' => 2,
    'pid' => '340000',
  ),
  340801 => 
  array (
    'id' => '340801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '340800',
  ),
  340802 => 
  array (
    'id' => '340802',
    'name' => '迎江区',
    'level' => 3,
    'pid' => '340800',
  ),
  340803 => 
  array (
    'id' => '340803',
    'name' => '大观区',
    'level' => 3,
    'pid' => '340800',
  ),
  340811 => 
  array (
    'id' => '340811',
    'name' => '宜秀区',
    'level' => 3,
    'pid' => '340800',
  ),
  340822 => 
  array (
    'id' => '340822',
    'name' => '怀宁县',
    'level' => 3,
    'pid' => '340800',
  ),
  340823 => 
  array (
    'id' => '340823',
    'name' => '枞阳县',
    'level' => 3,
    'pid' => '340800',
  ),
  340824 => 
  array (
    'id' => '340824',
    'name' => '潜山县',
    'level' => 3,
    'pid' => '340800',
  ),
  340825 => 
  array (
    'id' => '340825',
    'name' => '太湖县',
    'level' => 3,
    'pid' => '340800',
  ),
  340826 => 
  array (
    'id' => '340826',
    'name' => '宿松县',
    'level' => 3,
    'pid' => '340800',
  ),
  340827 => 
  array (
    'id' => '340827',
    'name' => '望江县',
    'level' => 3,
    'pid' => '340800',
  ),
  340828 => 
  array (
    'id' => '340828',
    'name' => '岳西县',
    'level' => 3,
    'pid' => '340800',
  ),
  340881 => 
  array (
    'id' => '340881',
    'name' => '桐城市',
    'level' => 3,
    'pid' => '340800',
  ),
  341000 => 
  array (
    'id' => '341000',
    'name' => '黄山市',
    'level' => 2,
    'pid' => '340000',
  ),
  341001 => 
  array (
    'id' => '341001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341000',
  ),
  341002 => 
  array (
    'id' => '341002',
    'name' => '屯溪区',
    'level' => 3,
    'pid' => '341000',
  ),
  341003 => 
  array (
    'id' => '341003',
    'name' => '黄山区',
    'level' => 3,
    'pid' => '341000',
  ),
  341004 => 
  array (
    'id' => '341004',
    'name' => '徽州区',
    'level' => 3,
    'pid' => '341000',
  ),
  341021 => 
  array (
    'id' => '341021',
    'name' => '歙县',
    'level' => 3,
    'pid' => '341000',
  ),
  341022 => 
  array (
    'id' => '341022',
    'name' => '休宁县',
    'level' => 3,
    'pid' => '341000',
  ),
  341023 => 
  array (
    'id' => '341023',
    'name' => '黟县',
    'level' => 3,
    'pid' => '341000',
  ),
  341024 => 
  array (
    'id' => '341024',
    'name' => '祁门县',
    'level' => 3,
    'pid' => '341000',
  ),
  341100 => 
  array (
    'id' => '341100',
    'name' => '滁州市',
    'level' => 2,
    'pid' => '340000',
  ),
  341101 => 
  array (
    'id' => '341101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341100',
  ),
  341102 => 
  array (
    'id' => '341102',
    'name' => '琅琊区',
    'level' => 3,
    'pid' => '341100',
  ),
  341103 => 
  array (
    'id' => '341103',
    'name' => '南谯区',
    'level' => 3,
    'pid' => '341100',
  ),
  341122 => 
  array (
    'id' => '341122',
    'name' => '来安县',
    'level' => 3,
    'pid' => '341100',
  ),
  341124 => 
  array (
    'id' => '341124',
    'name' => '全椒县',
    'level' => 3,
    'pid' => '341100',
  ),
  341125 => 
  array (
    'id' => '341125',
    'name' => '定远县',
    'level' => 3,
    'pid' => '341100',
  ),
  341126 => 
  array (
    'id' => '341126',
    'name' => '凤阳县',
    'level' => 3,
    'pid' => '341100',
  ),
  341181 => 
  array (
    'id' => '341181',
    'name' => '天长市',
    'level' => 3,
    'pid' => '341100',
  ),
  341182 => 
  array (
    'id' => '341182',
    'name' => '明光市',
    'level' => 3,
    'pid' => '341100',
  ),
  341200 => 
  array (
    'id' => '341200',
    'name' => '阜阳市',
    'level' => 2,
    'pid' => '340000',
  ),
  341201 => 
  array (
    'id' => '341201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341200',
  ),
  341202 => 
  array (
    'id' => '341202',
    'name' => '颍州区',
    'level' => 3,
    'pid' => '341200',
  ),
  341203 => 
  array (
    'id' => '341203',
    'name' => '颍东区',
    'level' => 3,
    'pid' => '341200',
  ),
  341204 => 
  array (
    'id' => '341204',
    'name' => '颍泉区',
    'level' => 3,
    'pid' => '341200',
  ),
  341221 => 
  array (
    'id' => '341221',
    'name' => '临泉县',
    'level' => 3,
    'pid' => '341200',
  ),
  341222 => 
  array (
    'id' => '341222',
    'name' => '太和县',
    'level' => 3,
    'pid' => '341200',
  ),
  341225 => 
  array (
    'id' => '341225',
    'name' => '阜南县',
    'level' => 3,
    'pid' => '341200',
  ),
  341226 => 
  array (
    'id' => '341226',
    'name' => '颍上县',
    'level' => 3,
    'pid' => '341200',
  ),
  341282 => 
  array (
    'id' => '341282',
    'name' => '界首市',
    'level' => 3,
    'pid' => '341200',
  ),
  341300 => 
  array (
    'id' => '341300',
    'name' => '宿州市',
    'level' => 2,
    'pid' => '340000',
  ),
  341301 => 
  array (
    'id' => '341301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341300',
  ),
  341302 => 
  array (
    'id' => '341302',
    'name' => '埇桥区',
    'level' => 3,
    'pid' => '341300',
  ),
  341321 => 
  array (
    'id' => '341321',
    'name' => '砀山县',
    'level' => 3,
    'pid' => '341300',
  ),
  341322 => 
  array (
    'id' => '341322',
    'name' => '萧县',
    'level' => 3,
    'pid' => '341300',
  ),
  341323 => 
  array (
    'id' => '341323',
    'name' => '灵璧县',
    'level' => 3,
    'pid' => '341300',
  ),
  341324 => 
  array (
    'id' => '341324',
    'name' => '泗县',
    'level' => 3,
    'pid' => '341300',
  ),
  341500 => 
  array (
    'id' => '341500',
    'name' => '六安市',
    'level' => 2,
    'pid' => '340000',
  ),
  341501 => 
  array (
    'id' => '341501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341500',
  ),
  341502 => 
  array (
    'id' => '341502',
    'name' => '金安区',
    'level' => 3,
    'pid' => '341500',
  ),
  341503 => 
  array (
    'id' => '341503',
    'name' => '裕安区',
    'level' => 3,
    'pid' => '341500',
  ),
  341521 => 
  array (
    'id' => '341521',
    'name' => '寿县',
    'level' => 3,
    'pid' => '341500',
  ),
  341522 => 
  array (
    'id' => '341522',
    'name' => '霍邱县',
    'level' => 3,
    'pid' => '341500',
  ),
  341523 => 
  array (
    'id' => '341523',
    'name' => '舒城县',
    'level' => 3,
    'pid' => '341500',
  ),
  341524 => 
  array (
    'id' => '341524',
    'name' => '金寨县',
    'level' => 3,
    'pid' => '341500',
  ),
  341525 => 
  array (
    'id' => '341525',
    'name' => '霍山县',
    'level' => 3,
    'pid' => '341500',
  ),
  341600 => 
  array (
    'id' => '341600',
    'name' => '亳州市',
    'level' => 2,
    'pid' => '340000',
  ),
  341601 => 
  array (
    'id' => '341601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341600',
  ),
  341602 => 
  array (
    'id' => '341602',
    'name' => '谯城区',
    'level' => 3,
    'pid' => '341600',
  ),
  341621 => 
  array (
    'id' => '341621',
    'name' => '涡阳县',
    'level' => 3,
    'pid' => '341600',
  ),
  341622 => 
  array (
    'id' => '341622',
    'name' => '蒙城县',
    'level' => 3,
    'pid' => '341600',
  ),
  341623 => 
  array (
    'id' => '341623',
    'name' => '利辛县',
    'level' => 3,
    'pid' => '341600',
  ),
  341700 => 
  array (
    'id' => '341700',
    'name' => '池州市',
    'level' => 2,
    'pid' => '340000',
  ),
  341701 => 
  array (
    'id' => '341701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341700',
  ),
  341702 => 
  array (
    'id' => '341702',
    'name' => '贵池区',
    'level' => 3,
    'pid' => '341700',
  ),
  341721 => 
  array (
    'id' => '341721',
    'name' => '东至县',
    'level' => 3,
    'pid' => '341700',
  ),
  341722 => 
  array (
    'id' => '341722',
    'name' => '石台县',
    'level' => 3,
    'pid' => '341700',
  ),
  341723 => 
  array (
    'id' => '341723',
    'name' => '青阳县',
    'level' => 3,
    'pid' => '341700',
  ),
  341800 => 
  array (
    'id' => '341800',
    'name' => '宣城市',
    'level' => 2,
    'pid' => '340000',
  ),
  341801 => 
  array (
    'id' => '341801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '341800',
  ),
  341802 => 
  array (
    'id' => '341802',
    'name' => '宣州区',
    'level' => 3,
    'pid' => '341800',
  ),
  341821 => 
  array (
    'id' => '341821',
    'name' => '郎溪县',
    'level' => 3,
    'pid' => '341800',
  ),
  341822 => 
  array (
    'id' => '341822',
    'name' => '广德县',
    'level' => 3,
    'pid' => '341800',
  ),
  341823 => 
  array (
    'id' => '341823',
    'name' => '泾县',
    'level' => 3,
    'pid' => '341800',
  ),
  341824 => 
  array (
    'id' => '341824',
    'name' => '绩溪县',
    'level' => 3,
    'pid' => '341800',
  ),
  341825 => 
  array (
    'id' => '341825',
    'name' => '旌德县',
    'level' => 3,
    'pid' => '341800',
  ),
  341881 => 
  array (
    'id' => '341881',
    'name' => '宁国市',
    'level' => 3,
    'pid' => '341800',
  ),
  350000 => 
  array (
    'id' => '350000',
    'name' => '福建省',
    'level' => 1,
    'pid' => 0,
  ),
  350100 => 
  array (
    'id' => '350100',
    'name' => '福州市',
    'level' => 2,
    'pid' => '350000',
  ),
  350101 => 
  array (
    'id' => '350101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350100',
  ),
  350102 => 
  array (
    'id' => '350102',
    'name' => '鼓楼区',
    'level' => 3,
    'pid' => '350100',
  ),
  350103 => 
  array (
    'id' => '350103',
    'name' => '台江区',
    'level' => 3,
    'pid' => '350100',
  ),
  350104 => 
  array (
    'id' => '350104',
    'name' => '仓山区',
    'level' => 3,
    'pid' => '350100',
  ),
  350105 => 
  array (
    'id' => '350105',
    'name' => '马尾区',
    'level' => 3,
    'pid' => '350100',
  ),
  350111 => 
  array (
    'id' => '350111',
    'name' => '晋安区',
    'level' => 3,
    'pid' => '350100',
  ),
  350121 => 
  array (
    'id' => '350121',
    'name' => '闽侯县',
    'level' => 3,
    'pid' => '350100',
  ),
  350122 => 
  array (
    'id' => '350122',
    'name' => '连江县',
    'level' => 3,
    'pid' => '350100',
  ),
  350123 => 
  array (
    'id' => '350123',
    'name' => '罗源县',
    'level' => 3,
    'pid' => '350100',
  ),
  350124 => 
  array (
    'id' => '350124',
    'name' => '闽清县',
    'level' => 3,
    'pid' => '350100',
  ),
  350125 => 
  array (
    'id' => '350125',
    'name' => '永泰县',
    'level' => 3,
    'pid' => '350100',
  ),
  350128 => 
  array (
    'id' => '350128',
    'name' => '平潭县',
    'level' => 3,
    'pid' => '350100',
  ),
  350181 => 
  array (
    'id' => '350181',
    'name' => '福清市',
    'level' => 3,
    'pid' => '350100',
  ),
  350182 => 
  array (
    'id' => '350182',
    'name' => '长乐市',
    'level' => 3,
    'pid' => '350100',
  ),
  350200 => 
  array (
    'id' => '350200',
    'name' => '厦门市',
    'level' => 2,
    'pid' => '350000',
  ),
  350201 => 
  array (
    'id' => '350201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350200',
  ),
  350203 => 
  array (
    'id' => '350203',
    'name' => '思明区',
    'level' => 3,
    'pid' => '350200',
  ),
  350205 => 
  array (
    'id' => '350205',
    'name' => '海沧区',
    'level' => 3,
    'pid' => '350200',
  ),
  350206 => 
  array (
    'id' => '350206',
    'name' => '湖里区',
    'level' => 3,
    'pid' => '350200',
  ),
  350211 => 
  array (
    'id' => '350211',
    'name' => '集美区',
    'level' => 3,
    'pid' => '350200',
  ),
  350212 => 
  array (
    'id' => '350212',
    'name' => '同安区',
    'level' => 3,
    'pid' => '350200',
  ),
  350213 => 
  array (
    'id' => '350213',
    'name' => '翔安区',
    'level' => 3,
    'pid' => '350200',
  ),
  350300 => 
  array (
    'id' => '350300',
    'name' => '莆田市',
    'level' => 2,
    'pid' => '350000',
  ),
  350301 => 
  array (
    'id' => '350301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350300',
  ),
  350302 => 
  array (
    'id' => '350302',
    'name' => '城厢区',
    'level' => 3,
    'pid' => '350300',
  ),
  350303 => 
  array (
    'id' => '350303',
    'name' => '涵江区',
    'level' => 3,
    'pid' => '350300',
  ),
  350304 => 
  array (
    'id' => '350304',
    'name' => '荔城区',
    'level' => 3,
    'pid' => '350300',
  ),
  350305 => 
  array (
    'id' => '350305',
    'name' => '秀屿区',
    'level' => 3,
    'pid' => '350300',
  ),
  350322 => 
  array (
    'id' => '350322',
    'name' => '仙游县',
    'level' => 3,
    'pid' => '350300',
  ),
  350400 => 
  array (
    'id' => '350400',
    'name' => '三明市',
    'level' => 2,
    'pid' => '350000',
  ),
  350401 => 
  array (
    'id' => '350401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350400',
  ),
  350402 => 
  array (
    'id' => '350402',
    'name' => '梅列区',
    'level' => 3,
    'pid' => '350400',
  ),
  350403 => 
  array (
    'id' => '350403',
    'name' => '三元区',
    'level' => 3,
    'pid' => '350400',
  ),
  350421 => 
  array (
    'id' => '350421',
    'name' => '明溪县',
    'level' => 3,
    'pid' => '350400',
  ),
  350423 => 
  array (
    'id' => '350423',
    'name' => '清流县',
    'level' => 3,
    'pid' => '350400',
  ),
  350424 => 
  array (
    'id' => '350424',
    'name' => '宁化县',
    'level' => 3,
    'pid' => '350400',
  ),
  350425 => 
  array (
    'id' => '350425',
    'name' => '大田县',
    'level' => 3,
    'pid' => '350400',
  ),
  350426 => 
  array (
    'id' => '350426',
    'name' => '尤溪县',
    'level' => 3,
    'pid' => '350400',
  ),
  350427 => 
  array (
    'id' => '350427',
    'name' => '沙县',
    'level' => 3,
    'pid' => '350400',
  ),
  350428 => 
  array (
    'id' => '350428',
    'name' => '将乐县',
    'level' => 3,
    'pid' => '350400',
  ),
  350429 => 
  array (
    'id' => '350429',
    'name' => '泰宁县',
    'level' => 3,
    'pid' => '350400',
  ),
  350430 => 
  array (
    'id' => '350430',
    'name' => '建宁县',
    'level' => 3,
    'pid' => '350400',
  ),
  350481 => 
  array (
    'id' => '350481',
    'name' => '永安市',
    'level' => 3,
    'pid' => '350400',
  ),
  350500 => 
  array (
    'id' => '350500',
    'name' => '泉州市',
    'level' => 2,
    'pid' => '350000',
  ),
  350501 => 
  array (
    'id' => '350501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350500',
  ),
  350502 => 
  array (
    'id' => '350502',
    'name' => '鲤城区',
    'level' => 3,
    'pid' => '350500',
  ),
  350503 => 
  array (
    'id' => '350503',
    'name' => '丰泽区',
    'level' => 3,
    'pid' => '350500',
  ),
  350504 => 
  array (
    'id' => '350504',
    'name' => '洛江区',
    'level' => 3,
    'pid' => '350500',
  ),
  350505 => 
  array (
    'id' => '350505',
    'name' => '泉港区',
    'level' => 3,
    'pid' => '350500',
  ),
  350521 => 
  array (
    'id' => '350521',
    'name' => '惠安县',
    'level' => 3,
    'pid' => '350500',
  ),
  350524 => 
  array (
    'id' => '350524',
    'name' => '安溪县',
    'level' => 3,
    'pid' => '350500',
  ),
  350525 => 
  array (
    'id' => '350525',
    'name' => '永春县',
    'level' => 3,
    'pid' => '350500',
  ),
  350526 => 
  array (
    'id' => '350526',
    'name' => '德化县',
    'level' => 3,
    'pid' => '350500',
  ),
  350527 => 
  array (
    'id' => '350527',
    'name' => '金门县',
    'level' => 3,
    'pid' => '350500',
  ),
  350581 => 
  array (
    'id' => '350581',
    'name' => '石狮市',
    'level' => 3,
    'pid' => '350500',
  ),
  350582 => 
  array (
    'id' => '350582',
    'name' => '晋江市',
    'level' => 3,
    'pid' => '350500',
  ),
  350583 => 
  array (
    'id' => '350583',
    'name' => '南安市',
    'level' => 3,
    'pid' => '350500',
  ),
  350600 => 
  array (
    'id' => '350600',
    'name' => '漳州市',
    'level' => 2,
    'pid' => '350000',
  ),
  350601 => 
  array (
    'id' => '350601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350600',
  ),
  350602 => 
  array (
    'id' => '350602',
    'name' => '芗城区',
    'level' => 3,
    'pid' => '350600',
  ),
  350603 => 
  array (
    'id' => '350603',
    'name' => '龙文区',
    'level' => 3,
    'pid' => '350600',
  ),
  350622 => 
  array (
    'id' => '350622',
    'name' => '云霄县',
    'level' => 3,
    'pid' => '350600',
  ),
  350623 => 
  array (
    'id' => '350623',
    'name' => '漳浦县',
    'level' => 3,
    'pid' => '350600',
  ),
  350624 => 
  array (
    'id' => '350624',
    'name' => '诏安县',
    'level' => 3,
    'pid' => '350600',
  ),
  350625 => 
  array (
    'id' => '350625',
    'name' => '长泰县',
    'level' => 3,
    'pid' => '350600',
  ),
  350626 => 
  array (
    'id' => '350626',
    'name' => '东山县',
    'level' => 3,
    'pid' => '350600',
  ),
  350627 => 
  array (
    'id' => '350627',
    'name' => '南靖县',
    'level' => 3,
    'pid' => '350600',
  ),
  350628 => 
  array (
    'id' => '350628',
    'name' => '平和县',
    'level' => 3,
    'pid' => '350600',
  ),
  350629 => 
  array (
    'id' => '350629',
    'name' => '华安县',
    'level' => 3,
    'pid' => '350600',
  ),
  350681 => 
  array (
    'id' => '350681',
    'name' => '龙海市',
    'level' => 3,
    'pid' => '350600',
  ),
  350700 => 
  array (
    'id' => '350700',
    'name' => '南平市',
    'level' => 2,
    'pid' => '350000',
  ),
  350701 => 
  array (
    'id' => '350701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350700',
  ),
  350702 => 
  array (
    'id' => '350702',
    'name' => '延平区',
    'level' => 3,
    'pid' => '350700',
  ),
  350703 => 
  array (
    'id' => '350703',
    'name' => '建阳区',
    'level' => 3,
    'pid' => '350700',
  ),
  350721 => 
  array (
    'id' => '350721',
    'name' => '顺昌县',
    'level' => 3,
    'pid' => '350700',
  ),
  350722 => 
  array (
    'id' => '350722',
    'name' => '浦城县',
    'level' => 3,
    'pid' => '350700',
  ),
  350723 => 
  array (
    'id' => '350723',
    'name' => '光泽县',
    'level' => 3,
    'pid' => '350700',
  ),
  350724 => 
  array (
    'id' => '350724',
    'name' => '松溪县',
    'level' => 3,
    'pid' => '350700',
  ),
  350725 => 
  array (
    'id' => '350725',
    'name' => '政和县',
    'level' => 3,
    'pid' => '350700',
  ),
  350781 => 
  array (
    'id' => '350781',
    'name' => '邵武市',
    'level' => 3,
    'pid' => '350700',
  ),
  350782 => 
  array (
    'id' => '350782',
    'name' => '武夷山市',
    'level' => 3,
    'pid' => '350700',
  ),
  350783 => 
  array (
    'id' => '350783',
    'name' => '建瓯市',
    'level' => 3,
    'pid' => '350700',
  ),
  350800 => 
  array (
    'id' => '350800',
    'name' => '龙岩市',
    'level' => 2,
    'pid' => '350000',
  ),
  350801 => 
  array (
    'id' => '350801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350800',
  ),
  350802 => 
  array (
    'id' => '350802',
    'name' => '新罗区',
    'level' => 3,
    'pid' => '350800',
  ),
  350803 => 
  array (
    'id' => '350803',
    'name' => '永定区',
    'level' => 3,
    'pid' => '350800',
  ),
  350821 => 
  array (
    'id' => '350821',
    'name' => '长汀县',
    'level' => 3,
    'pid' => '350800',
  ),
  350823 => 
  array (
    'id' => '350823',
    'name' => '上杭县',
    'level' => 3,
    'pid' => '350800',
  ),
  350824 => 
  array (
    'id' => '350824',
    'name' => '武平县',
    'level' => 3,
    'pid' => '350800',
  ),
  350825 => 
  array (
    'id' => '350825',
    'name' => '连城县',
    'level' => 3,
    'pid' => '350800',
  ),
  350881 => 
  array (
    'id' => '350881',
    'name' => '漳平市',
    'level' => 3,
    'pid' => '350800',
  ),
  350900 => 
  array (
    'id' => '350900',
    'name' => '宁德市',
    'level' => 2,
    'pid' => '350000',
  ),
  350901 => 
  array (
    'id' => '350901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '350900',
  ),
  350902 => 
  array (
    'id' => '350902',
    'name' => '蕉城区',
    'level' => 3,
    'pid' => '350900',
  ),
  350921 => 
  array (
    'id' => '350921',
    'name' => '霞浦县',
    'level' => 3,
    'pid' => '350900',
  ),
  350922 => 
  array (
    'id' => '350922',
    'name' => '古田县',
    'level' => 3,
    'pid' => '350900',
  ),
  350923 => 
  array (
    'id' => '350923',
    'name' => '屏南县',
    'level' => 3,
    'pid' => '350900',
  ),
  350924 => 
  array (
    'id' => '350924',
    'name' => '寿宁县',
    'level' => 3,
    'pid' => '350900',
  ),
  350925 => 
  array (
    'id' => '350925',
    'name' => '周宁县',
    'level' => 3,
    'pid' => '350900',
  ),
  350926 => 
  array (
    'id' => '350926',
    'name' => '柘荣县',
    'level' => 3,
    'pid' => '350900',
  ),
  350981 => 
  array (
    'id' => '350981',
    'name' => '福安市',
    'level' => 3,
    'pid' => '350900',
  ),
  350982 => 
  array (
    'id' => '350982',
    'name' => '福鼎市',
    'level' => 3,
    'pid' => '350900',
  ),
  360000 => 
  array (
    'id' => '360000',
    'name' => '江西省',
    'level' => 1,
    'pid' => 0,
  ),
  360100 => 
  array (
    'id' => '360100',
    'name' => '南昌市',
    'level' => 2,
    'pid' => '360000',
  ),
  360101 => 
  array (
    'id' => '360101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360100',
  ),
  360102 => 
  array (
    'id' => '360102',
    'name' => '东湖区',
    'level' => 3,
    'pid' => '360100',
  ),
  360103 => 
  array (
    'id' => '360103',
    'name' => '西湖区',
    'level' => 3,
    'pid' => '360100',
  ),
  360104 => 
  array (
    'id' => '360104',
    'name' => '青云谱区',
    'level' => 3,
    'pid' => '360100',
  ),
  360105 => 
  array (
    'id' => '360105',
    'name' => '湾里区',
    'level' => 3,
    'pid' => '360100',
  ),
  360111 => 
  array (
    'id' => '360111',
    'name' => '青山湖区',
    'level' => 3,
    'pid' => '360100',
  ),
  360112 => 
  array (
    'id' => '360112',
    'name' => '新建区',
    'level' => 3,
    'pid' => '360100',
  ),
  360121 => 
  array (
    'id' => '360121',
    'name' => '南昌县',
    'level' => 3,
    'pid' => '360100',
  ),
  360123 => 
  array (
    'id' => '360123',
    'name' => '安义县',
    'level' => 3,
    'pid' => '360100',
  ),
  360124 => 
  array (
    'id' => '360124',
    'name' => '进贤县',
    'level' => 3,
    'pid' => '360100',
  ),
  360200 => 
  array (
    'id' => '360200',
    'name' => '景德镇市',
    'level' => 2,
    'pid' => '360000',
  ),
  360201 => 
  array (
    'id' => '360201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360200',
  ),
  360202 => 
  array (
    'id' => '360202',
    'name' => '昌江区',
    'level' => 3,
    'pid' => '360200',
  ),
  360203 => 
  array (
    'id' => '360203',
    'name' => '珠山区',
    'level' => 3,
    'pid' => '360200',
  ),
  360222 => 
  array (
    'id' => '360222',
    'name' => '浮梁县',
    'level' => 3,
    'pid' => '360200',
  ),
  360281 => 
  array (
    'id' => '360281',
    'name' => '乐平市',
    'level' => 3,
    'pid' => '360200',
  ),
  360300 => 
  array (
    'id' => '360300',
    'name' => '萍乡市',
    'level' => 2,
    'pid' => '360000',
  ),
  360301 => 
  array (
    'id' => '360301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360300',
  ),
  360302 => 
  array (
    'id' => '360302',
    'name' => '安源区',
    'level' => 3,
    'pid' => '360300',
  ),
  360313 => 
  array (
    'id' => '360313',
    'name' => '湘东区',
    'level' => 3,
    'pid' => '360300',
  ),
  360321 => 
  array (
    'id' => '360321',
    'name' => '莲花县',
    'level' => 3,
    'pid' => '360300',
  ),
  360322 => 
  array (
    'id' => '360322',
    'name' => '上栗县',
    'level' => 3,
    'pid' => '360300',
  ),
  360323 => 
  array (
    'id' => '360323',
    'name' => '芦溪县',
    'level' => 3,
    'pid' => '360300',
  ),
  360400 => 
  array (
    'id' => '360400',
    'name' => '九江市',
    'level' => 2,
    'pid' => '360000',
  ),
  360401 => 
  array (
    'id' => '360401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360400',
  ),
  360402 => 
  array (
    'id' => '360402',
    'name' => '庐山区',
    'level' => 3,
    'pid' => '360400',
  ),
  360403 => 
  array (
    'id' => '360403',
    'name' => '浔阳区',
    'level' => 3,
    'pid' => '360400',
  ),
  360421 => 
  array (
    'id' => '360421',
    'name' => '九江县',
    'level' => 3,
    'pid' => '360400',
  ),
  360423 => 
  array (
    'id' => '360423',
    'name' => '武宁县',
    'level' => 3,
    'pid' => '360400',
  ),
  360424 => 
  array (
    'id' => '360424',
    'name' => '修水县',
    'level' => 3,
    'pid' => '360400',
  ),
  360425 => 
  array (
    'id' => '360425',
    'name' => '永修县',
    'level' => 3,
    'pid' => '360400',
  ),
  360426 => 
  array (
    'id' => '360426',
    'name' => '德安县',
    'level' => 3,
    'pid' => '360400',
  ),
  360427 => 
  array (
    'id' => '360427',
    'name' => '星子县',
    'level' => 3,
    'pid' => '360400',
  ),
  360428 => 
  array (
    'id' => '360428',
    'name' => '都昌县',
    'level' => 3,
    'pid' => '360400',
  ),
  360429 => 
  array (
    'id' => '360429',
    'name' => '湖口县',
    'level' => 3,
    'pid' => '360400',
  ),
  360430 => 
  array (
    'id' => '360430',
    'name' => '彭泽县',
    'level' => 3,
    'pid' => '360400',
  ),
  360481 => 
  array (
    'id' => '360481',
    'name' => '瑞昌市',
    'level' => 3,
    'pid' => '360400',
  ),
  360482 => 
  array (
    'id' => '360482',
    'name' => '共青城市',
    'level' => 3,
    'pid' => '360400',
  ),
  360500 => 
  array (
    'id' => '360500',
    'name' => '新余市',
    'level' => 2,
    'pid' => '360000',
  ),
  360501 => 
  array (
    'id' => '360501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360500',
  ),
  360502 => 
  array (
    'id' => '360502',
    'name' => '渝水区',
    'level' => 3,
    'pid' => '360500',
  ),
  360521 => 
  array (
    'id' => '360521',
    'name' => '分宜县',
    'level' => 3,
    'pid' => '360500',
  ),
  360600 => 
  array (
    'id' => '360600',
    'name' => '鹰潭市',
    'level' => 2,
    'pid' => '360000',
  ),
  360601 => 
  array (
    'id' => '360601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360600',
  ),
  360602 => 
  array (
    'id' => '360602',
    'name' => '月湖区',
    'level' => 3,
    'pid' => '360600',
  ),
  360622 => 
  array (
    'id' => '360622',
    'name' => '余江县',
    'level' => 3,
    'pid' => '360600',
  ),
  360681 => 
  array (
    'id' => '360681',
    'name' => '贵溪市',
    'level' => 3,
    'pid' => '360600',
  ),
  360700 => 
  array (
    'id' => '360700',
    'name' => '赣州市',
    'level' => 2,
    'pid' => '360000',
  ),
  360701 => 
  array (
    'id' => '360701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360700',
  ),
  360702 => 
  array (
    'id' => '360702',
    'name' => '章贡区',
    'level' => 3,
    'pid' => '360700',
  ),
  360703 => 
  array (
    'id' => '360703',
    'name' => '南康区',
    'level' => 3,
    'pid' => '360700',
  ),
  360721 => 
  array (
    'id' => '360721',
    'name' => '赣县',
    'level' => 3,
    'pid' => '360700',
  ),
  360722 => 
  array (
    'id' => '360722',
    'name' => '信丰县',
    'level' => 3,
    'pid' => '360700',
  ),
  360723 => 
  array (
    'id' => '360723',
    'name' => '大余县',
    'level' => 3,
    'pid' => '360700',
  ),
  360724 => 
  array (
    'id' => '360724',
    'name' => '上犹县',
    'level' => 3,
    'pid' => '360700',
  ),
  360725 => 
  array (
    'id' => '360725',
    'name' => '崇义县',
    'level' => 3,
    'pid' => '360700',
  ),
  360726 => 
  array (
    'id' => '360726',
    'name' => '安远县',
    'level' => 3,
    'pid' => '360700',
  ),
  360727 => 
  array (
    'id' => '360727',
    'name' => '龙南县',
    'level' => 3,
    'pid' => '360700',
  ),
  360728 => 
  array (
    'id' => '360728',
    'name' => '定南县',
    'level' => 3,
    'pid' => '360700',
  ),
  360729 => 
  array (
    'id' => '360729',
    'name' => '全南县',
    'level' => 3,
    'pid' => '360700',
  ),
  360730 => 
  array (
    'id' => '360730',
    'name' => '宁都县',
    'level' => 3,
    'pid' => '360700',
  ),
  360731 => 
  array (
    'id' => '360731',
    'name' => '于都县',
    'level' => 3,
    'pid' => '360700',
  ),
  360732 => 
  array (
    'id' => '360732',
    'name' => '兴国县',
    'level' => 3,
    'pid' => '360700',
  ),
  360733 => 
  array (
    'id' => '360733',
    'name' => '会昌县',
    'level' => 3,
    'pid' => '360700',
  ),
  360734 => 
  array (
    'id' => '360734',
    'name' => '寻乌县',
    'level' => 3,
    'pid' => '360700',
  ),
  360735 => 
  array (
    'id' => '360735',
    'name' => '石城县',
    'level' => 3,
    'pid' => '360700',
  ),
  360781 => 
  array (
    'id' => '360781',
    'name' => '瑞金市',
    'level' => 3,
    'pid' => '360700',
  ),
  360800 => 
  array (
    'id' => '360800',
    'name' => '吉安市',
    'level' => 2,
    'pid' => '360000',
  ),
  360801 => 
  array (
    'id' => '360801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360800',
  ),
  360802 => 
  array (
    'id' => '360802',
    'name' => '吉州区',
    'level' => 3,
    'pid' => '360800',
  ),
  360803 => 
  array (
    'id' => '360803',
    'name' => '青原区',
    'level' => 3,
    'pid' => '360800',
  ),
  360821 => 
  array (
    'id' => '360821',
    'name' => '吉安县',
    'level' => 3,
    'pid' => '360800',
  ),
  360822 => 
  array (
    'id' => '360822',
    'name' => '吉水县',
    'level' => 3,
    'pid' => '360800',
  ),
  360823 => 
  array (
    'id' => '360823',
    'name' => '峡江县',
    'level' => 3,
    'pid' => '360800',
  ),
  360824 => 
  array (
    'id' => '360824',
    'name' => '新干县',
    'level' => 3,
    'pid' => '360800',
  ),
  360825 => 
  array (
    'id' => '360825',
    'name' => '永丰县',
    'level' => 3,
    'pid' => '360800',
  ),
  360826 => 
  array (
    'id' => '360826',
    'name' => '泰和县',
    'level' => 3,
    'pid' => '360800',
  ),
  360827 => 
  array (
    'id' => '360827',
    'name' => '遂川县',
    'level' => 3,
    'pid' => '360800',
  ),
  360828 => 
  array (
    'id' => '360828',
    'name' => '万安县',
    'level' => 3,
    'pid' => '360800',
  ),
  360829 => 
  array (
    'id' => '360829',
    'name' => '安福县',
    'level' => 3,
    'pid' => '360800',
  ),
  360830 => 
  array (
    'id' => '360830',
    'name' => '永新县',
    'level' => 3,
    'pid' => '360800',
  ),
  360881 => 
  array (
    'id' => '360881',
    'name' => '井冈山市',
    'level' => 3,
    'pid' => '360800',
  ),
  360900 => 
  array (
    'id' => '360900',
    'name' => '宜春市',
    'level' => 2,
    'pid' => '360000',
  ),
  360901 => 
  array (
    'id' => '360901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '360900',
  ),
  360902 => 
  array (
    'id' => '360902',
    'name' => '袁州区',
    'level' => 3,
    'pid' => '360900',
  ),
  360921 => 
  array (
    'id' => '360921',
    'name' => '奉新县',
    'level' => 3,
    'pid' => '360900',
  ),
  360922 => 
  array (
    'id' => '360922',
    'name' => '万载县',
    'level' => 3,
    'pid' => '360900',
  ),
  360923 => 
  array (
    'id' => '360923',
    'name' => '上高县',
    'level' => 3,
    'pid' => '360900',
  ),
  360924 => 
  array (
    'id' => '360924',
    'name' => '宜丰县',
    'level' => 3,
    'pid' => '360900',
  ),
  360925 => 
  array (
    'id' => '360925',
    'name' => '靖安县',
    'level' => 3,
    'pid' => '360900',
  ),
  360926 => 
  array (
    'id' => '360926',
    'name' => '铜鼓县',
    'level' => 3,
    'pid' => '360900',
  ),
  360981 => 
  array (
    'id' => '360981',
    'name' => '丰城市',
    'level' => 3,
    'pid' => '360900',
  ),
  360982 => 
  array (
    'id' => '360982',
    'name' => '樟树市',
    'level' => 3,
    'pid' => '360900',
  ),
  360983 => 
  array (
    'id' => '360983',
    'name' => '高安市',
    'level' => 3,
    'pid' => '360900',
  ),
  361000 => 
  array (
    'id' => '361000',
    'name' => '抚州市',
    'level' => 2,
    'pid' => '360000',
  ),
  361001 => 
  array (
    'id' => '361001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '361000',
  ),
  361002 => 
  array (
    'id' => '361002',
    'name' => '临川区',
    'level' => 3,
    'pid' => '361000',
  ),
  361021 => 
  array (
    'id' => '361021',
    'name' => '南城县',
    'level' => 3,
    'pid' => '361000',
  ),
  361022 => 
  array (
    'id' => '361022',
    'name' => '黎川县',
    'level' => 3,
    'pid' => '361000',
  ),
  361023 => 
  array (
    'id' => '361023',
    'name' => '南丰县',
    'level' => 3,
    'pid' => '361000',
  ),
  361024 => 
  array (
    'id' => '361024',
    'name' => '崇仁县',
    'level' => 3,
    'pid' => '361000',
  ),
  361025 => 
  array (
    'id' => '361025',
    'name' => '乐安县',
    'level' => 3,
    'pid' => '361000',
  ),
  361026 => 
  array (
    'id' => '361026',
    'name' => '宜黄县',
    'level' => 3,
    'pid' => '361000',
  ),
  361027 => 
  array (
    'id' => '361027',
    'name' => '金溪县',
    'level' => 3,
    'pid' => '361000',
  ),
  361028 => 
  array (
    'id' => '361028',
    'name' => '资溪县',
    'level' => 3,
    'pid' => '361000',
  ),
  361029 => 
  array (
    'id' => '361029',
    'name' => '东乡县',
    'level' => 3,
    'pid' => '361000',
  ),
  361030 => 
  array (
    'id' => '361030',
    'name' => '广昌县',
    'level' => 3,
    'pid' => '361000',
  ),
  361100 => 
  array (
    'id' => '361100',
    'name' => '上饶市',
    'level' => 2,
    'pid' => '360000',
  ),
  361101 => 
  array (
    'id' => '361101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '361100',
  ),
  361102 => 
  array (
    'id' => '361102',
    'name' => '信州区',
    'level' => 3,
    'pid' => '361100',
  ),
  361103 => 
  array (
    'id' => '361103',
    'name' => '广丰区',
    'level' => 3,
    'pid' => '361100',
  ),
  361121 => 
  array (
    'id' => '361121',
    'name' => '上饶县',
    'level' => 3,
    'pid' => '361100',
  ),
  361123 => 
  array (
    'id' => '361123',
    'name' => '玉山县',
    'level' => 3,
    'pid' => '361100',
  ),
  361124 => 
  array (
    'id' => '361124',
    'name' => '铅山县',
    'level' => 3,
    'pid' => '361100',
  ),
  361125 => 
  array (
    'id' => '361125',
    'name' => '横峰县',
    'level' => 3,
    'pid' => '361100',
  ),
  361126 => 
  array (
    'id' => '361126',
    'name' => '弋阳县',
    'level' => 3,
    'pid' => '361100',
  ),
  361127 => 
  array (
    'id' => '361127',
    'name' => '余干县',
    'level' => 3,
    'pid' => '361100',
  ),
  361128 => 
  array (
    'id' => '361128',
    'name' => '鄱阳县',
    'level' => 3,
    'pid' => '361100',
  ),
  361129 => 
  array (
    'id' => '361129',
    'name' => '万年县',
    'level' => 3,
    'pid' => '361100',
  ),
  361130 => 
  array (
    'id' => '361130',
    'name' => '婺源县',
    'level' => 3,
    'pid' => '361100',
  ),
  361181 => 
  array (
    'id' => '361181',
    'name' => '德兴市',
    'level' => 3,
    'pid' => '361100',
  ),
  370000 => 
  array (
    'id' => '370000',
    'name' => '山东省',
    'level' => 1,
    'pid' => 0,
  ),
  370100 => 
  array (
    'id' => '370100',
    'name' => '济南市',
    'level' => 2,
    'pid' => '370000',
  ),
  370101 => 
  array (
    'id' => '370101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370100',
  ),
  370102 => 
  array (
    'id' => '370102',
    'name' => '历下区',
    'level' => 3,
    'pid' => '370100',
  ),
  370103 => 
  array (
    'id' => '370103',
    'name' => '市中区',
    'level' => 3,
    'pid' => '370100',
  ),
  370104 => 
  array (
    'id' => '370104',
    'name' => '槐荫区',
    'level' => 3,
    'pid' => '370100',
  ),
  370105 => 
  array (
    'id' => '370105',
    'name' => '天桥区',
    'level' => 3,
    'pid' => '370100',
  ),
  370112 => 
  array (
    'id' => '370112',
    'name' => '历城区',
    'level' => 3,
    'pid' => '370100',
  ),
  370113 => 
  array (
    'id' => '370113',
    'name' => '长清区',
    'level' => 3,
    'pid' => '370100',
  ),
  370124 => 
  array (
    'id' => '370124',
    'name' => '平阴县',
    'level' => 3,
    'pid' => '370100',
  ),
  370125 => 
  array (
    'id' => '370125',
    'name' => '济阳县',
    'level' => 3,
    'pid' => '370100',
  ),
  370126 => 
  array (
    'id' => '370126',
    'name' => '商河县',
    'level' => 3,
    'pid' => '370100',
  ),
  370181 => 
  array (
    'id' => '370181',
    'name' => '章丘市',
    'level' => 3,
    'pid' => '370100',
  ),
  370200 => 
  array (
    'id' => '370200',
    'name' => '青岛市',
    'level' => 2,
    'pid' => '370000',
  ),
  370201 => 
  array (
    'id' => '370201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370200',
  ),
  370202 => 
  array (
    'id' => '370202',
    'name' => '市南区',
    'level' => 3,
    'pid' => '370200',
  ),
  370203 => 
  array (
    'id' => '370203',
    'name' => '市北区',
    'level' => 3,
    'pid' => '370200',
  ),
  370211 => 
  array (
    'id' => '370211',
    'name' => '黄岛区',
    'level' => 3,
    'pid' => '370200',
  ),
  370212 => 
  array (
    'id' => '370212',
    'name' => '崂山区',
    'level' => 3,
    'pid' => '370200',
  ),
  370213 => 
  array (
    'id' => '370213',
    'name' => '李沧区',
    'level' => 3,
    'pid' => '370200',
  ),
  370214 => 
  array (
    'id' => '370214',
    'name' => '城阳区',
    'level' => 3,
    'pid' => '370200',
  ),
  370281 => 
  array (
    'id' => '370281',
    'name' => '胶州市',
    'level' => 3,
    'pid' => '370200',
  ),
  370282 => 
  array (
    'id' => '370282',
    'name' => '即墨市',
    'level' => 3,
    'pid' => '370200',
  ),
  370283 => 
  array (
    'id' => '370283',
    'name' => '平度市',
    'level' => 3,
    'pid' => '370200',
  ),
  370285 => 
  array (
    'id' => '370285',
    'name' => '莱西市',
    'level' => 3,
    'pid' => '370200',
  ),
  370300 => 
  array (
    'id' => '370300',
    'name' => '淄博市',
    'level' => 2,
    'pid' => '370000',
  ),
  370301 => 
  array (
    'id' => '370301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370300',
  ),
  370302 => 
  array (
    'id' => '370302',
    'name' => '淄川区',
    'level' => 3,
    'pid' => '370300',
  ),
  370303 => 
  array (
    'id' => '370303',
    'name' => '张店区',
    'level' => 3,
    'pid' => '370300',
  ),
  370304 => 
  array (
    'id' => '370304',
    'name' => '博山区',
    'level' => 3,
    'pid' => '370300',
  ),
  370305 => 
  array (
    'id' => '370305',
    'name' => '临淄区',
    'level' => 3,
    'pid' => '370300',
  ),
  370306 => 
  array (
    'id' => '370306',
    'name' => '周村区',
    'level' => 3,
    'pid' => '370300',
  ),
  370321 => 
  array (
    'id' => '370321',
    'name' => '桓台县',
    'level' => 3,
    'pid' => '370300',
  ),
  370322 => 
  array (
    'id' => '370322',
    'name' => '高青县',
    'level' => 3,
    'pid' => '370300',
  ),
  370323 => 
  array (
    'id' => '370323',
    'name' => '沂源县',
    'level' => 3,
    'pid' => '370300',
  ),
  370400 => 
  array (
    'id' => '370400',
    'name' => '枣庄市',
    'level' => 2,
    'pid' => '370000',
  ),
  370401 => 
  array (
    'id' => '370401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370400',
  ),
  370402 => 
  array (
    'id' => '370402',
    'name' => '市中区',
    'level' => 3,
    'pid' => '370400',
  ),
  370403 => 
  array (
    'id' => '370403',
    'name' => '薛城区',
    'level' => 3,
    'pid' => '370400',
  ),
  370404 => 
  array (
    'id' => '370404',
    'name' => '峄城区',
    'level' => 3,
    'pid' => '370400',
  ),
  370405 => 
  array (
    'id' => '370405',
    'name' => '台儿庄区',
    'level' => 3,
    'pid' => '370400',
  ),
  370406 => 
  array (
    'id' => '370406',
    'name' => '山亭区',
    'level' => 3,
    'pid' => '370400',
  ),
  370481 => 
  array (
    'id' => '370481',
    'name' => '滕州市',
    'level' => 3,
    'pid' => '370400',
  ),
  370500 => 
  array (
    'id' => '370500',
    'name' => '东营市',
    'level' => 2,
    'pid' => '370000',
  ),
  370501 => 
  array (
    'id' => '370501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370500',
  ),
  370502 => 
  array (
    'id' => '370502',
    'name' => '东营区',
    'level' => 3,
    'pid' => '370500',
  ),
  370503 => 
  array (
    'id' => '370503',
    'name' => '河口区',
    'level' => 3,
    'pid' => '370500',
  ),
  370521 => 
  array (
    'id' => '370521',
    'name' => '垦利县',
    'level' => 3,
    'pid' => '370500',
  ),
  370522 => 
  array (
    'id' => '370522',
    'name' => '利津县',
    'level' => 3,
    'pid' => '370500',
  ),
  370523 => 
  array (
    'id' => '370523',
    'name' => '广饶县',
    'level' => 3,
    'pid' => '370500',
  ),
  370600 => 
  array (
    'id' => '370600',
    'name' => '烟台市',
    'level' => 2,
    'pid' => '370000',
  ),
  370601 => 
  array (
    'id' => '370601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370600',
  ),
  370602 => 
  array (
    'id' => '370602',
    'name' => '芝罘区',
    'level' => 3,
    'pid' => '370600',
  ),
  370611 => 
  array (
    'id' => '370611',
    'name' => '福山区',
    'level' => 3,
    'pid' => '370600',
  ),
  370612 => 
  array (
    'id' => '370612',
    'name' => '牟平区',
    'level' => 3,
    'pid' => '370600',
  ),
  370613 => 
  array (
    'id' => '370613',
    'name' => '莱山区',
    'level' => 3,
    'pid' => '370600',
  ),
  370634 => 
  array (
    'id' => '370634',
    'name' => '长岛县',
    'level' => 3,
    'pid' => '370600',
  ),
  370681 => 
  array (
    'id' => '370681',
    'name' => '龙口市',
    'level' => 3,
    'pid' => '370600',
  ),
  370682 => 
  array (
    'id' => '370682',
    'name' => '莱阳市',
    'level' => 3,
    'pid' => '370600',
  ),
  370683 => 
  array (
    'id' => '370683',
    'name' => '莱州市',
    'level' => 3,
    'pid' => '370600',
  ),
  370684 => 
  array (
    'id' => '370684',
    'name' => '蓬莱市',
    'level' => 3,
    'pid' => '370600',
  ),
  370685 => 
  array (
    'id' => '370685',
    'name' => '招远市',
    'level' => 3,
    'pid' => '370600',
  ),
  370686 => 
  array (
    'id' => '370686',
    'name' => '栖霞市',
    'level' => 3,
    'pid' => '370600',
  ),
  370687 => 
  array (
    'id' => '370687',
    'name' => '海阳市',
    'level' => 3,
    'pid' => '370600',
  ),
  370700 => 
  array (
    'id' => '370700',
    'name' => '潍坊市',
    'level' => 2,
    'pid' => '370000',
  ),
  370701 => 
  array (
    'id' => '370701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370700',
  ),
  370702 => 
  array (
    'id' => '370702',
    'name' => '潍城区',
    'level' => 3,
    'pid' => '370700',
  ),
  370703 => 
  array (
    'id' => '370703',
    'name' => '寒亭区',
    'level' => 3,
    'pid' => '370700',
  ),
  370704 => 
  array (
    'id' => '370704',
    'name' => '坊子区',
    'level' => 3,
    'pid' => '370700',
  ),
  370705 => 
  array (
    'id' => '370705',
    'name' => '奎文区',
    'level' => 3,
    'pid' => '370700',
  ),
  370724 => 
  array (
    'id' => '370724',
    'name' => '临朐县',
    'level' => 3,
    'pid' => '370700',
  ),
  370725 => 
  array (
    'id' => '370725',
    'name' => '昌乐县',
    'level' => 3,
    'pid' => '370700',
  ),
  370781 => 
  array (
    'id' => '370781',
    'name' => '青州市',
    'level' => 3,
    'pid' => '370700',
  ),
  370782 => 
  array (
    'id' => '370782',
    'name' => '诸城市',
    'level' => 3,
    'pid' => '370700',
  ),
  370783 => 
  array (
    'id' => '370783',
    'name' => '寿光市',
    'level' => 3,
    'pid' => '370700',
  ),
  370784 => 
  array (
    'id' => '370784',
    'name' => '安丘市',
    'level' => 3,
    'pid' => '370700',
  ),
  370785 => 
  array (
    'id' => '370785',
    'name' => '高密市',
    'level' => 3,
    'pid' => '370700',
  ),
  370786 => 
  array (
    'id' => '370786',
    'name' => '昌邑市',
    'level' => 3,
    'pid' => '370700',
  ),
  370800 => 
  array (
    'id' => '370800',
    'name' => '济宁市',
    'level' => 2,
    'pid' => '370000',
  ),
  370801 => 
  array (
    'id' => '370801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370800',
  ),
  370811 => 
  array (
    'id' => '370811',
    'name' => '任城区',
    'level' => 3,
    'pid' => '370800',
  ),
  370812 => 
  array (
    'id' => '370812',
    'name' => '兖州区',
    'level' => 3,
    'pid' => '370800',
  ),
  370826 => 
  array (
    'id' => '370826',
    'name' => '微山县',
    'level' => 3,
    'pid' => '370800',
  ),
  370827 => 
  array (
    'id' => '370827',
    'name' => '鱼台县',
    'level' => 3,
    'pid' => '370800',
  ),
  370828 => 
  array (
    'id' => '370828',
    'name' => '金乡县',
    'level' => 3,
    'pid' => '370800',
  ),
  370829 => 
  array (
    'id' => '370829',
    'name' => '嘉祥县',
    'level' => 3,
    'pid' => '370800',
  ),
  370830 => 
  array (
    'id' => '370830',
    'name' => '汶上县',
    'level' => 3,
    'pid' => '370800',
  ),
  370831 => 
  array (
    'id' => '370831',
    'name' => '泗水县',
    'level' => 3,
    'pid' => '370800',
  ),
  370832 => 
  array (
    'id' => '370832',
    'name' => '梁山县',
    'level' => 3,
    'pid' => '370800',
  ),
  370881 => 
  array (
    'id' => '370881',
    'name' => '曲阜市',
    'level' => 3,
    'pid' => '370800',
  ),
  370883 => 
  array (
    'id' => '370883',
    'name' => '邹城市',
    'level' => 3,
    'pid' => '370800',
  ),
  370900 => 
  array (
    'id' => '370900',
    'name' => '泰安市',
    'level' => 2,
    'pid' => '370000',
  ),
  370901 => 
  array (
    'id' => '370901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '370900',
  ),
  370902 => 
  array (
    'id' => '370902',
    'name' => '泰山区',
    'level' => 3,
    'pid' => '370900',
  ),
  370911 => 
  array (
    'id' => '370911',
    'name' => '岱岳区',
    'level' => 3,
    'pid' => '370900',
  ),
  370921 => 
  array (
    'id' => '370921',
    'name' => '宁阳县',
    'level' => 3,
    'pid' => '370900',
  ),
  370923 => 
  array (
    'id' => '370923',
    'name' => '东平县',
    'level' => 3,
    'pid' => '370900',
  ),
  370982 => 
  array (
    'id' => '370982',
    'name' => '新泰市',
    'level' => 3,
    'pid' => '370900',
  ),
  370983 => 
  array (
    'id' => '370983',
    'name' => '肥城市',
    'level' => 3,
    'pid' => '370900',
  ),
  371000 => 
  array (
    'id' => '371000',
    'name' => '威海市',
    'level' => 2,
    'pid' => '370000',
  ),
  371001 => 
  array (
    'id' => '371001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371000',
  ),
  371002 => 
  array (
    'id' => '371002',
    'name' => '环翠区',
    'level' => 3,
    'pid' => '371000',
  ),
  371003 => 
  array (
    'id' => '371003',
    'name' => '文登区',
    'level' => 3,
    'pid' => '371000',
  ),
  371082 => 
  array (
    'id' => '371082',
    'name' => '荣成市',
    'level' => 3,
    'pid' => '371000',
  ),
  371083 => 
  array (
    'id' => '371083',
    'name' => '乳山市',
    'level' => 3,
    'pid' => '371000',
  ),
  371100 => 
  array (
    'id' => '371100',
    'name' => '日照市',
    'level' => 2,
    'pid' => '370000',
  ),
  371101 => 
  array (
    'id' => '371101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371100',
  ),
  371102 => 
  array (
    'id' => '371102',
    'name' => '东港区',
    'level' => 3,
    'pid' => '371100',
  ),
  371103 => 
  array (
    'id' => '371103',
    'name' => '岚山区',
    'level' => 3,
    'pid' => '371100',
  ),
  371121 => 
  array (
    'id' => '371121',
    'name' => '五莲县',
    'level' => 3,
    'pid' => '371100',
  ),
  371122 => 
  array (
    'id' => '371122',
    'name' => '莒县',
    'level' => 3,
    'pid' => '371100',
  ),
  371200 => 
  array (
    'id' => '371200',
    'name' => '莱芜市',
    'level' => 2,
    'pid' => '370000',
  ),
  371201 => 
  array (
    'id' => '371201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371200',
  ),
  371202 => 
  array (
    'id' => '371202',
    'name' => '莱城区',
    'level' => 3,
    'pid' => '371200',
  ),
  371203 => 
  array (
    'id' => '371203',
    'name' => '钢城区',
    'level' => 3,
    'pid' => '371200',
  ),
  371300 => 
  array (
    'id' => '371300',
    'name' => '临沂市',
    'level' => 2,
    'pid' => '370000',
  ),
  371301 => 
  array (
    'id' => '371301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371300',
  ),
  371302 => 
  array (
    'id' => '371302',
    'name' => '兰山区',
    'level' => 3,
    'pid' => '371300',
  ),
  371311 => 
  array (
    'id' => '371311',
    'name' => '罗庄区',
    'level' => 3,
    'pid' => '371300',
  ),
  371312 => 
  array (
    'id' => '371312',
    'name' => '河东区',
    'level' => 3,
    'pid' => '371300',
  ),
  371321 => 
  array (
    'id' => '371321',
    'name' => '沂南县',
    'level' => 3,
    'pid' => '371300',
  ),
  371322 => 
  array (
    'id' => '371322',
    'name' => '郯城县',
    'level' => 3,
    'pid' => '371300',
  ),
  371323 => 
  array (
    'id' => '371323',
    'name' => '沂水县',
    'level' => 3,
    'pid' => '371300',
  ),
  371324 => 
  array (
    'id' => '371324',
    'name' => '兰陵县',
    'level' => 3,
    'pid' => '371300',
  ),
  371325 => 
  array (
    'id' => '371325',
    'name' => '费县',
    'level' => 3,
    'pid' => '371300',
  ),
  371326 => 
  array (
    'id' => '371326',
    'name' => '平邑县',
    'level' => 3,
    'pid' => '371300',
  ),
  371327 => 
  array (
    'id' => '371327',
    'name' => '莒南县',
    'level' => 3,
    'pid' => '371300',
  ),
  371328 => 
  array (
    'id' => '371328',
    'name' => '蒙阴县',
    'level' => 3,
    'pid' => '371300',
  ),
  371329 => 
  array (
    'id' => '371329',
    'name' => '临沭县',
    'level' => 3,
    'pid' => '371300',
  ),
  371400 => 
  array (
    'id' => '371400',
    'name' => '德州市',
    'level' => 2,
    'pid' => '370000',
  ),
  371401 => 
  array (
    'id' => '371401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371400',
  ),
  371402 => 
  array (
    'id' => '371402',
    'name' => '德城区',
    'level' => 3,
    'pid' => '371400',
  ),
  371403 => 
  array (
    'id' => '371403',
    'name' => '陵城区',
    'level' => 3,
    'pid' => '371400',
  ),
  371422 => 
  array (
    'id' => '371422',
    'name' => '宁津县',
    'level' => 3,
    'pid' => '371400',
  ),
  371423 => 
  array (
    'id' => '371423',
    'name' => '庆云县',
    'level' => 3,
    'pid' => '371400',
  ),
  371424 => 
  array (
    'id' => '371424',
    'name' => '临邑县',
    'level' => 3,
    'pid' => '371400',
  ),
  371425 => 
  array (
    'id' => '371425',
    'name' => '齐河县',
    'level' => 3,
    'pid' => '371400',
  ),
  371426 => 
  array (
    'id' => '371426',
    'name' => '平原县',
    'level' => 3,
    'pid' => '371400',
  ),
  371427 => 
  array (
    'id' => '371427',
    'name' => '夏津县',
    'level' => 3,
    'pid' => '371400',
  ),
  371428 => 
  array (
    'id' => '371428',
    'name' => '武城县',
    'level' => 3,
    'pid' => '371400',
  ),
  371481 => 
  array (
    'id' => '371481',
    'name' => '乐陵市',
    'level' => 3,
    'pid' => '371400',
  ),
  371482 => 
  array (
    'id' => '371482',
    'name' => '禹城市',
    'level' => 3,
    'pid' => '371400',
  ),
  371500 => 
  array (
    'id' => '371500',
    'name' => '聊城市',
    'level' => 2,
    'pid' => '370000',
  ),
  371501 => 
  array (
    'id' => '371501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371500',
  ),
  371502 => 
  array (
    'id' => '371502',
    'name' => '东昌府区',
    'level' => 3,
    'pid' => '371500',
  ),
  371521 => 
  array (
    'id' => '371521',
    'name' => '阳谷县',
    'level' => 3,
    'pid' => '371500',
  ),
  371522 => 
  array (
    'id' => '371522',
    'name' => '莘县',
    'level' => 3,
    'pid' => '371500',
  ),
  371523 => 
  array (
    'id' => '371523',
    'name' => '茌平县',
    'level' => 3,
    'pid' => '371500',
  ),
  371524 => 
  array (
    'id' => '371524',
    'name' => '东阿县',
    'level' => 3,
    'pid' => '371500',
  ),
  371525 => 
  array (
    'id' => '371525',
    'name' => '冠县',
    'level' => 3,
    'pid' => '371500',
  ),
  371526 => 
  array (
    'id' => '371526',
    'name' => '高唐县',
    'level' => 3,
    'pid' => '371500',
  ),
  371581 => 
  array (
    'id' => '371581',
    'name' => '临清市',
    'level' => 3,
    'pid' => '371500',
  ),
  371600 => 
  array (
    'id' => '371600',
    'name' => '滨州市',
    'level' => 2,
    'pid' => '370000',
  ),
  371601 => 
  array (
    'id' => '371601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371600',
  ),
  371602 => 
  array (
    'id' => '371602',
    'name' => '滨城区',
    'level' => 3,
    'pid' => '371600',
  ),
  371603 => 
  array (
    'id' => '371603',
    'name' => '沾化区',
    'level' => 3,
    'pid' => '371600',
  ),
  371621 => 
  array (
    'id' => '371621',
    'name' => '惠民县',
    'level' => 3,
    'pid' => '371600',
  ),
  371622 => 
  array (
    'id' => '371622',
    'name' => '阳信县',
    'level' => 3,
    'pid' => '371600',
  ),
  371623 => 
  array (
    'id' => '371623',
    'name' => '无棣县',
    'level' => 3,
    'pid' => '371600',
  ),
  371625 => 
  array (
    'id' => '371625',
    'name' => '博兴县',
    'level' => 3,
    'pid' => '371600',
  ),
  371626 => 
  array (
    'id' => '371626',
    'name' => '邹平县',
    'level' => 3,
    'pid' => '371600',
  ),
  371700 => 
  array (
    'id' => '371700',
    'name' => '菏泽市',
    'level' => 2,
    'pid' => '370000',
  ),
  371701 => 
  array (
    'id' => '371701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '371700',
  ),
  371702 => 
  array (
    'id' => '371702',
    'name' => '牡丹区',
    'level' => 3,
    'pid' => '371700',
  ),
  371721 => 
  array (
    'id' => '371721',
    'name' => '曹县',
    'level' => 3,
    'pid' => '371700',
  ),
  371722 => 
  array (
    'id' => '371722',
    'name' => '单县',
    'level' => 3,
    'pid' => '371700',
  ),
  371723 => 
  array (
    'id' => '371723',
    'name' => '成武县',
    'level' => 3,
    'pid' => '371700',
  ),
  371724 => 
  array (
    'id' => '371724',
    'name' => '巨野县',
    'level' => 3,
    'pid' => '371700',
  ),
  371725 => 
  array (
    'id' => '371725',
    'name' => '郓城县',
    'level' => 3,
    'pid' => '371700',
  ),
  371726 => 
  array (
    'id' => '371726',
    'name' => '鄄城县',
    'level' => 3,
    'pid' => '371700',
  ),
  371727 => 
  array (
    'id' => '371727',
    'name' => '定陶县',
    'level' => 3,
    'pid' => '371700',
  ),
  371728 => 
  array (
    'id' => '371728',
    'name' => '东明县',
    'level' => 3,
    'pid' => '371700',
  ),
  410000 => 
  array (
    'id' => '410000',
    'name' => '河南省',
    'level' => 1,
    'pid' => 0,
  ),
  410100 => 
  array (
    'id' => '410100',
    'name' => '郑州市',
    'level' => 2,
    'pid' => '410000',
  ),
  410101 => 
  array (
    'id' => '410101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410100',
  ),
  410102 => 
  array (
    'id' => '410102',
    'name' => '中原区',
    'level' => 3,
    'pid' => '410100',
  ),
  410103 => 
  array (
    'id' => '410103',
    'name' => '二七区',
    'level' => 3,
    'pid' => '410100',
  ),
  410104 => 
  array (
    'id' => '410104',
    'name' => '管城回族区',
    'level' => 3,
    'pid' => '410100',
  ),
  410105 => 
  array (
    'id' => '410105',
    'name' => '金水区',
    'level' => 3,
    'pid' => '410100',
  ),
  410106 => 
  array (
    'id' => '410106',
    'name' => '上街区',
    'level' => 3,
    'pid' => '410100',
  ),
  410108 => 
  array (
    'id' => '410108',
    'name' => '惠济区',
    'level' => 3,
    'pid' => '410100',
  ),
  410122 => 
  array (
    'id' => '410122',
    'name' => '中牟县',
    'level' => 3,
    'pid' => '410100',
  ),
  410181 => 
  array (
    'id' => '410181',
    'name' => '巩义市',
    'level' => 3,
    'pid' => '410100',
  ),
  410182 => 
  array (
    'id' => '410182',
    'name' => '荥阳市',
    'level' => 3,
    'pid' => '410100',
  ),
  410183 => 
  array (
    'id' => '410183',
    'name' => '新密市',
    'level' => 3,
    'pid' => '410100',
  ),
  410184 => 
  array (
    'id' => '410184',
    'name' => '新郑市',
    'level' => 3,
    'pid' => '410100',
  ),
  410185 => 
  array (
    'id' => '410185',
    'name' => '登封市',
    'level' => 3,
    'pid' => '410100',
  ),
  410200 => 
  array (
    'id' => '410200',
    'name' => '开封市',
    'level' => 2,
    'pid' => '410000',
  ),
  410201 => 
  array (
    'id' => '410201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410200',
  ),
  410202 => 
  array (
    'id' => '410202',
    'name' => '龙亭区',
    'level' => 3,
    'pid' => '410200',
  ),
  410203 => 
  array (
    'id' => '410203',
    'name' => '顺河回族区',
    'level' => 3,
    'pid' => '410200',
  ),
  410204 => 
  array (
    'id' => '410204',
    'name' => '鼓楼区',
    'level' => 3,
    'pid' => '410200',
  ),
  410205 => 
  array (
    'id' => '410205',
    'name' => '禹王台区',
    'level' => 3,
    'pid' => '410200',
  ),
  410211 => 
  array (
    'id' => '410211',
    'name' => '金明区',
    'level' => 3,
    'pid' => '410200',
  ),
  410212 => 
  array (
    'id' => '410212',
    'name' => '祥符区',
    'level' => 3,
    'pid' => '410200',
  ),
  410221 => 
  array (
    'id' => '410221',
    'name' => '杞县',
    'level' => 3,
    'pid' => '410200',
  ),
  410222 => 
  array (
    'id' => '410222',
    'name' => '通许县',
    'level' => 3,
    'pid' => '410200',
  ),
  410223 => 
  array (
    'id' => '410223',
    'name' => '尉氏县',
    'level' => 3,
    'pid' => '410200',
  ),
  410225 => 
  array (
    'id' => '410225',
    'name' => '兰考县',
    'level' => 3,
    'pid' => '410200',
  ),
  410300 => 
  array (
    'id' => '410300',
    'name' => '洛阳市',
    'level' => 2,
    'pid' => '410000',
  ),
  410301 => 
  array (
    'id' => '410301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410300',
  ),
  410302 => 
  array (
    'id' => '410302',
    'name' => '老城区',
    'level' => 3,
    'pid' => '410300',
  ),
  410303 => 
  array (
    'id' => '410303',
    'name' => '西工区',
    'level' => 3,
    'pid' => '410300',
  ),
  410304 => 
  array (
    'id' => '410304',
    'name' => '瀍河回族区',
    'level' => 3,
    'pid' => '410300',
  ),
  410305 => 
  array (
    'id' => '410305',
    'name' => '涧西区',
    'level' => 3,
    'pid' => '410300',
  ),
  410306 => 
  array (
    'id' => '410306',
    'name' => '吉利区',
    'level' => 3,
    'pid' => '410300',
  ),
  410311 => 
  array (
    'id' => '410311',
    'name' => '洛龙区',
    'level' => 3,
    'pid' => '410300',
  ),
  410322 => 
  array (
    'id' => '410322',
    'name' => '孟津县',
    'level' => 3,
    'pid' => '410300',
  ),
  410323 => 
  array (
    'id' => '410323',
    'name' => '新安县',
    'level' => 3,
    'pid' => '410300',
  ),
  410324 => 
  array (
    'id' => '410324',
    'name' => '栾川县',
    'level' => 3,
    'pid' => '410300',
  ),
  410325 => 
  array (
    'id' => '410325',
    'name' => '嵩县',
    'level' => 3,
    'pid' => '410300',
  ),
  410326 => 
  array (
    'id' => '410326',
    'name' => '汝阳县',
    'level' => 3,
    'pid' => '410300',
  ),
  410327 => 
  array (
    'id' => '410327',
    'name' => '宜阳县',
    'level' => 3,
    'pid' => '410300',
  ),
  410328 => 
  array (
    'id' => '410328',
    'name' => '洛宁县',
    'level' => 3,
    'pid' => '410300',
  ),
  410329 => 
  array (
    'id' => '410329',
    'name' => '伊川县',
    'level' => 3,
    'pid' => '410300',
  ),
  410381 => 
  array (
    'id' => '410381',
    'name' => '偃师市',
    'level' => 3,
    'pid' => '410300',
  ),
  410400 => 
  array (
    'id' => '410400',
    'name' => '平顶山市',
    'level' => 2,
    'pid' => '410000',
  ),
  410401 => 
  array (
    'id' => '410401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410400',
  ),
  410402 => 
  array (
    'id' => '410402',
    'name' => '新华区',
    'level' => 3,
    'pid' => '410400',
  ),
  410403 => 
  array (
    'id' => '410403',
    'name' => '卫东区',
    'level' => 3,
    'pid' => '410400',
  ),
  410404 => 
  array (
    'id' => '410404',
    'name' => '石龙区',
    'level' => 3,
    'pid' => '410400',
  ),
  410411 => 
  array (
    'id' => '410411',
    'name' => '湛河区',
    'level' => 3,
    'pid' => '410400',
  ),
  410421 => 
  array (
    'id' => '410421',
    'name' => '宝丰县',
    'level' => 3,
    'pid' => '410400',
  ),
  410422 => 
  array (
    'id' => '410422',
    'name' => '叶县',
    'level' => 3,
    'pid' => '410400',
  ),
  410423 => 
  array (
    'id' => '410423',
    'name' => '鲁山县',
    'level' => 3,
    'pid' => '410400',
  ),
  410425 => 
  array (
    'id' => '410425',
    'name' => '郏县',
    'level' => 3,
    'pid' => '410400',
  ),
  410481 => 
  array (
    'id' => '410481',
    'name' => '舞钢市',
    'level' => 3,
    'pid' => '410400',
  ),
  410482 => 
  array (
    'id' => '410482',
    'name' => '汝州市',
    'level' => 3,
    'pid' => '410400',
  ),
  410500 => 
  array (
    'id' => '410500',
    'name' => '安阳市',
    'level' => 2,
    'pid' => '410000',
  ),
  410501 => 
  array (
    'id' => '410501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410500',
  ),
  410502 => 
  array (
    'id' => '410502',
    'name' => '文峰区',
    'level' => 3,
    'pid' => '410500',
  ),
  410503 => 
  array (
    'id' => '410503',
    'name' => '北关区',
    'level' => 3,
    'pid' => '410500',
  ),
  410505 => 
  array (
    'id' => '410505',
    'name' => '殷都区',
    'level' => 3,
    'pid' => '410500',
  ),
  410506 => 
  array (
    'id' => '410506',
    'name' => '龙安区',
    'level' => 3,
    'pid' => '410500',
  ),
  410522 => 
  array (
    'id' => '410522',
    'name' => '安阳县',
    'level' => 3,
    'pid' => '410500',
  ),
  410523 => 
  array (
    'id' => '410523',
    'name' => '汤阴县',
    'level' => 3,
    'pid' => '410500',
  ),
  410526 => 
  array (
    'id' => '410526',
    'name' => '滑县',
    'level' => 3,
    'pid' => '410500',
  ),
  410527 => 
  array (
    'id' => '410527',
    'name' => '内黄县',
    'level' => 3,
    'pid' => '410500',
  ),
  410581 => 
  array (
    'id' => '410581',
    'name' => '林州市',
    'level' => 3,
    'pid' => '410500',
  ),
  410600 => 
  array (
    'id' => '410600',
    'name' => '鹤壁市',
    'level' => 2,
    'pid' => '410000',
  ),
  410601 => 
  array (
    'id' => '410601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410600',
  ),
  410602 => 
  array (
    'id' => '410602',
    'name' => '鹤山区',
    'level' => 3,
    'pid' => '410600',
  ),
  410603 => 
  array (
    'id' => '410603',
    'name' => '山城区',
    'level' => 3,
    'pid' => '410600',
  ),
  410611 => 
  array (
    'id' => '410611',
    'name' => '淇滨区',
    'level' => 3,
    'pid' => '410600',
  ),
  410621 => 
  array (
    'id' => '410621',
    'name' => '浚县',
    'level' => 3,
    'pid' => '410600',
  ),
  410622 => 
  array (
    'id' => '410622',
    'name' => '淇县',
    'level' => 3,
    'pid' => '410600',
  ),
  410700 => 
  array (
    'id' => '410700',
    'name' => '新乡市',
    'level' => 2,
    'pid' => '410000',
  ),
  410701 => 
  array (
    'id' => '410701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410700',
  ),
  410702 => 
  array (
    'id' => '410702',
    'name' => '红旗区',
    'level' => 3,
    'pid' => '410700',
  ),
  410703 => 
  array (
    'id' => '410703',
    'name' => '卫滨区',
    'level' => 3,
    'pid' => '410700',
  ),
  410704 => 
  array (
    'id' => '410704',
    'name' => '凤泉区',
    'level' => 3,
    'pid' => '410700',
  ),
  410711 => 
  array (
    'id' => '410711',
    'name' => '牧野区',
    'level' => 3,
    'pid' => '410700',
  ),
  410721 => 
  array (
    'id' => '410721',
    'name' => '新乡县',
    'level' => 3,
    'pid' => '410700',
  ),
  410724 => 
  array (
    'id' => '410724',
    'name' => '获嘉县',
    'level' => 3,
    'pid' => '410700',
  ),
  410725 => 
  array (
    'id' => '410725',
    'name' => '原阳县',
    'level' => 3,
    'pid' => '410700',
  ),
  410726 => 
  array (
    'id' => '410726',
    'name' => '延津县',
    'level' => 3,
    'pid' => '410700',
  ),
  410727 => 
  array (
    'id' => '410727',
    'name' => '封丘县',
    'level' => 3,
    'pid' => '410700',
  ),
  410728 => 
  array (
    'id' => '410728',
    'name' => '长垣县',
    'level' => 3,
    'pid' => '410700',
  ),
  410781 => 
  array (
    'id' => '410781',
    'name' => '卫辉市',
    'level' => 3,
    'pid' => '410700',
  ),
  410782 => 
  array (
    'id' => '410782',
    'name' => '辉县市',
    'level' => 3,
    'pid' => '410700',
  ),
  410800 => 
  array (
    'id' => '410800',
    'name' => '焦作市',
    'level' => 2,
    'pid' => '410000',
  ),
  410801 => 
  array (
    'id' => '410801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410800',
  ),
  410802 => 
  array (
    'id' => '410802',
    'name' => '解放区',
    'level' => 3,
    'pid' => '410800',
  ),
  410803 => 
  array (
    'id' => '410803',
    'name' => '中站区',
    'level' => 3,
    'pid' => '410800',
  ),
  410804 => 
  array (
    'id' => '410804',
    'name' => '马村区',
    'level' => 3,
    'pid' => '410800',
  ),
  410811 => 
  array (
    'id' => '410811',
    'name' => '山阳区',
    'level' => 3,
    'pid' => '410800',
  ),
  410821 => 
  array (
    'id' => '410821',
    'name' => '修武县',
    'level' => 3,
    'pid' => '410800',
  ),
  410822 => 
  array (
    'id' => '410822',
    'name' => '博爱县',
    'level' => 3,
    'pid' => '410800',
  ),
  410823 => 
  array (
    'id' => '410823',
    'name' => '武陟县',
    'level' => 3,
    'pid' => '410800',
  ),
  410825 => 
  array (
    'id' => '410825',
    'name' => '温县',
    'level' => 3,
    'pid' => '410800',
  ),
  410882 => 
  array (
    'id' => '410882',
    'name' => '沁阳市',
    'level' => 3,
    'pid' => '410800',
  ),
  410883 => 
  array (
    'id' => '410883',
    'name' => '孟州市',
    'level' => 3,
    'pid' => '410800',
  ),
  410900 => 
  array (
    'id' => '410900',
    'name' => '濮阳市',
    'level' => 2,
    'pid' => '410000',
  ),
  410901 => 
  array (
    'id' => '410901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '410900',
  ),
  410902 => 
  array (
    'id' => '410902',
    'name' => '华龙区',
    'level' => 3,
    'pid' => '410900',
  ),
  410922 => 
  array (
    'id' => '410922',
    'name' => '清丰县',
    'level' => 3,
    'pid' => '410900',
  ),
  410923 => 
  array (
    'id' => '410923',
    'name' => '南乐县',
    'level' => 3,
    'pid' => '410900',
  ),
  410926 => 
  array (
    'id' => '410926',
    'name' => '范县',
    'level' => 3,
    'pid' => '410900',
  ),
  410927 => 
  array (
    'id' => '410927',
    'name' => '台前县',
    'level' => 3,
    'pid' => '410900',
  ),
  410928 => 
  array (
    'id' => '410928',
    'name' => '濮阳县',
    'level' => 3,
    'pid' => '410900',
  ),
  411000 => 
  array (
    'id' => '411000',
    'name' => '许昌市',
    'level' => 2,
    'pid' => '410000',
  ),
  411001 => 
  array (
    'id' => '411001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411000',
  ),
  411002 => 
  array (
    'id' => '411002',
    'name' => '魏都区',
    'level' => 3,
    'pid' => '411000',
  ),
  411023 => 
  array (
    'id' => '411023',
    'name' => '许昌县',
    'level' => 3,
    'pid' => '411000',
  ),
  411024 => 
  array (
    'id' => '411024',
    'name' => '鄢陵县',
    'level' => 3,
    'pid' => '411000',
  ),
  411025 => 
  array (
    'id' => '411025',
    'name' => '襄城县',
    'level' => 3,
    'pid' => '411000',
  ),
  411081 => 
  array (
    'id' => '411081',
    'name' => '禹州市',
    'level' => 3,
    'pid' => '411000',
  ),
  411082 => 
  array (
    'id' => '411082',
    'name' => '长葛市',
    'level' => 3,
    'pid' => '411000',
  ),
  411100 => 
  array (
    'id' => '411100',
    'name' => '漯河市',
    'level' => 2,
    'pid' => '410000',
  ),
  411101 => 
  array (
    'id' => '411101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411100',
  ),
  411102 => 
  array (
    'id' => '411102',
    'name' => '源汇区',
    'level' => 3,
    'pid' => '411100',
  ),
  411103 => 
  array (
    'id' => '411103',
    'name' => '郾城区',
    'level' => 3,
    'pid' => '411100',
  ),
  411104 => 
  array (
    'id' => '411104',
    'name' => '召陵区',
    'level' => 3,
    'pid' => '411100',
  ),
  411121 => 
  array (
    'id' => '411121',
    'name' => '舞阳县',
    'level' => 3,
    'pid' => '411100',
  ),
  411122 => 
  array (
    'id' => '411122',
    'name' => '临颍县',
    'level' => 3,
    'pid' => '411100',
  ),
  411200 => 
  array (
    'id' => '411200',
    'name' => '三门峡市',
    'level' => 2,
    'pid' => '410000',
  ),
  411201 => 
  array (
    'id' => '411201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411200',
  ),
  411202 => 
  array (
    'id' => '411202',
    'name' => '湖滨区',
    'level' => 3,
    'pid' => '411200',
  ),
  411221 => 
  array (
    'id' => '411221',
    'name' => '渑池县',
    'level' => 3,
    'pid' => '411200',
  ),
  411222 => 
  array (
    'id' => '411222',
    'name' => '陕县',
    'level' => 3,
    'pid' => '411200',
  ),
  411224 => 
  array (
    'id' => '411224',
    'name' => '卢氏县',
    'level' => 3,
    'pid' => '411200',
  ),
  411281 => 
  array (
    'id' => '411281',
    'name' => '义马市',
    'level' => 3,
    'pid' => '411200',
  ),
  411282 => 
  array (
    'id' => '411282',
    'name' => '灵宝市',
    'level' => 3,
    'pid' => '411200',
  ),
  411300 => 
  array (
    'id' => '411300',
    'name' => '南阳市',
    'level' => 2,
    'pid' => '410000',
  ),
  411301 => 
  array (
    'id' => '411301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411300',
  ),
  411302 => 
  array (
    'id' => '411302',
    'name' => '宛城区',
    'level' => 3,
    'pid' => '411300',
  ),
  411303 => 
  array (
    'id' => '411303',
    'name' => '卧龙区',
    'level' => 3,
    'pid' => '411300',
  ),
  411321 => 
  array (
    'id' => '411321',
    'name' => '南召县',
    'level' => 3,
    'pid' => '411300',
  ),
  411322 => 
  array (
    'id' => '411322',
    'name' => '方城县',
    'level' => 3,
    'pid' => '411300',
  ),
  411323 => 
  array (
    'id' => '411323',
    'name' => '西峡县',
    'level' => 3,
    'pid' => '411300',
  ),
  411324 => 
  array (
    'id' => '411324',
    'name' => '镇平县',
    'level' => 3,
    'pid' => '411300',
  ),
  411325 => 
  array (
    'id' => '411325',
    'name' => '内乡县',
    'level' => 3,
    'pid' => '411300',
  ),
  411326 => 
  array (
    'id' => '411326',
    'name' => '淅川县',
    'level' => 3,
    'pid' => '411300',
  ),
  411327 => 
  array (
    'id' => '411327',
    'name' => '社旗县',
    'level' => 3,
    'pid' => '411300',
  ),
  411328 => 
  array (
    'id' => '411328',
    'name' => '唐河县',
    'level' => 3,
    'pid' => '411300',
  ),
  411329 => 
  array (
    'id' => '411329',
    'name' => '新野县',
    'level' => 3,
    'pid' => '411300',
  ),
  411330 => 
  array (
    'id' => '411330',
    'name' => '桐柏县',
    'level' => 3,
    'pid' => '411300',
  ),
  411381 => 
  array (
    'id' => '411381',
    'name' => '邓州市',
    'level' => 3,
    'pid' => '411300',
  ),
  411400 => 
  array (
    'id' => '411400',
    'name' => '商丘市',
    'level' => 2,
    'pid' => '410000',
  ),
  411401 => 
  array (
    'id' => '411401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411400',
  ),
  411402 => 
  array (
    'id' => '411402',
    'name' => '梁园区',
    'level' => 3,
    'pid' => '411400',
  ),
  411403 => 
  array (
    'id' => '411403',
    'name' => '睢阳区',
    'level' => 3,
    'pid' => '411400',
  ),
  411421 => 
  array (
    'id' => '411421',
    'name' => '民权县',
    'level' => 3,
    'pid' => '411400',
  ),
  411422 => 
  array (
    'id' => '411422',
    'name' => '睢县',
    'level' => 3,
    'pid' => '411400',
  ),
  411423 => 
  array (
    'id' => '411423',
    'name' => '宁陵县',
    'level' => 3,
    'pid' => '411400',
  ),
  411424 => 
  array (
    'id' => '411424',
    'name' => '柘城县',
    'level' => 3,
    'pid' => '411400',
  ),
  411425 => 
  array (
    'id' => '411425',
    'name' => '虞城县',
    'level' => 3,
    'pid' => '411400',
  ),
  411426 => 
  array (
    'id' => '411426',
    'name' => '夏邑县',
    'level' => 3,
    'pid' => '411400',
  ),
  411481 => 
  array (
    'id' => '411481',
    'name' => '永城市',
    'level' => 3,
    'pid' => '411400',
  ),
  411500 => 
  array (
    'id' => '411500',
    'name' => '信阳市',
    'level' => 2,
    'pid' => '410000',
  ),
  411501 => 
  array (
    'id' => '411501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411500',
  ),
  411502 => 
  array (
    'id' => '411502',
    'name' => '浉河区',
    'level' => 3,
    'pid' => '411500',
  ),
  411503 => 
  array (
    'id' => '411503',
    'name' => '平桥区',
    'level' => 3,
    'pid' => '411500',
  ),
  411521 => 
  array (
    'id' => '411521',
    'name' => '罗山县',
    'level' => 3,
    'pid' => '411500',
  ),
  411522 => 
  array (
    'id' => '411522',
    'name' => '光山县',
    'level' => 3,
    'pid' => '411500',
  ),
  411523 => 
  array (
    'id' => '411523',
    'name' => '新县',
    'level' => 3,
    'pid' => '411500',
  ),
  411524 => 
  array (
    'id' => '411524',
    'name' => '商城县',
    'level' => 3,
    'pid' => '411500',
  ),
  411525 => 
  array (
    'id' => '411525',
    'name' => '固始县',
    'level' => 3,
    'pid' => '411500',
  ),
  411526 => 
  array (
    'id' => '411526',
    'name' => '潢川县',
    'level' => 3,
    'pid' => '411500',
  ),
  411527 => 
  array (
    'id' => '411527',
    'name' => '淮滨县',
    'level' => 3,
    'pid' => '411500',
  ),
  411528 => 
  array (
    'id' => '411528',
    'name' => '息县',
    'level' => 3,
    'pid' => '411500',
  ),
  411600 => 
  array (
    'id' => '411600',
    'name' => '周口市',
    'level' => 2,
    'pid' => '410000',
  ),
  411601 => 
  array (
    'id' => '411601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411600',
  ),
  411602 => 
  array (
    'id' => '411602',
    'name' => '川汇区',
    'level' => 3,
    'pid' => '411600',
  ),
  411621 => 
  array (
    'id' => '411621',
    'name' => '扶沟县',
    'level' => 3,
    'pid' => '411600',
  ),
  411622 => 
  array (
    'id' => '411622',
    'name' => '西华县',
    'level' => 3,
    'pid' => '411600',
  ),
  411623 => 
  array (
    'id' => '411623',
    'name' => '商水县',
    'level' => 3,
    'pid' => '411600',
  ),
  411624 => 
  array (
    'id' => '411624',
    'name' => '沈丘县',
    'level' => 3,
    'pid' => '411600',
  ),
  411625 => 
  array (
    'id' => '411625',
    'name' => '郸城县',
    'level' => 3,
    'pid' => '411600',
  ),
  411626 => 
  array (
    'id' => '411626',
    'name' => '淮阳县',
    'level' => 3,
    'pid' => '411600',
  ),
  411627 => 
  array (
    'id' => '411627',
    'name' => '太康县',
    'level' => 3,
    'pid' => '411600',
  ),
  411628 => 
  array (
    'id' => '411628',
    'name' => '鹿邑县',
    'level' => 3,
    'pid' => '411600',
  ),
  411681 => 
  array (
    'id' => '411681',
    'name' => '项城市',
    'level' => 3,
    'pid' => '411600',
  ),
  411700 => 
  array (
    'id' => '411700',
    'name' => '驻马店市',
    'level' => 2,
    'pid' => '410000',
  ),
  411701 => 
  array (
    'id' => '411701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '411700',
  ),
  411702 => 
  array (
    'id' => '411702',
    'name' => '驿城区',
    'level' => 3,
    'pid' => '411700',
  ),
  411721 => 
  array (
    'id' => '411721',
    'name' => '西平县',
    'level' => 3,
    'pid' => '411700',
  ),
  411722 => 
  array (
    'id' => '411722',
    'name' => '上蔡县',
    'level' => 3,
    'pid' => '411700',
  ),
  411723 => 
  array (
    'id' => '411723',
    'name' => '平舆县',
    'level' => 3,
    'pid' => '411700',
  ),
  411724 => 
  array (
    'id' => '411724',
    'name' => '正阳县',
    'level' => 3,
    'pid' => '411700',
  ),
  411725 => 
  array (
    'id' => '411725',
    'name' => '确山县',
    'level' => 3,
    'pid' => '411700',
  ),
  411726 => 
  array (
    'id' => '411726',
    'name' => '泌阳县',
    'level' => 3,
    'pid' => '411700',
  ),
  411727 => 
  array (
    'id' => '411727',
    'name' => '汝南县',
    'level' => 3,
    'pid' => '411700',
  ),
  411728 => 
  array (
    'id' => '411728',
    'name' => '遂平县',
    'level' => 3,
    'pid' => '411700',
  ),
  411729 => 
  array (
    'id' => '411729',
    'name' => '新蔡县',
    'level' => 3,
    'pid' => '411700',
  ),
  419000 => 
  array (
    'id' => '419000',
    'name' => '省直辖县级行政区划',
    'level' => 2,
    'pid' => '410000',
  ),
  419001 => 
  array (
    'id' => '419001',
    'name' => '济源市',
    'level' => 3,
    'pid' => '419000',
  ),
  420000 => 
  array (
    'id' => '420000',
    'name' => '湖北省',
    'level' => 1,
    'pid' => 0,
  ),
  420100 => 
  array (
    'id' => '420100',
    'name' => '武汉市',
    'level' => 2,
    'pid' => '420000',
  ),
  420101 => 
  array (
    'id' => '420101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420100',
  ),
  420102 => 
  array (
    'id' => '420102',
    'name' => '江岸区',
    'level' => 3,
    'pid' => '420100',
  ),
  420103 => 
  array (
    'id' => '420103',
    'name' => '江汉区',
    'level' => 3,
    'pid' => '420100',
  ),
  420104 => 
  array (
    'id' => '420104',
    'name' => '硚口区',
    'level' => 3,
    'pid' => '420100',
  ),
  420105 => 
  array (
    'id' => '420105',
    'name' => '汉阳区',
    'level' => 3,
    'pid' => '420100',
  ),
  420106 => 
  array (
    'id' => '420106',
    'name' => '武昌区',
    'level' => 3,
    'pid' => '420100',
  ),
  420107 => 
  array (
    'id' => '420107',
    'name' => '青山区',
    'level' => 3,
    'pid' => '420100',
  ),
  420111 => 
  array (
    'id' => '420111',
    'name' => '洪山区',
    'level' => 3,
    'pid' => '420100',
  ),
  420112 => 
  array (
    'id' => '420112',
    'name' => '东西湖区',
    'level' => 3,
    'pid' => '420100',
  ),
  420113 => 
  array (
    'id' => '420113',
    'name' => '汉南区',
    'level' => 3,
    'pid' => '420100',
  ),
  420114 => 
  array (
    'id' => '420114',
    'name' => '蔡甸区',
    'level' => 3,
    'pid' => '420100',
  ),
  420115 => 
  array (
    'id' => '420115',
    'name' => '江夏区',
    'level' => 3,
    'pid' => '420100',
  ),
  420116 => 
  array (
    'id' => '420116',
    'name' => '黄陂区',
    'level' => 3,
    'pid' => '420100',
  ),
  420117 => 
  array (
    'id' => '420117',
    'name' => '新洲区',
    'level' => 3,
    'pid' => '420100',
  ),
  420200 => 
  array (
    'id' => '420200',
    'name' => '黄石市',
    'level' => 2,
    'pid' => '420000',
  ),
  420201 => 
  array (
    'id' => '420201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420200',
  ),
  420202 => 
  array (
    'id' => '420202',
    'name' => '黄石港区',
    'level' => 3,
    'pid' => '420200',
  ),
  420203 => 
  array (
    'id' => '420203',
    'name' => '西塞山区',
    'level' => 3,
    'pid' => '420200',
  ),
  420204 => 
  array (
    'id' => '420204',
    'name' => '下陆区',
    'level' => 3,
    'pid' => '420200',
  ),
  420205 => 
  array (
    'id' => '420205',
    'name' => '铁山区',
    'level' => 3,
    'pid' => '420200',
  ),
  420222 => 
  array (
    'id' => '420222',
    'name' => '阳新县',
    'level' => 3,
    'pid' => '420200',
  ),
  420281 => 
  array (
    'id' => '420281',
    'name' => '大冶市',
    'level' => 3,
    'pid' => '420200',
  ),
  420300 => 
  array (
    'id' => '420300',
    'name' => '十堰市',
    'level' => 2,
    'pid' => '420000',
  ),
  420301 => 
  array (
    'id' => '420301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420300',
  ),
  420302 => 
  array (
    'id' => '420302',
    'name' => '茅箭区',
    'level' => 3,
    'pid' => '420300',
  ),
  420303 => 
  array (
    'id' => '420303',
    'name' => '张湾区',
    'level' => 3,
    'pid' => '420300',
  ),
  420304 => 
  array (
    'id' => '420304',
    'name' => '郧阳区',
    'level' => 3,
    'pid' => '420300',
  ),
  420322 => 
  array (
    'id' => '420322',
    'name' => '郧西县',
    'level' => 3,
    'pid' => '420300',
  ),
  420323 => 
  array (
    'id' => '420323',
    'name' => '竹山县',
    'level' => 3,
    'pid' => '420300',
  ),
  420324 => 
  array (
    'id' => '420324',
    'name' => '竹溪县',
    'level' => 3,
    'pid' => '420300',
  ),
  420325 => 
  array (
    'id' => '420325',
    'name' => '房县',
    'level' => 3,
    'pid' => '420300',
  ),
  420381 => 
  array (
    'id' => '420381',
    'name' => '丹江口市',
    'level' => 3,
    'pid' => '420300',
  ),
  420500 => 
  array (
    'id' => '420500',
    'name' => '宜昌市',
    'level' => 2,
    'pid' => '420000',
  ),
  420501 => 
  array (
    'id' => '420501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420500',
  ),
  420502 => 
  array (
    'id' => '420502',
    'name' => '西陵区',
    'level' => 3,
    'pid' => '420500',
  ),
  420503 => 
  array (
    'id' => '420503',
    'name' => '伍家岗区',
    'level' => 3,
    'pid' => '420500',
  ),
  420504 => 
  array (
    'id' => '420504',
    'name' => '点军区',
    'level' => 3,
    'pid' => '420500',
  ),
  420505 => 
  array (
    'id' => '420505',
    'name' => '猇亭区',
    'level' => 3,
    'pid' => '420500',
  ),
  420506 => 
  array (
    'id' => '420506',
    'name' => '夷陵区',
    'level' => 3,
    'pid' => '420500',
  ),
  420525 => 
  array (
    'id' => '420525',
    'name' => '远安县',
    'level' => 3,
    'pid' => '420500',
  ),
  420526 => 
  array (
    'id' => '420526',
    'name' => '兴山县',
    'level' => 3,
    'pid' => '420500',
  ),
  420527 => 
  array (
    'id' => '420527',
    'name' => '秭归县',
    'level' => 3,
    'pid' => '420500',
  ),
  420528 => 
  array (
    'id' => '420528',
    'name' => '长阳土家族自治县',
    'level' => 3,
    'pid' => '420500',
  ),
  420529 => 
  array (
    'id' => '420529',
    'name' => '五峰土家族自治县',
    'level' => 3,
    'pid' => '420500',
  ),
  420581 => 
  array (
    'id' => '420581',
    'name' => '宜都市',
    'level' => 3,
    'pid' => '420500',
  ),
  420582 => 
  array (
    'id' => '420582',
    'name' => '当阳市',
    'level' => 3,
    'pid' => '420500',
  ),
  420583 => 
  array (
    'id' => '420583',
    'name' => '枝江市',
    'level' => 3,
    'pid' => '420500',
  ),
  420600 => 
  array (
    'id' => '420600',
    'name' => '襄阳市',
    'level' => 2,
    'pid' => '420000',
  ),
  420601 => 
  array (
    'id' => '420601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420600',
  ),
  420602 => 
  array (
    'id' => '420602',
    'name' => '襄城区',
    'level' => 3,
    'pid' => '420600',
  ),
  420606 => 
  array (
    'id' => '420606',
    'name' => '樊城区',
    'level' => 3,
    'pid' => '420600',
  ),
  420607 => 
  array (
    'id' => '420607',
    'name' => '襄州区',
    'level' => 3,
    'pid' => '420600',
  ),
  420624 => 
  array (
    'id' => '420624',
    'name' => '南漳县',
    'level' => 3,
    'pid' => '420600',
  ),
  420625 => 
  array (
    'id' => '420625',
    'name' => '谷城县',
    'level' => 3,
    'pid' => '420600',
  ),
  420626 => 
  array (
    'id' => '420626',
    'name' => '保康县',
    'level' => 3,
    'pid' => '420600',
  ),
  420682 => 
  array (
    'id' => '420682',
    'name' => '老河口市',
    'level' => 3,
    'pid' => '420600',
  ),
  420683 => 
  array (
    'id' => '420683',
    'name' => '枣阳市',
    'level' => 3,
    'pid' => '420600',
  ),
  420684 => 
  array (
    'id' => '420684',
    'name' => '宜城市',
    'level' => 3,
    'pid' => '420600',
  ),
  420700 => 
  array (
    'id' => '420700',
    'name' => '鄂州市',
    'level' => 2,
    'pid' => '420000',
  ),
  420701 => 
  array (
    'id' => '420701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420700',
  ),
  420702 => 
  array (
    'id' => '420702',
    'name' => '梁子湖区',
    'level' => 3,
    'pid' => '420700',
  ),
  420703 => 
  array (
    'id' => '420703',
    'name' => '华容区',
    'level' => 3,
    'pid' => '420700',
  ),
  420704 => 
  array (
    'id' => '420704',
    'name' => '鄂城区',
    'level' => 3,
    'pid' => '420700',
  ),
  420800 => 
  array (
    'id' => '420800',
    'name' => '荆门市',
    'level' => 2,
    'pid' => '420000',
  ),
  420801 => 
  array (
    'id' => '420801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420800',
  ),
  420802 => 
  array (
    'id' => '420802',
    'name' => '东宝区',
    'level' => 3,
    'pid' => '420800',
  ),
  420804 => 
  array (
    'id' => '420804',
    'name' => '掇刀区',
    'level' => 3,
    'pid' => '420800',
  ),
  420821 => 
  array (
    'id' => '420821',
    'name' => '京山县',
    'level' => 3,
    'pid' => '420800',
  ),
  420822 => 
  array (
    'id' => '420822',
    'name' => '沙洋县',
    'level' => 3,
    'pid' => '420800',
  ),
  420881 => 
  array (
    'id' => '420881',
    'name' => '钟祥市',
    'level' => 3,
    'pid' => '420800',
  ),
  420900 => 
  array (
    'id' => '420900',
    'name' => '孝感市',
    'level' => 2,
    'pid' => '420000',
  ),
  420901 => 
  array (
    'id' => '420901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '420900',
  ),
  420902 => 
  array (
    'id' => '420902',
    'name' => '孝南区',
    'level' => 3,
    'pid' => '420900',
  ),
  420921 => 
  array (
    'id' => '420921',
    'name' => '孝昌县',
    'level' => 3,
    'pid' => '420900',
  ),
  420922 => 
  array (
    'id' => '420922',
    'name' => '大悟县',
    'level' => 3,
    'pid' => '420900',
  ),
  420923 => 
  array (
    'id' => '420923',
    'name' => '云梦县',
    'level' => 3,
    'pid' => '420900',
  ),
  420981 => 
  array (
    'id' => '420981',
    'name' => '应城市',
    'level' => 3,
    'pid' => '420900',
  ),
  420982 => 
  array (
    'id' => '420982',
    'name' => '安陆市',
    'level' => 3,
    'pid' => '420900',
  ),
  420984 => 
  array (
    'id' => '420984',
    'name' => '汉川市',
    'level' => 3,
    'pid' => '420900',
  ),
  421000 => 
  array (
    'id' => '421000',
    'name' => '荆州市',
    'level' => 2,
    'pid' => '420000',
  ),
  421001 => 
  array (
    'id' => '421001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '421000',
  ),
  421002 => 
  array (
    'id' => '421002',
    'name' => '沙市区',
    'level' => 3,
    'pid' => '421000',
  ),
  421003 => 
  array (
    'id' => '421003',
    'name' => '荆州区',
    'level' => 3,
    'pid' => '421000',
  ),
  421022 => 
  array (
    'id' => '421022',
    'name' => '公安县',
    'level' => 3,
    'pid' => '421000',
  ),
  421023 => 
  array (
    'id' => '421023',
    'name' => '监利县',
    'level' => 3,
    'pid' => '421000',
  ),
  421024 => 
  array (
    'id' => '421024',
    'name' => '江陵县',
    'level' => 3,
    'pid' => '421000',
  ),
  421081 => 
  array (
    'id' => '421081',
    'name' => '石首市',
    'level' => 3,
    'pid' => '421000',
  ),
  421083 => 
  array (
    'id' => '421083',
    'name' => '洪湖市',
    'level' => 3,
    'pid' => '421000',
  ),
  421087 => 
  array (
    'id' => '421087',
    'name' => '松滋市',
    'level' => 3,
    'pid' => '421000',
  ),
  421100 => 
  array (
    'id' => '421100',
    'name' => '黄冈市',
    'level' => 2,
    'pid' => '420000',
  ),
  421101 => 
  array (
    'id' => '421101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '421100',
  ),
  421102 => 
  array (
    'id' => '421102',
    'name' => '黄州区',
    'level' => 3,
    'pid' => '421100',
  ),
  421121 => 
  array (
    'id' => '421121',
    'name' => '团风县',
    'level' => 3,
    'pid' => '421100',
  ),
  421122 => 
  array (
    'id' => '421122',
    'name' => '红安县',
    'level' => 3,
    'pid' => '421100',
  ),
  421123 => 
  array (
    'id' => '421123',
    'name' => '罗田县',
    'level' => 3,
    'pid' => '421100',
  ),
  421124 => 
  array (
    'id' => '421124',
    'name' => '英山县',
    'level' => 3,
    'pid' => '421100',
  ),
  421125 => 
  array (
    'id' => '421125',
    'name' => '浠水县',
    'level' => 3,
    'pid' => '421100',
  ),
  421126 => 
  array (
    'id' => '421126',
    'name' => '蕲春县',
    'level' => 3,
    'pid' => '421100',
  ),
  421127 => 
  array (
    'id' => '421127',
    'name' => '黄梅县',
    'level' => 3,
    'pid' => '421100',
  ),
  421181 => 
  array (
    'id' => '421181',
    'name' => '麻城市',
    'level' => 3,
    'pid' => '421100',
  ),
  421182 => 
  array (
    'id' => '421182',
    'name' => '武穴市',
    'level' => 3,
    'pid' => '421100',
  ),
  421200 => 
  array (
    'id' => '421200',
    'name' => '咸宁市',
    'level' => 2,
    'pid' => '420000',
  ),
  421201 => 
  array (
    'id' => '421201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '421200',
  ),
  421202 => 
  array (
    'id' => '421202',
    'name' => '咸安区',
    'level' => 3,
    'pid' => '421200',
  ),
  421221 => 
  array (
    'id' => '421221',
    'name' => '嘉鱼县',
    'level' => 3,
    'pid' => '421200',
  ),
  421222 => 
  array (
    'id' => '421222',
    'name' => '通城县',
    'level' => 3,
    'pid' => '421200',
  ),
  421223 => 
  array (
    'id' => '421223',
    'name' => '崇阳县',
    'level' => 3,
    'pid' => '421200',
  ),
  421224 => 
  array (
    'id' => '421224',
    'name' => '通山县',
    'level' => 3,
    'pid' => '421200',
  ),
  421281 => 
  array (
    'id' => '421281',
    'name' => '赤壁市',
    'level' => 3,
    'pid' => '421200',
  ),
  421300 => 
  array (
    'id' => '421300',
    'name' => '随州市',
    'level' => 2,
    'pid' => '420000',
  ),
  421301 => 
  array (
    'id' => '421301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '421300',
  ),
  421303 => 
  array (
    'id' => '421303',
    'name' => '曾都区',
    'level' => 3,
    'pid' => '421300',
  ),
  421321 => 
  array (
    'id' => '421321',
    'name' => '随县',
    'level' => 3,
    'pid' => '421300',
  ),
  421381 => 
  array (
    'id' => '421381',
    'name' => '广水市',
    'level' => 3,
    'pid' => '421300',
  ),
  422800 => 
  array (
    'id' => '422800',
    'name' => '恩施土家族苗族自治州',
    'level' => 2,
    'pid' => '420000',
  ),
  422801 => 
  array (
    'id' => '422801',
    'name' => '恩施市',
    'level' => 3,
    'pid' => '422800',
  ),
  422802 => 
  array (
    'id' => '422802',
    'name' => '利川市',
    'level' => 3,
    'pid' => '422800',
  ),
  422822 => 
  array (
    'id' => '422822',
    'name' => '建始县',
    'level' => 3,
    'pid' => '422800',
  ),
  422823 => 
  array (
    'id' => '422823',
    'name' => '巴东县',
    'level' => 3,
    'pid' => '422800',
  ),
  422825 => 
  array (
    'id' => '422825',
    'name' => '宣恩县',
    'level' => 3,
    'pid' => '422800',
  ),
  422826 => 
  array (
    'id' => '422826',
    'name' => '咸丰县',
    'level' => 3,
    'pid' => '422800',
  ),
  422827 => 
  array (
    'id' => '422827',
    'name' => '来凤县',
    'level' => 3,
    'pid' => '422800',
  ),
  422828 => 
  array (
    'id' => '422828',
    'name' => '鹤峰县',
    'level' => 3,
    'pid' => '422800',
  ),
  429000 => 
  array (
    'id' => '429000',
    'name' => '省直辖县级行政区划',
    'level' => 2,
    'pid' => '420000',
  ),
  429004 => 
  array (
    'id' => '429004',
    'name' => '仙桃市',
    'level' => 3,
    'pid' => '429000',
  ),
  429005 => 
  array (
    'id' => '429005',
    'name' => '潜江市',
    'level' => 3,
    'pid' => '429000',
  ),
  429006 => 
  array (
    'id' => '429006',
    'name' => '天门市',
    'level' => 3,
    'pid' => '429000',
  ),
  429021 => 
  array (
    'id' => '429021',
    'name' => '神农架林区',
    'level' => 3,
    'pid' => '429000',
  ),
  430000 => 
  array (
    'id' => '430000',
    'name' => '湖南省',
    'level' => 1,
    'pid' => 0,
  ),
  430100 => 
  array (
    'id' => '430100',
    'name' => '长沙市',
    'level' => 2,
    'pid' => '430000',
  ),
  430101 => 
  array (
    'id' => '430101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430100',
  ),
  430102 => 
  array (
    'id' => '430102',
    'name' => '芙蓉区',
    'level' => 3,
    'pid' => '430100',
  ),
  430103 => 
  array (
    'id' => '430103',
    'name' => '天心区',
    'level' => 3,
    'pid' => '430100',
  ),
  430104 => 
  array (
    'id' => '430104',
    'name' => '岳麓区',
    'level' => 3,
    'pid' => '430100',
  ),
  430105 => 
  array (
    'id' => '430105',
    'name' => '开福区',
    'level' => 3,
    'pid' => '430100',
  ),
  430111 => 
  array (
    'id' => '430111',
    'name' => '雨花区',
    'level' => 3,
    'pid' => '430100',
  ),
  430112 => 
  array (
    'id' => '430112',
    'name' => '望城区',
    'level' => 3,
    'pid' => '430100',
  ),
  430121 => 
  array (
    'id' => '430121',
    'name' => '长沙县',
    'level' => 3,
    'pid' => '430100',
  ),
  430124 => 
  array (
    'id' => '430124',
    'name' => '宁乡县',
    'level' => 3,
    'pid' => '430100',
  ),
  430181 => 
  array (
    'id' => '430181',
    'name' => '浏阳市',
    'level' => 3,
    'pid' => '430100',
  ),
  430200 => 
  array (
    'id' => '430200',
    'name' => '株洲市',
    'level' => 2,
    'pid' => '430000',
  ),
  430201 => 
  array (
    'id' => '430201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430200',
  ),
  430202 => 
  array (
    'id' => '430202',
    'name' => '荷塘区',
    'level' => 3,
    'pid' => '430200',
  ),
  430203 => 
  array (
    'id' => '430203',
    'name' => '芦淞区',
    'level' => 3,
    'pid' => '430200',
  ),
  430204 => 
  array (
    'id' => '430204',
    'name' => '石峰区',
    'level' => 3,
    'pid' => '430200',
  ),
  430211 => 
  array (
    'id' => '430211',
    'name' => '天元区',
    'level' => 3,
    'pid' => '430200',
  ),
  430221 => 
  array (
    'id' => '430221',
    'name' => '株洲县',
    'level' => 3,
    'pid' => '430200',
  ),
  430223 => 
  array (
    'id' => '430223',
    'name' => '攸县',
    'level' => 3,
    'pid' => '430200',
  ),
  430224 => 
  array (
    'id' => '430224',
    'name' => '茶陵县',
    'level' => 3,
    'pid' => '430200',
  ),
  430225 => 
  array (
    'id' => '430225',
    'name' => '炎陵县',
    'level' => 3,
    'pid' => '430200',
  ),
  430281 => 
  array (
    'id' => '430281',
    'name' => '醴陵市',
    'level' => 3,
    'pid' => '430200',
  ),
  430300 => 
  array (
    'id' => '430300',
    'name' => '湘潭市',
    'level' => 2,
    'pid' => '430000',
  ),
  430301 => 
  array (
    'id' => '430301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430300',
  ),
  430302 => 
  array (
    'id' => '430302',
    'name' => '雨湖区',
    'level' => 3,
    'pid' => '430300',
  ),
  430304 => 
  array (
    'id' => '430304',
    'name' => '岳塘区',
    'level' => 3,
    'pid' => '430300',
  ),
  430321 => 
  array (
    'id' => '430321',
    'name' => '湘潭县',
    'level' => 3,
    'pid' => '430300',
  ),
  430381 => 
  array (
    'id' => '430381',
    'name' => '湘乡市',
    'level' => 3,
    'pid' => '430300',
  ),
  430382 => 
  array (
    'id' => '430382',
    'name' => '韶山市',
    'level' => 3,
    'pid' => '430300',
  ),
  430400 => 
  array (
    'id' => '430400',
    'name' => '衡阳市',
    'level' => 2,
    'pid' => '430000',
  ),
  430401 => 
  array (
    'id' => '430401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430400',
  ),
  430405 => 
  array (
    'id' => '430405',
    'name' => '珠晖区',
    'level' => 3,
    'pid' => '430400',
  ),
  430406 => 
  array (
    'id' => '430406',
    'name' => '雁峰区',
    'level' => 3,
    'pid' => '430400',
  ),
  430407 => 
  array (
    'id' => '430407',
    'name' => '石鼓区',
    'level' => 3,
    'pid' => '430400',
  ),
  430408 => 
  array (
    'id' => '430408',
    'name' => '蒸湘区',
    'level' => 3,
    'pid' => '430400',
  ),
  430412 => 
  array (
    'id' => '430412',
    'name' => '南岳区',
    'level' => 3,
    'pid' => '430400',
  ),
  430421 => 
  array (
    'id' => '430421',
    'name' => '衡阳县',
    'level' => 3,
    'pid' => '430400',
  ),
  430422 => 
  array (
    'id' => '430422',
    'name' => '衡南县',
    'level' => 3,
    'pid' => '430400',
  ),
  430423 => 
  array (
    'id' => '430423',
    'name' => '衡山县',
    'level' => 3,
    'pid' => '430400',
  ),
  430424 => 
  array (
    'id' => '430424',
    'name' => '衡东县',
    'level' => 3,
    'pid' => '430400',
  ),
  430426 => 
  array (
    'id' => '430426',
    'name' => '祁东县',
    'level' => 3,
    'pid' => '430400',
  ),
  430481 => 
  array (
    'id' => '430481',
    'name' => '耒阳市',
    'level' => 3,
    'pid' => '430400',
  ),
  430482 => 
  array (
    'id' => '430482',
    'name' => '常宁市',
    'level' => 3,
    'pid' => '430400',
  ),
  430500 => 
  array (
    'id' => '430500',
    'name' => '邵阳市',
    'level' => 2,
    'pid' => '430000',
  ),
  430501 => 
  array (
    'id' => '430501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430500',
  ),
  430502 => 
  array (
    'id' => '430502',
    'name' => '双清区',
    'level' => 3,
    'pid' => '430500',
  ),
  430503 => 
  array (
    'id' => '430503',
    'name' => '大祥区',
    'level' => 3,
    'pid' => '430500',
  ),
  430511 => 
  array (
    'id' => '430511',
    'name' => '北塔区',
    'level' => 3,
    'pid' => '430500',
  ),
  430521 => 
  array (
    'id' => '430521',
    'name' => '邵东县',
    'level' => 3,
    'pid' => '430500',
  ),
  430522 => 
  array (
    'id' => '430522',
    'name' => '新邵县',
    'level' => 3,
    'pid' => '430500',
  ),
  430523 => 
  array (
    'id' => '430523',
    'name' => '邵阳县',
    'level' => 3,
    'pid' => '430500',
  ),
  430524 => 
  array (
    'id' => '430524',
    'name' => '隆回县',
    'level' => 3,
    'pid' => '430500',
  ),
  430525 => 
  array (
    'id' => '430525',
    'name' => '洞口县',
    'level' => 3,
    'pid' => '430500',
  ),
  430527 => 
  array (
    'id' => '430527',
    'name' => '绥宁县',
    'level' => 3,
    'pid' => '430500',
  ),
  430528 => 
  array (
    'id' => '430528',
    'name' => '新宁县',
    'level' => 3,
    'pid' => '430500',
  ),
  430529 => 
  array (
    'id' => '430529',
    'name' => '城步苗族自治县',
    'level' => 3,
    'pid' => '430500',
  ),
  430581 => 
  array (
    'id' => '430581',
    'name' => '武冈市',
    'level' => 3,
    'pid' => '430500',
  ),
  430600 => 
  array (
    'id' => '430600',
    'name' => '岳阳市',
    'level' => 2,
    'pid' => '430000',
  ),
  430601 => 
  array (
    'id' => '430601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430600',
  ),
  430602 => 
  array (
    'id' => '430602',
    'name' => '岳阳楼区',
    'level' => 3,
    'pid' => '430600',
  ),
  430603 => 
  array (
    'id' => '430603',
    'name' => '云溪区',
    'level' => 3,
    'pid' => '430600',
  ),
  430611 => 
  array (
    'id' => '430611',
    'name' => '君山区',
    'level' => 3,
    'pid' => '430600',
  ),
  430621 => 
  array (
    'id' => '430621',
    'name' => '岳阳县',
    'level' => 3,
    'pid' => '430600',
  ),
  430623 => 
  array (
    'id' => '430623',
    'name' => '华容县',
    'level' => 3,
    'pid' => '430600',
  ),
  430624 => 
  array (
    'id' => '430624',
    'name' => '湘阴县',
    'level' => 3,
    'pid' => '430600',
  ),
  430626 => 
  array (
    'id' => '430626',
    'name' => '平江县',
    'level' => 3,
    'pid' => '430600',
  ),
  430681 => 
  array (
    'id' => '430681',
    'name' => '汨罗市',
    'level' => 3,
    'pid' => '430600',
  ),
  430682 => 
  array (
    'id' => '430682',
    'name' => '临湘市',
    'level' => 3,
    'pid' => '430600',
  ),
  430700 => 
  array (
    'id' => '430700',
    'name' => '常德市',
    'level' => 2,
    'pid' => '430000',
  ),
  430701 => 
  array (
    'id' => '430701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430700',
  ),
  430702 => 
  array (
    'id' => '430702',
    'name' => '武陵区',
    'level' => 3,
    'pid' => '430700',
  ),
  430703 => 
  array (
    'id' => '430703',
    'name' => '鼎城区',
    'level' => 3,
    'pid' => '430700',
  ),
  430721 => 
  array (
    'id' => '430721',
    'name' => '安乡县',
    'level' => 3,
    'pid' => '430700',
  ),
  430722 => 
  array (
    'id' => '430722',
    'name' => '汉寿县',
    'level' => 3,
    'pid' => '430700',
  ),
  430723 => 
  array (
    'id' => '430723',
    'name' => '澧县',
    'level' => 3,
    'pid' => '430700',
  ),
  430724 => 
  array (
    'id' => '430724',
    'name' => '临澧县',
    'level' => 3,
    'pid' => '430700',
  ),
  430725 => 
  array (
    'id' => '430725',
    'name' => '桃源县',
    'level' => 3,
    'pid' => '430700',
  ),
  430726 => 
  array (
    'id' => '430726',
    'name' => '石门县',
    'level' => 3,
    'pid' => '430700',
  ),
  430781 => 
  array (
    'id' => '430781',
    'name' => '津市市',
    'level' => 3,
    'pid' => '430700',
  ),
  430800 => 
  array (
    'id' => '430800',
    'name' => '张家界市',
    'level' => 2,
    'pid' => '430000',
  ),
  430801 => 
  array (
    'id' => '430801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430800',
  ),
  430802 => 
  array (
    'id' => '430802',
    'name' => '永定区',
    'level' => 3,
    'pid' => '430800',
  ),
  430811 => 
  array (
    'id' => '430811',
    'name' => '武陵源区',
    'level' => 3,
    'pid' => '430800',
  ),
  430821 => 
  array (
    'id' => '430821',
    'name' => '慈利县',
    'level' => 3,
    'pid' => '430800',
  ),
  430822 => 
  array (
    'id' => '430822',
    'name' => '桑植县',
    'level' => 3,
    'pid' => '430800',
  ),
  430900 => 
  array (
    'id' => '430900',
    'name' => '益阳市',
    'level' => 2,
    'pid' => '430000',
  ),
  430901 => 
  array (
    'id' => '430901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '430900',
  ),
  430902 => 
  array (
    'id' => '430902',
    'name' => '资阳区',
    'level' => 3,
    'pid' => '430900',
  ),
  430903 => 
  array (
    'id' => '430903',
    'name' => '赫山区',
    'level' => 3,
    'pid' => '430900',
  ),
  430921 => 
  array (
    'id' => '430921',
    'name' => '南县',
    'level' => 3,
    'pid' => '430900',
  ),
  430922 => 
  array (
    'id' => '430922',
    'name' => '桃江县',
    'level' => 3,
    'pid' => '430900',
  ),
  430923 => 
  array (
    'id' => '430923',
    'name' => '安化县',
    'level' => 3,
    'pid' => '430900',
  ),
  430981 => 
  array (
    'id' => '430981',
    'name' => '沅江市',
    'level' => 3,
    'pid' => '430900',
  ),
  431000 => 
  array (
    'id' => '431000',
    'name' => '郴州市',
    'level' => 2,
    'pid' => '430000',
  ),
  431001 => 
  array (
    'id' => '431001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '431000',
  ),
  431002 => 
  array (
    'id' => '431002',
    'name' => '北湖区',
    'level' => 3,
    'pid' => '431000',
  ),
  431003 => 
  array (
    'id' => '431003',
    'name' => '苏仙区',
    'level' => 3,
    'pid' => '431000',
  ),
  431021 => 
  array (
    'id' => '431021',
    'name' => '桂阳县',
    'level' => 3,
    'pid' => '431000',
  ),
  431022 => 
  array (
    'id' => '431022',
    'name' => '宜章县',
    'level' => 3,
    'pid' => '431000',
  ),
  431023 => 
  array (
    'id' => '431023',
    'name' => '永兴县',
    'level' => 3,
    'pid' => '431000',
  ),
  431024 => 
  array (
    'id' => '431024',
    'name' => '嘉禾县',
    'level' => 3,
    'pid' => '431000',
  ),
  431025 => 
  array (
    'id' => '431025',
    'name' => '临武县',
    'level' => 3,
    'pid' => '431000',
  ),
  431026 => 
  array (
    'id' => '431026',
    'name' => '汝城县',
    'level' => 3,
    'pid' => '431000',
  ),
  431027 => 
  array (
    'id' => '431027',
    'name' => '桂东县',
    'level' => 3,
    'pid' => '431000',
  ),
  431028 => 
  array (
    'id' => '431028',
    'name' => '安仁县',
    'level' => 3,
    'pid' => '431000',
  ),
  431081 => 
  array (
    'id' => '431081',
    'name' => '资兴市',
    'level' => 3,
    'pid' => '431000',
  ),
  431100 => 
  array (
    'id' => '431100',
    'name' => '永州市',
    'level' => 2,
    'pid' => '430000',
  ),
  431101 => 
  array (
    'id' => '431101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '431100',
  ),
  431102 => 
  array (
    'id' => '431102',
    'name' => '零陵区',
    'level' => 3,
    'pid' => '431100',
  ),
  431103 => 
  array (
    'id' => '431103',
    'name' => '冷水滩区',
    'level' => 3,
    'pid' => '431100',
  ),
  431121 => 
  array (
    'id' => '431121',
    'name' => '祁阳县',
    'level' => 3,
    'pid' => '431100',
  ),
  431122 => 
  array (
    'id' => '431122',
    'name' => '东安县',
    'level' => 3,
    'pid' => '431100',
  ),
  431123 => 
  array (
    'id' => '431123',
    'name' => '双牌县',
    'level' => 3,
    'pid' => '431100',
  ),
  431124 => 
  array (
    'id' => '431124',
    'name' => '道县',
    'level' => 3,
    'pid' => '431100',
  ),
  431125 => 
  array (
    'id' => '431125',
    'name' => '江永县',
    'level' => 3,
    'pid' => '431100',
  ),
  431126 => 
  array (
    'id' => '431126',
    'name' => '宁远县',
    'level' => 3,
    'pid' => '431100',
  ),
  431127 => 
  array (
    'id' => '431127',
    'name' => '蓝山县',
    'level' => 3,
    'pid' => '431100',
  ),
  431128 => 
  array (
    'id' => '431128',
    'name' => '新田县',
    'level' => 3,
    'pid' => '431100',
  ),
  431129 => 
  array (
    'id' => '431129',
    'name' => '江华瑶族自治县',
    'level' => 3,
    'pid' => '431100',
  ),
  431200 => 
  array (
    'id' => '431200',
    'name' => '怀化市',
    'level' => 2,
    'pid' => '430000',
  ),
  431201 => 
  array (
    'id' => '431201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '431200',
  ),
  431202 => 
  array (
    'id' => '431202',
    'name' => '鹤城区',
    'level' => 3,
    'pid' => '431200',
  ),
  431221 => 
  array (
    'id' => '431221',
    'name' => '中方县',
    'level' => 3,
    'pid' => '431200',
  ),
  431222 => 
  array (
    'id' => '431222',
    'name' => '沅陵县',
    'level' => 3,
    'pid' => '431200',
  ),
  431223 => 
  array (
    'id' => '431223',
    'name' => '辰溪县',
    'level' => 3,
    'pid' => '431200',
  ),
  431224 => 
  array (
    'id' => '431224',
    'name' => '溆浦县',
    'level' => 3,
    'pid' => '431200',
  ),
  431225 => 
  array (
    'id' => '431225',
    'name' => '会同县',
    'level' => 3,
    'pid' => '431200',
  ),
  431226 => 
  array (
    'id' => '431226',
    'name' => '麻阳苗族自治县',
    'level' => 3,
    'pid' => '431200',
  ),
  431227 => 
  array (
    'id' => '431227',
    'name' => '新晃侗族自治县',
    'level' => 3,
    'pid' => '431200',
  ),
  431228 => 
  array (
    'id' => '431228',
    'name' => '芷江侗族自治县',
    'level' => 3,
    'pid' => '431200',
  ),
  431229 => 
  array (
    'id' => '431229',
    'name' => '靖州苗族侗族自治县',
    'level' => 3,
    'pid' => '431200',
  ),
  431230 => 
  array (
    'id' => '431230',
    'name' => '通道侗族自治县',
    'level' => 3,
    'pid' => '431200',
  ),
  431281 => 
  array (
    'id' => '431281',
    'name' => '洪江市',
    'level' => 3,
    'pid' => '431200',
  ),
  431300 => 
  array (
    'id' => '431300',
    'name' => '娄底市',
    'level' => 2,
    'pid' => '430000',
  ),
  431301 => 
  array (
    'id' => '431301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '431300',
  ),
  431302 => 
  array (
    'id' => '431302',
    'name' => '娄星区',
    'level' => 3,
    'pid' => '431300',
  ),
  431321 => 
  array (
    'id' => '431321',
    'name' => '双峰县',
    'level' => 3,
    'pid' => '431300',
  ),
  431322 => 
  array (
    'id' => '431322',
    'name' => '新化县',
    'level' => 3,
    'pid' => '431300',
  ),
  431381 => 
  array (
    'id' => '431381',
    'name' => '冷水江市',
    'level' => 3,
    'pid' => '431300',
  ),
  431382 => 
  array (
    'id' => '431382',
    'name' => '涟源市',
    'level' => 3,
    'pid' => '431300',
  ),
  433100 => 
  array (
    'id' => '433100',
    'name' => '湘西土家族苗族自治州',
    'level' => 2,
    'pid' => '430000',
  ),
  433101 => 
  array (
    'id' => '433101',
    'name' => '吉首市',
    'level' => 3,
    'pid' => '433100',
  ),
  433122 => 
  array (
    'id' => '433122',
    'name' => '泸溪县',
    'level' => 3,
    'pid' => '433100',
  ),
  433123 => 
  array (
    'id' => '433123',
    'name' => '凤凰县',
    'level' => 3,
    'pid' => '433100',
  ),
  433124 => 
  array (
    'id' => '433124',
    'name' => '花垣县',
    'level' => 3,
    'pid' => '433100',
  ),
  433125 => 
  array (
    'id' => '433125',
    'name' => '保靖县',
    'level' => 3,
    'pid' => '433100',
  ),
  433126 => 
  array (
    'id' => '433126',
    'name' => '古丈县',
    'level' => 3,
    'pid' => '433100',
  ),
  433127 => 
  array (
    'id' => '433127',
    'name' => '永顺县',
    'level' => 3,
    'pid' => '433100',
  ),
  433130 => 
  array (
    'id' => '433130',
    'name' => '龙山县',
    'level' => 3,
    'pid' => '433100',
  ),
  440000 => 
  array (
    'id' => '440000',
    'name' => '广东省',
    'level' => 1,
    'pid' => 0,
  ),
  440100 => 
  array (
    'id' => '440100',
    'name' => '广州市',
    'level' => 2,
    'pid' => '440000',
  ),
  440101 => 
  array (
    'id' => '440101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440100',
  ),
  440103 => 
  array (
    'id' => '440103',
    'name' => '荔湾区',
    'level' => 3,
    'pid' => '440100',
  ),
  440104 => 
  array (
    'id' => '440104',
    'name' => '越秀区',
    'level' => 3,
    'pid' => '440100',
  ),
  440105 => 
  array (
    'id' => '440105',
    'name' => '海珠区',
    'level' => 3,
    'pid' => '440100',
  ),
  440106 => 
  array (
    'id' => '440106',
    'name' => '天河区',
    'level' => 3,
    'pid' => '440100',
  ),
  440111 => 
  array (
    'id' => '440111',
    'name' => '白云区',
    'level' => 3,
    'pid' => '440100',
  ),
  440112 => 
  array (
    'id' => '440112',
    'name' => '黄埔区',
    'level' => 3,
    'pid' => '440100',
  ),
  440113 => 
  array (
    'id' => '440113',
    'name' => '番禺区',
    'level' => 3,
    'pid' => '440100',
  ),
  440114 => 
  array (
    'id' => '440114',
    'name' => '花都区',
    'level' => 3,
    'pid' => '440100',
  ),
  440115 => 
  array (
    'id' => '440115',
    'name' => '南沙区',
    'level' => 3,
    'pid' => '440100',
  ),
  440117 => 
  array (
    'id' => '440117',
    'name' => '从化区',
    'level' => 3,
    'pid' => '440100',
  ),
  440118 => 
  array (
    'id' => '440118',
    'name' => '增城区',
    'level' => 3,
    'pid' => '440100',
  ),
  440200 => 
  array (
    'id' => '440200',
    'name' => '韶关市',
    'level' => 2,
    'pid' => '440000',
  ),
  440201 => 
  array (
    'id' => '440201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440200',
  ),
  440203 => 
  array (
    'id' => '440203',
    'name' => '武江区',
    'level' => 3,
    'pid' => '440200',
  ),
  440204 => 
  array (
    'id' => '440204',
    'name' => '浈江区',
    'level' => 3,
    'pid' => '440200',
  ),
  440205 => 
  array (
    'id' => '440205',
    'name' => '曲江区',
    'level' => 3,
    'pid' => '440200',
  ),
  440222 => 
  array (
    'id' => '440222',
    'name' => '始兴县',
    'level' => 3,
    'pid' => '440200',
  ),
  440224 => 
  array (
    'id' => '440224',
    'name' => '仁化县',
    'level' => 3,
    'pid' => '440200',
  ),
  440229 => 
  array (
    'id' => '440229',
    'name' => '翁源县',
    'level' => 3,
    'pid' => '440200',
  ),
  440232 => 
  array (
    'id' => '440232',
    'name' => '乳源瑶族自治县',
    'level' => 3,
    'pid' => '440200',
  ),
  440233 => 
  array (
    'id' => '440233',
    'name' => '新丰县',
    'level' => 3,
    'pid' => '440200',
  ),
  440281 => 
  array (
    'id' => '440281',
    'name' => '乐昌市',
    'level' => 3,
    'pid' => '440200',
  ),
  440282 => 
  array (
    'id' => '440282',
    'name' => '南雄市',
    'level' => 3,
    'pid' => '440200',
  ),
  440300 => 
  array (
    'id' => '440300',
    'name' => '深圳市',
    'level' => 2,
    'pid' => '440000',
  ),
  440301 => 
  array (
    'id' => '440301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440300',
  ),
  440303 => 
  array (
    'id' => '440303',
    'name' => '罗湖区',
    'level' => 3,
    'pid' => '440300',
  ),
  440304 => 
  array (
    'id' => '440304',
    'name' => '福田区',
    'level' => 3,
    'pid' => '440300',
  ),
  440305 => 
  array (
    'id' => '440305',
    'name' => '南山区',
    'level' => 3,
    'pid' => '440300',
  ),
  440306 => 
  array (
    'id' => '440306',
    'name' => '宝安区',
    'level' => 3,
    'pid' => '440300',
  ),
  440307 => 
  array (
    'id' => '440307',
    'name' => '龙岗区',
    'level' => 3,
    'pid' => '440300',
  ),
  440308 => 
  array (
    'id' => '440308',
    'name' => '盐田区',
    'level' => 3,
    'pid' => '440300',
  ),
  440400 => 
  array (
    'id' => '440400',
    'name' => '珠海市',
    'level' => 2,
    'pid' => '440000',
  ),
  440401 => 
  array (
    'id' => '440401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440400',
  ),
  440402 => 
  array (
    'id' => '440402',
    'name' => '香洲区',
    'level' => 3,
    'pid' => '440400',
  ),
  440403 => 
  array (
    'id' => '440403',
    'name' => '斗门区',
    'level' => 3,
    'pid' => '440400',
  ),
  440404 => 
  array (
    'id' => '440404',
    'name' => '金湾区',
    'level' => 3,
    'pid' => '440400',
  ),
  440500 => 
  array (
    'id' => '440500',
    'name' => '汕头市',
    'level' => 2,
    'pid' => '440000',
  ),
  440501 => 
  array (
    'id' => '440501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440500',
  ),
  440507 => 
  array (
    'id' => '440507',
    'name' => '龙湖区',
    'level' => 3,
    'pid' => '440500',
  ),
  440511 => 
  array (
    'id' => '440511',
    'name' => '金平区',
    'level' => 3,
    'pid' => '440500',
  ),
  440512 => 
  array (
    'id' => '440512',
    'name' => '濠江区',
    'level' => 3,
    'pid' => '440500',
  ),
  440513 => 
  array (
    'id' => '440513',
    'name' => '潮阳区',
    'level' => 3,
    'pid' => '440500',
  ),
  440514 => 
  array (
    'id' => '440514',
    'name' => '潮南区',
    'level' => 3,
    'pid' => '440500',
  ),
  440515 => 
  array (
    'id' => '440515',
    'name' => '澄海区',
    'level' => 3,
    'pid' => '440500',
  ),
  440523 => 
  array (
    'id' => '440523',
    'name' => '南澳县',
    'level' => 3,
    'pid' => '440500',
  ),
  440600 => 
  array (
    'id' => '440600',
    'name' => '佛山市',
    'level' => 2,
    'pid' => '440000',
  ),
  440601 => 
  array (
    'id' => '440601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440600',
  ),
  440604 => 
  array (
    'id' => '440604',
    'name' => '禅城区',
    'level' => 3,
    'pid' => '440600',
  ),
  440605 => 
  array (
    'id' => '440605',
    'name' => '南海区',
    'level' => 3,
    'pid' => '440600',
  ),
  440606 => 
  array (
    'id' => '440606',
    'name' => '顺德区',
    'level' => 3,
    'pid' => '440600',
  ),
  440607 => 
  array (
    'id' => '440607',
    'name' => '三水区',
    'level' => 3,
    'pid' => '440600',
  ),
  440608 => 
  array (
    'id' => '440608',
    'name' => '高明区',
    'level' => 3,
    'pid' => '440600',
  ),
  440700 => 
  array (
    'id' => '440700',
    'name' => '江门市',
    'level' => 2,
    'pid' => '440000',
  ),
  440701 => 
  array (
    'id' => '440701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440700',
  ),
  440703 => 
  array (
    'id' => '440703',
    'name' => '蓬江区',
    'level' => 3,
    'pid' => '440700',
  ),
  440704 => 
  array (
    'id' => '440704',
    'name' => '江海区',
    'level' => 3,
    'pid' => '440700',
  ),
  440705 => 
  array (
    'id' => '440705',
    'name' => '新会区',
    'level' => 3,
    'pid' => '440700',
  ),
  440781 => 
  array (
    'id' => '440781',
    'name' => '台山市',
    'level' => 3,
    'pid' => '440700',
  ),
  440783 => 
  array (
    'id' => '440783',
    'name' => '开平市',
    'level' => 3,
    'pid' => '440700',
  ),
  440784 => 
  array (
    'id' => '440784',
    'name' => '鹤山市',
    'level' => 3,
    'pid' => '440700',
  ),
  440785 => 
  array (
    'id' => '440785',
    'name' => '恩平市',
    'level' => 3,
    'pid' => '440700',
  ),
  440800 => 
  array (
    'id' => '440800',
    'name' => '湛江市',
    'level' => 2,
    'pid' => '440000',
  ),
  440801 => 
  array (
    'id' => '440801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440800',
  ),
  440802 => 
  array (
    'id' => '440802',
    'name' => '赤坎区',
    'level' => 3,
    'pid' => '440800',
  ),
  440803 => 
  array (
    'id' => '440803',
    'name' => '霞山区',
    'level' => 3,
    'pid' => '440800',
  ),
  440804 => 
  array (
    'id' => '440804',
    'name' => '坡头区',
    'level' => 3,
    'pid' => '440800',
  ),
  440811 => 
  array (
    'id' => '440811',
    'name' => '麻章区',
    'level' => 3,
    'pid' => '440800',
  ),
  440823 => 
  array (
    'id' => '440823',
    'name' => '遂溪县',
    'level' => 3,
    'pid' => '440800',
  ),
  440825 => 
  array (
    'id' => '440825',
    'name' => '徐闻县',
    'level' => 3,
    'pid' => '440800',
  ),
  440881 => 
  array (
    'id' => '440881',
    'name' => '廉江市',
    'level' => 3,
    'pid' => '440800',
  ),
  440882 => 
  array (
    'id' => '440882',
    'name' => '雷州市',
    'level' => 3,
    'pid' => '440800',
  ),
  440883 => 
  array (
    'id' => '440883',
    'name' => '吴川市',
    'level' => 3,
    'pid' => '440800',
  ),
  440900 => 
  array (
    'id' => '440900',
    'name' => '茂名市',
    'level' => 2,
    'pid' => '440000',
  ),
  440901 => 
  array (
    'id' => '440901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '440900',
  ),
  440902 => 
  array (
    'id' => '440902',
    'name' => '茂南区',
    'level' => 3,
    'pid' => '440900',
  ),
  440904 => 
  array (
    'id' => '440904',
    'name' => '电白区',
    'level' => 3,
    'pid' => '440900',
  ),
  440981 => 
  array (
    'id' => '440981',
    'name' => '高州市',
    'level' => 3,
    'pid' => '440900',
  ),
  440982 => 
  array (
    'id' => '440982',
    'name' => '化州市',
    'level' => 3,
    'pid' => '440900',
  ),
  440983 => 
  array (
    'id' => '440983',
    'name' => '信宜市',
    'level' => 3,
    'pid' => '440900',
  ),
  441200 => 
  array (
    'id' => '441200',
    'name' => '肇庆市',
    'level' => 2,
    'pid' => '440000',
  ),
  441201 => 
  array (
    'id' => '441201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441200',
  ),
  441202 => 
  array (
    'id' => '441202',
    'name' => '端州区',
    'level' => 3,
    'pid' => '441200',
  ),
  441203 => 
  array (
    'id' => '441203',
    'name' => '鼎湖区',
    'level' => 3,
    'pid' => '441200',
  ),
  441204 => 
  array (
    'id' => '441204',
    'name' => '高要区',
    'level' => 3,
    'pid' => '441200',
  ),
  441223 => 
  array (
    'id' => '441223',
    'name' => '广宁县',
    'level' => 3,
    'pid' => '441200',
  ),
  441224 => 
  array (
    'id' => '441224',
    'name' => '怀集县',
    'level' => 3,
    'pid' => '441200',
  ),
  441225 => 
  array (
    'id' => '441225',
    'name' => '封开县',
    'level' => 3,
    'pid' => '441200',
  ),
  441226 => 
  array (
    'id' => '441226',
    'name' => '德庆县',
    'level' => 3,
    'pid' => '441200',
  ),
  441284 => 
  array (
    'id' => '441284',
    'name' => '四会市',
    'level' => 3,
    'pid' => '441200',
  ),
  441300 => 
  array (
    'id' => '441300',
    'name' => '惠州市',
    'level' => 2,
    'pid' => '440000',
  ),
  441301 => 
  array (
    'id' => '441301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441300',
  ),
  441302 => 
  array (
    'id' => '441302',
    'name' => '惠城区',
    'level' => 3,
    'pid' => '441300',
  ),
  441303 => 
  array (
    'id' => '441303',
    'name' => '惠阳区',
    'level' => 3,
    'pid' => '441300',
  ),
  441322 => 
  array (
    'id' => '441322',
    'name' => '博罗县',
    'level' => 3,
    'pid' => '441300',
  ),
  441323 => 
  array (
    'id' => '441323',
    'name' => '惠东县',
    'level' => 3,
    'pid' => '441300',
  ),
  441324 => 
  array (
    'id' => '441324',
    'name' => '龙门县',
    'level' => 3,
    'pid' => '441300',
  ),
  441400 => 
  array (
    'id' => '441400',
    'name' => '梅州市',
    'level' => 2,
    'pid' => '440000',
  ),
  441401 => 
  array (
    'id' => '441401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441400',
  ),
  441402 => 
  array (
    'id' => '441402',
    'name' => '梅江区',
    'level' => 3,
    'pid' => '441400',
  ),
  441403 => 
  array (
    'id' => '441403',
    'name' => '梅县区',
    'level' => 3,
    'pid' => '441400',
  ),
  441422 => 
  array (
    'id' => '441422',
    'name' => '大埔县',
    'level' => 3,
    'pid' => '441400',
  ),
  441423 => 
  array (
    'id' => '441423',
    'name' => '丰顺县',
    'level' => 3,
    'pid' => '441400',
  ),
  441424 => 
  array (
    'id' => '441424',
    'name' => '五华县',
    'level' => 3,
    'pid' => '441400',
  ),
  441426 => 
  array (
    'id' => '441426',
    'name' => '平远县',
    'level' => 3,
    'pid' => '441400',
  ),
  441427 => 
  array (
    'id' => '441427',
    'name' => '蕉岭县',
    'level' => 3,
    'pid' => '441400',
  ),
  441481 => 
  array (
    'id' => '441481',
    'name' => '兴宁市',
    'level' => 3,
    'pid' => '441400',
  ),
  441500 => 
  array (
    'id' => '441500',
    'name' => '汕尾市',
    'level' => 2,
    'pid' => '440000',
  ),
  441501 => 
  array (
    'id' => '441501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441500',
  ),
  441502 => 
  array (
    'id' => '441502',
    'name' => '城区',
    'level' => 3,
    'pid' => '441500',
  ),
  441521 => 
  array (
    'id' => '441521',
    'name' => '海丰县',
    'level' => 3,
    'pid' => '441500',
  ),
  441523 => 
  array (
    'id' => '441523',
    'name' => '陆河县',
    'level' => 3,
    'pid' => '441500',
  ),
  441581 => 
  array (
    'id' => '441581',
    'name' => '陆丰市',
    'level' => 3,
    'pid' => '441500',
  ),
  441600 => 
  array (
    'id' => '441600',
    'name' => '河源市',
    'level' => 2,
    'pid' => '440000',
  ),
  441601 => 
  array (
    'id' => '441601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441600',
  ),
  441602 => 
  array (
    'id' => '441602',
    'name' => '源城区',
    'level' => 3,
    'pid' => '441600',
  ),
  441621 => 
  array (
    'id' => '441621',
    'name' => '紫金县',
    'level' => 3,
    'pid' => '441600',
  ),
  441622 => 
  array (
    'id' => '441622',
    'name' => '龙川县',
    'level' => 3,
    'pid' => '441600',
  ),
  441623 => 
  array (
    'id' => '441623',
    'name' => '连平县',
    'level' => 3,
    'pid' => '441600',
  ),
  441624 => 
  array (
    'id' => '441624',
    'name' => '和平县',
    'level' => 3,
    'pid' => '441600',
  ),
  441625 => 
  array (
    'id' => '441625',
    'name' => '东源县',
    'level' => 3,
    'pid' => '441600',
  ),
  441700 => 
  array (
    'id' => '441700',
    'name' => '阳江市',
    'level' => 2,
    'pid' => '440000',
  ),
  441701 => 
  array (
    'id' => '441701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441700',
  ),
  441702 => 
  array (
    'id' => '441702',
    'name' => '江城区',
    'level' => 3,
    'pid' => '441700',
  ),
  441704 => 
  array (
    'id' => '441704',
    'name' => '阳东区',
    'level' => 3,
    'pid' => '441700',
  ),
  441721 => 
  array (
    'id' => '441721',
    'name' => '阳西县',
    'level' => 3,
    'pid' => '441700',
  ),
  441781 => 
  array (
    'id' => '441781',
    'name' => '阳春市',
    'level' => 3,
    'pid' => '441700',
  ),
  441800 => 
  array (
    'id' => '441800',
    'name' => '清远市',
    'level' => 2,
    'pid' => '440000',
  ),
  441801 => 
  array (
    'id' => '441801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '441800',
  ),
  441802 => 
  array (
    'id' => '441802',
    'name' => '清城区',
    'level' => 3,
    'pid' => '441800',
  ),
  441803 => 
  array (
    'id' => '441803',
    'name' => '清新区',
    'level' => 3,
    'pid' => '441800',
  ),
  441821 => 
  array (
    'id' => '441821',
    'name' => '佛冈县',
    'level' => 3,
    'pid' => '441800',
  ),
  441823 => 
  array (
    'id' => '441823',
    'name' => '阳山县',
    'level' => 3,
    'pid' => '441800',
  ),
  441825 => 
  array (
    'id' => '441825',
    'name' => '连山壮族瑶族自治县',
    'level' => 3,
    'pid' => '441800',
  ),
  441826 => 
  array (
    'id' => '441826',
    'name' => '连南瑶族自治县',
    'level' => 3,
    'pid' => '441800',
  ),
  441881 => 
  array (
    'id' => '441881',
    'name' => '英德市',
    'level' => 3,
    'pid' => '441800',
  ),
  441882 => 
  array (
    'id' => '441882',
    'name' => '连州市',
    'level' => 3,
    'pid' => '441800',
  ),
  441900 => 
  array (
    'id' => '441900',
    'name' => '东莞市',
    'level' => 2,
    'pid' => '440000',
  ),
  442000 => 
  array (
    'id' => '442000',
    'name' => '中山市',
    'level' => 2,
    'pid' => '440000',
  ),
  445100 => 
  array (
    'id' => '445100',
    'name' => '潮州市',
    'level' => 2,
    'pid' => '440000',
  ),
  445101 => 
  array (
    'id' => '445101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '445100',
  ),
  445102 => 
  array (
    'id' => '445102',
    'name' => '湘桥区',
    'level' => 3,
    'pid' => '445100',
  ),
  445103 => 
  array (
    'id' => '445103',
    'name' => '潮安区',
    'level' => 3,
    'pid' => '445100',
  ),
  445122 => 
  array (
    'id' => '445122',
    'name' => '饶平县',
    'level' => 3,
    'pid' => '445100',
  ),
  445200 => 
  array (
    'id' => '445200',
    'name' => '揭阳市',
    'level' => 2,
    'pid' => '440000',
  ),
  445201 => 
  array (
    'id' => '445201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '445200',
  ),
  445202 => 
  array (
    'id' => '445202',
    'name' => '榕城区',
    'level' => 3,
    'pid' => '445200',
  ),
  445203 => 
  array (
    'id' => '445203',
    'name' => '揭东区',
    'level' => 3,
    'pid' => '445200',
  ),
  445222 => 
  array (
    'id' => '445222',
    'name' => '揭西县',
    'level' => 3,
    'pid' => '445200',
  ),
  445224 => 
  array (
    'id' => '445224',
    'name' => '惠来县',
    'level' => 3,
    'pid' => '445200',
  ),
  445281 => 
  array (
    'id' => '445281',
    'name' => '普宁市',
    'level' => 3,
    'pid' => '445200',
  ),
  445300 => 
  array (
    'id' => '445300',
    'name' => '云浮市',
    'level' => 2,
    'pid' => '440000',
  ),
  445301 => 
  array (
    'id' => '445301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '445300',
  ),
  445302 => 
  array (
    'id' => '445302',
    'name' => '云城区',
    'level' => 3,
    'pid' => '445300',
  ),
  445303 => 
  array (
    'id' => '445303',
    'name' => '云安区',
    'level' => 3,
    'pid' => '445300',
  ),
  445321 => 
  array (
    'id' => '445321',
    'name' => '新兴县',
    'level' => 3,
    'pid' => '445300',
  ),
  445322 => 
  array (
    'id' => '445322',
    'name' => '郁南县',
    'level' => 3,
    'pid' => '445300',
  ),
  445381 => 
  array (
    'id' => '445381',
    'name' => '罗定市',
    'level' => 3,
    'pid' => '445300',
  ),
  450000 => 
  array (
    'id' => '450000',
    'name' => '广西壮族自治区',
    'level' => 1,
    'pid' => 0,
  ),
  450100 => 
  array (
    'id' => '450100',
    'name' => '南宁市',
    'level' => 2,
    'pid' => '450000',
  ),
  450101 => 
  array (
    'id' => '450101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450100',
  ),
  450102 => 
  array (
    'id' => '450102',
    'name' => '兴宁区',
    'level' => 3,
    'pid' => '450100',
  ),
  450103 => 
  array (
    'id' => '450103',
    'name' => '青秀区',
    'level' => 3,
    'pid' => '450100',
  ),
  450105 => 
  array (
    'id' => '450105',
    'name' => '江南区',
    'level' => 3,
    'pid' => '450100',
  ),
  450107 => 
  array (
    'id' => '450107',
    'name' => '西乡塘区',
    'level' => 3,
    'pid' => '450100',
  ),
  450108 => 
  array (
    'id' => '450108',
    'name' => '良庆区',
    'level' => 3,
    'pid' => '450100',
  ),
  450109 => 
  array (
    'id' => '450109',
    'name' => '邕宁区',
    'level' => 3,
    'pid' => '450100',
  ),
  450110 => 
  array (
    'id' => '450110',
    'name' => '武鸣区',
    'level' => 3,
    'pid' => '450100',
  ),
  450123 => 
  array (
    'id' => '450123',
    'name' => '隆安县',
    'level' => 3,
    'pid' => '450100',
  ),
  450124 => 
  array (
    'id' => '450124',
    'name' => '马山县',
    'level' => 3,
    'pid' => '450100',
  ),
  450125 => 
  array (
    'id' => '450125',
    'name' => '上林县',
    'level' => 3,
    'pid' => '450100',
  ),
  450126 => 
  array (
    'id' => '450126',
    'name' => '宾阳县',
    'level' => 3,
    'pid' => '450100',
  ),
  450127 => 
  array (
    'id' => '450127',
    'name' => '横县',
    'level' => 3,
    'pid' => '450100',
  ),
  450200 => 
  array (
    'id' => '450200',
    'name' => '柳州市',
    'level' => 2,
    'pid' => '450000',
  ),
  450201 => 
  array (
    'id' => '450201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450200',
  ),
  450202 => 
  array (
    'id' => '450202',
    'name' => '城中区',
    'level' => 3,
    'pid' => '450200',
  ),
  450203 => 
  array (
    'id' => '450203',
    'name' => '鱼峰区',
    'level' => 3,
    'pid' => '450200',
  ),
  450204 => 
  array (
    'id' => '450204',
    'name' => '柳南区',
    'level' => 3,
    'pid' => '450200',
  ),
  450205 => 
  array (
    'id' => '450205',
    'name' => '柳北区',
    'level' => 3,
    'pid' => '450200',
  ),
  450221 => 
  array (
    'id' => '450221',
    'name' => '柳江县',
    'level' => 3,
    'pid' => '450200',
  ),
  450222 => 
  array (
    'id' => '450222',
    'name' => '柳城县',
    'level' => 3,
    'pid' => '450200',
  ),
  450223 => 
  array (
    'id' => '450223',
    'name' => '鹿寨县',
    'level' => 3,
    'pid' => '450200',
  ),
  450224 => 
  array (
    'id' => '450224',
    'name' => '融安县',
    'level' => 3,
    'pid' => '450200',
  ),
  450225 => 
  array (
    'id' => '450225',
    'name' => '融水苗族自治县',
    'level' => 3,
    'pid' => '450200',
  ),
  450226 => 
  array (
    'id' => '450226',
    'name' => '三江侗族自治县',
    'level' => 3,
    'pid' => '450200',
  ),
  450300 => 
  array (
    'id' => '450300',
    'name' => '桂林市',
    'level' => 2,
    'pid' => '450000',
  ),
  450301 => 
  array (
    'id' => '450301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450300',
  ),
  450302 => 
  array (
    'id' => '450302',
    'name' => '秀峰区',
    'level' => 3,
    'pid' => '450300',
  ),
  450303 => 
  array (
    'id' => '450303',
    'name' => '叠彩区',
    'level' => 3,
    'pid' => '450300',
  ),
  450304 => 
  array (
    'id' => '450304',
    'name' => '象山区',
    'level' => 3,
    'pid' => '450300',
  ),
  450305 => 
  array (
    'id' => '450305',
    'name' => '七星区',
    'level' => 3,
    'pid' => '450300',
  ),
  450311 => 
  array (
    'id' => '450311',
    'name' => '雁山区',
    'level' => 3,
    'pid' => '450300',
  ),
  450312 => 
  array (
    'id' => '450312',
    'name' => '临桂区',
    'level' => 3,
    'pid' => '450300',
  ),
  450321 => 
  array (
    'id' => '450321',
    'name' => '阳朔县',
    'level' => 3,
    'pid' => '450300',
  ),
  450323 => 
  array (
    'id' => '450323',
    'name' => '灵川县',
    'level' => 3,
    'pid' => '450300',
  ),
  450324 => 
  array (
    'id' => '450324',
    'name' => '全州县',
    'level' => 3,
    'pid' => '450300',
  ),
  450325 => 
  array (
    'id' => '450325',
    'name' => '兴安县',
    'level' => 3,
    'pid' => '450300',
  ),
  450326 => 
  array (
    'id' => '450326',
    'name' => '永福县',
    'level' => 3,
    'pid' => '450300',
  ),
  450327 => 
  array (
    'id' => '450327',
    'name' => '灌阳县',
    'level' => 3,
    'pid' => '450300',
  ),
  450328 => 
  array (
    'id' => '450328',
    'name' => '龙胜各族自治县',
    'level' => 3,
    'pid' => '450300',
  ),
  450329 => 
  array (
    'id' => '450329',
    'name' => '资源县',
    'level' => 3,
    'pid' => '450300',
  ),
  450330 => 
  array (
    'id' => '450330',
    'name' => '平乐县',
    'level' => 3,
    'pid' => '450300',
  ),
  450331 => 
  array (
    'id' => '450331',
    'name' => '荔浦县',
    'level' => 3,
    'pid' => '450300',
  ),
  450332 => 
  array (
    'id' => '450332',
    'name' => '恭城瑶族自治县',
    'level' => 3,
    'pid' => '450300',
  ),
  450400 => 
  array (
    'id' => '450400',
    'name' => '梧州市',
    'level' => 2,
    'pid' => '450000',
  ),
  450401 => 
  array (
    'id' => '450401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450400',
  ),
  450403 => 
  array (
    'id' => '450403',
    'name' => '万秀区',
    'level' => 3,
    'pid' => '450400',
  ),
  450405 => 
  array (
    'id' => '450405',
    'name' => '长洲区',
    'level' => 3,
    'pid' => '450400',
  ),
  450406 => 
  array (
    'id' => '450406',
    'name' => '龙圩区',
    'level' => 3,
    'pid' => '450400',
  ),
  450421 => 
  array (
    'id' => '450421',
    'name' => '苍梧县',
    'level' => 3,
    'pid' => '450400',
  ),
  450422 => 
  array (
    'id' => '450422',
    'name' => '藤县',
    'level' => 3,
    'pid' => '450400',
  ),
  450423 => 
  array (
    'id' => '450423',
    'name' => '蒙山县',
    'level' => 3,
    'pid' => '450400',
  ),
  450481 => 
  array (
    'id' => '450481',
    'name' => '岑溪市',
    'level' => 3,
    'pid' => '450400',
  ),
  450500 => 
  array (
    'id' => '450500',
    'name' => '北海市',
    'level' => 2,
    'pid' => '450000',
  ),
  450501 => 
  array (
    'id' => '450501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450500',
  ),
  450502 => 
  array (
    'id' => '450502',
    'name' => '海城区',
    'level' => 3,
    'pid' => '450500',
  ),
  450503 => 
  array (
    'id' => '450503',
    'name' => '银海区',
    'level' => 3,
    'pid' => '450500',
  ),
  450512 => 
  array (
    'id' => '450512',
    'name' => '铁山港区',
    'level' => 3,
    'pid' => '450500',
  ),
  450521 => 
  array (
    'id' => '450521',
    'name' => '合浦县',
    'level' => 3,
    'pid' => '450500',
  ),
  450600 => 
  array (
    'id' => '450600',
    'name' => '防城港市',
    'level' => 2,
    'pid' => '450000',
  ),
  450601 => 
  array (
    'id' => '450601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450600',
  ),
  450602 => 
  array (
    'id' => '450602',
    'name' => '港口区',
    'level' => 3,
    'pid' => '450600',
  ),
  450603 => 
  array (
    'id' => '450603',
    'name' => '防城区',
    'level' => 3,
    'pid' => '450600',
  ),
  450621 => 
  array (
    'id' => '450621',
    'name' => '上思县',
    'level' => 3,
    'pid' => '450600',
  ),
  450681 => 
  array (
    'id' => '450681',
    'name' => '东兴市',
    'level' => 3,
    'pid' => '450600',
  ),
  450700 => 
  array (
    'id' => '450700',
    'name' => '钦州市',
    'level' => 2,
    'pid' => '450000',
  ),
  450701 => 
  array (
    'id' => '450701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450700',
  ),
  450702 => 
  array (
    'id' => '450702',
    'name' => '钦南区',
    'level' => 3,
    'pid' => '450700',
  ),
  450703 => 
  array (
    'id' => '450703',
    'name' => '钦北区',
    'level' => 3,
    'pid' => '450700',
  ),
  450721 => 
  array (
    'id' => '450721',
    'name' => '灵山县',
    'level' => 3,
    'pid' => '450700',
  ),
  450722 => 
  array (
    'id' => '450722',
    'name' => '浦北县',
    'level' => 3,
    'pid' => '450700',
  ),
  450800 => 
  array (
    'id' => '450800',
    'name' => '贵港市',
    'level' => 2,
    'pid' => '450000',
  ),
  450801 => 
  array (
    'id' => '450801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450800',
  ),
  450802 => 
  array (
    'id' => '450802',
    'name' => '港北区',
    'level' => 3,
    'pid' => '450800',
  ),
  450803 => 
  array (
    'id' => '450803',
    'name' => '港南区',
    'level' => 3,
    'pid' => '450800',
  ),
  450804 => 
  array (
    'id' => '450804',
    'name' => '覃塘区',
    'level' => 3,
    'pid' => '450800',
  ),
  450821 => 
  array (
    'id' => '450821',
    'name' => '平南县',
    'level' => 3,
    'pid' => '450800',
  ),
  450881 => 
  array (
    'id' => '450881',
    'name' => '桂平市',
    'level' => 3,
    'pid' => '450800',
  ),
  450900 => 
  array (
    'id' => '450900',
    'name' => '玉林市',
    'level' => 2,
    'pid' => '450000',
  ),
  450901 => 
  array (
    'id' => '450901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '450900',
  ),
  450902 => 
  array (
    'id' => '450902',
    'name' => '玉州区',
    'level' => 3,
    'pid' => '450900',
  ),
  450903 => 
  array (
    'id' => '450903',
    'name' => '福绵区',
    'level' => 3,
    'pid' => '450900',
  ),
  450921 => 
  array (
    'id' => '450921',
    'name' => '容县',
    'level' => 3,
    'pid' => '450900',
  ),
  450922 => 
  array (
    'id' => '450922',
    'name' => '陆川县',
    'level' => 3,
    'pid' => '450900',
  ),
  450923 => 
  array (
    'id' => '450923',
    'name' => '博白县',
    'level' => 3,
    'pid' => '450900',
  ),
  450924 => 
  array (
    'id' => '450924',
    'name' => '兴业县',
    'level' => 3,
    'pid' => '450900',
  ),
  450981 => 
  array (
    'id' => '450981',
    'name' => '北流市',
    'level' => 3,
    'pid' => '450900',
  ),
  451000 => 
  array (
    'id' => '451000',
    'name' => '百色市',
    'level' => 2,
    'pid' => '450000',
  ),
  451001 => 
  array (
    'id' => '451001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '451000',
  ),
  451002 => 
  array (
    'id' => '451002',
    'name' => '右江区',
    'level' => 3,
    'pid' => '451000',
  ),
  451021 => 
  array (
    'id' => '451021',
    'name' => '田阳县',
    'level' => 3,
    'pid' => '451000',
  ),
  451022 => 
  array (
    'id' => '451022',
    'name' => '田东县',
    'level' => 3,
    'pid' => '451000',
  ),
  451023 => 
  array (
    'id' => '451023',
    'name' => '平果县',
    'level' => 3,
    'pid' => '451000',
  ),
  451024 => 
  array (
    'id' => '451024',
    'name' => '德保县',
    'level' => 3,
    'pid' => '451000',
  ),
  451026 => 
  array (
    'id' => '451026',
    'name' => '那坡县',
    'level' => 3,
    'pid' => '451000',
  ),
  451027 => 
  array (
    'id' => '451027',
    'name' => '凌云县',
    'level' => 3,
    'pid' => '451000',
  ),
  451028 => 
  array (
    'id' => '451028',
    'name' => '乐业县',
    'level' => 3,
    'pid' => '451000',
  ),
  451029 => 
  array (
    'id' => '451029',
    'name' => '田林县',
    'level' => 3,
    'pid' => '451000',
  ),
  451030 => 
  array (
    'id' => '451030',
    'name' => '西林县',
    'level' => 3,
    'pid' => '451000',
  ),
  451031 => 
  array (
    'id' => '451031',
    'name' => '隆林各族自治县',
    'level' => 3,
    'pid' => '451000',
  ),
  451081 => 
  array (
    'id' => '451081',
    'name' => '靖西市',
    'level' => 3,
    'pid' => '451000',
  ),
  451100 => 
  array (
    'id' => '451100',
    'name' => '贺州市',
    'level' => 2,
    'pid' => '450000',
  ),
  451101 => 
  array (
    'id' => '451101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '451100',
  ),
  451102 => 
  array (
    'id' => '451102',
    'name' => '八步区',
    'level' => 3,
    'pid' => '451100',
  ),
  451121 => 
  array (
    'id' => '451121',
    'name' => '昭平县',
    'level' => 3,
    'pid' => '451100',
  ),
  451122 => 
  array (
    'id' => '451122',
    'name' => '钟山县',
    'level' => 3,
    'pid' => '451100',
  ),
  451123 => 
  array (
    'id' => '451123',
    'name' => '富川瑶族自治县',
    'level' => 3,
    'pid' => '451100',
  ),
  451200 => 
  array (
    'id' => '451200',
    'name' => '河池市',
    'level' => 2,
    'pid' => '450000',
  ),
  451201 => 
  array (
    'id' => '451201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '451200',
  ),
  451202 => 
  array (
    'id' => '451202',
    'name' => '金城江区',
    'level' => 3,
    'pid' => '451200',
  ),
  451221 => 
  array (
    'id' => '451221',
    'name' => '南丹县',
    'level' => 3,
    'pid' => '451200',
  ),
  451222 => 
  array (
    'id' => '451222',
    'name' => '天峨县',
    'level' => 3,
    'pid' => '451200',
  ),
  451223 => 
  array (
    'id' => '451223',
    'name' => '凤山县',
    'level' => 3,
    'pid' => '451200',
  ),
  451224 => 
  array (
    'id' => '451224',
    'name' => '东兰县',
    'level' => 3,
    'pid' => '451200',
  ),
  451225 => 
  array (
    'id' => '451225',
    'name' => '罗城仫佬族自治县',
    'level' => 3,
    'pid' => '451200',
  ),
  451226 => 
  array (
    'id' => '451226',
    'name' => '环江毛南族自治县',
    'level' => 3,
    'pid' => '451200',
  ),
  451227 => 
  array (
    'id' => '451227',
    'name' => '巴马瑶族自治县',
    'level' => 3,
    'pid' => '451200',
  ),
  451228 => 
  array (
    'id' => '451228',
    'name' => '都安瑶族自治县',
    'level' => 3,
    'pid' => '451200',
  ),
  451229 => 
  array (
    'id' => '451229',
    'name' => '大化瑶族自治县',
    'level' => 3,
    'pid' => '451200',
  ),
  451281 => 
  array (
    'id' => '451281',
    'name' => '宜州市',
    'level' => 3,
    'pid' => '451200',
  ),
  451300 => 
  array (
    'id' => '451300',
    'name' => '来宾市',
    'level' => 2,
    'pid' => '450000',
  ),
  451301 => 
  array (
    'id' => '451301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '451300',
  ),
  451302 => 
  array (
    'id' => '451302',
    'name' => '兴宾区',
    'level' => 3,
    'pid' => '451300',
  ),
  451321 => 
  array (
    'id' => '451321',
    'name' => '忻城县',
    'level' => 3,
    'pid' => '451300',
  ),
  451322 => 
  array (
    'id' => '451322',
    'name' => '象州县',
    'level' => 3,
    'pid' => '451300',
  ),
  451323 => 
  array (
    'id' => '451323',
    'name' => '武宣县',
    'level' => 3,
    'pid' => '451300',
  ),
  451324 => 
  array (
    'id' => '451324',
    'name' => '金秀瑶族自治县',
    'level' => 3,
    'pid' => '451300',
  ),
  451381 => 
  array (
    'id' => '451381',
    'name' => '合山市',
    'level' => 3,
    'pid' => '451300',
  ),
  451400 => 
  array (
    'id' => '451400',
    'name' => '崇左市',
    'level' => 2,
    'pid' => '450000',
  ),
  451401 => 
  array (
    'id' => '451401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '451400',
  ),
  451402 => 
  array (
    'id' => '451402',
    'name' => '江州区',
    'level' => 3,
    'pid' => '451400',
  ),
  451421 => 
  array (
    'id' => '451421',
    'name' => '扶绥县',
    'level' => 3,
    'pid' => '451400',
  ),
  451422 => 
  array (
    'id' => '451422',
    'name' => '宁明县',
    'level' => 3,
    'pid' => '451400',
  ),
  451423 => 
  array (
    'id' => '451423',
    'name' => '龙州县',
    'level' => 3,
    'pid' => '451400',
  ),
  451424 => 
  array (
    'id' => '451424',
    'name' => '大新县',
    'level' => 3,
    'pid' => '451400',
  ),
  451425 => 
  array (
    'id' => '451425',
    'name' => '天等县',
    'level' => 3,
    'pid' => '451400',
  ),
  451481 => 
  array (
    'id' => '451481',
    'name' => '凭祥市',
    'level' => 3,
    'pid' => '451400',
  ),
  460000 => 
  array (
    'id' => '460000',
    'name' => '海南省',
    'level' => 1,
    'pid' => 0,
  ),
  460100 => 
  array (
    'id' => '460100',
    'name' => '海口市',
    'level' => 2,
    'pid' => '460000',
  ),
  460101 => 
  array (
    'id' => '460101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '460100',
  ),
  460105 => 
  array (
    'id' => '460105',
    'name' => '秀英区',
    'level' => 3,
    'pid' => '460100',
  ),
  460106 => 
  array (
    'id' => '460106',
    'name' => '龙华区',
    'level' => 3,
    'pid' => '460100',
  ),
  460107 => 
  array (
    'id' => '460107',
    'name' => '琼山区',
    'level' => 3,
    'pid' => '460100',
  ),
  460108 => 
  array (
    'id' => '460108',
    'name' => '美兰区',
    'level' => 3,
    'pid' => '460100',
  ),
  460200 => 
  array (
    'id' => '460200',
    'name' => '三亚市',
    'level' => 2,
    'pid' => '460000',
  ),
  460201 => 
  array (
    'id' => '460201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '460200',
  ),
  460202 => 
  array (
    'id' => '460202',
    'name' => '海棠区',
    'level' => 3,
    'pid' => '460200',
  ),
  460203 => 
  array (
    'id' => '460203',
    'name' => '吉阳区',
    'level' => 3,
    'pid' => '460200',
  ),
  460204 => 
  array (
    'id' => '460204',
    'name' => '天涯区',
    'level' => 3,
    'pid' => '460200',
  ),
  460205 => 
  array (
    'id' => '460205',
    'name' => '崖州区',
    'level' => 3,
    'pid' => '460200',
  ),
  460300 => 
  array (
    'id' => '460300',
    'name' => '三沙市',
    'level' => 2,
    'pid' => '460000',
  ),
  460321 => 
  array (
    'id' => '460321',
    'name' => '西沙群岛',
    'level' => 3,
    'pid' => '460300',
  ),
  460322 => 
  array (
    'id' => '460322',
    'name' => '南沙群岛',
    'level' => 3,
    'pid' => '460300',
  ),
  460323 => 
  array (
    'id' => '460323',
    'name' => '中沙群岛的岛礁及其海域',
    'level' => 3,
    'pid' => '460300',
  ),
  469000 => 
  array (
    'id' => '469000',
    'name' => '省直辖县级行政区划',
    'level' => 2,
    'pid' => '460000',
  ),
  469001 => 
  array (
    'id' => '469001',
    'name' => '五指山市',
    'level' => 3,
    'pid' => '469000',
  ),
  469002 => 
  array (
    'id' => '469002',
    'name' => '琼海市',
    'level' => 3,
    'pid' => '469000',
  ),
  469003 => 
  array (
    'id' => '469003',
    'name' => '儋州市',
    'level' => 3,
    'pid' => '469000',
  ),
  469005 => 
  array (
    'id' => '469005',
    'name' => '文昌市',
    'level' => 3,
    'pid' => '469000',
  ),
  469006 => 
  array (
    'id' => '469006',
    'name' => '万宁市',
    'level' => 3,
    'pid' => '469000',
  ),
  469007 => 
  array (
    'id' => '469007',
    'name' => '东方市',
    'level' => 3,
    'pid' => '469000',
  ),
  469021 => 
  array (
    'id' => '469021',
    'name' => '定安县',
    'level' => 3,
    'pid' => '469000',
  ),
  469022 => 
  array (
    'id' => '469022',
    'name' => '屯昌县',
    'level' => 3,
    'pid' => '469000',
  ),
  469023 => 
  array (
    'id' => '469023',
    'name' => '澄迈县',
    'level' => 3,
    'pid' => '469000',
  ),
  469024 => 
  array (
    'id' => '469024',
    'name' => '临高县',
    'level' => 3,
    'pid' => '469000',
  ),
  469025 => 
  array (
    'id' => '469025',
    'name' => '白沙黎族自治县',
    'level' => 3,
    'pid' => '469000',
  ),
  469026 => 
  array (
    'id' => '469026',
    'name' => '昌江黎族自治县',
    'level' => 3,
    'pid' => '469000',
  ),
  469027 => 
  array (
    'id' => '469027',
    'name' => '乐东黎族自治县',
    'level' => 3,
    'pid' => '469000',
  ),
  469028 => 
  array (
    'id' => '469028',
    'name' => '陵水黎族自治县',
    'level' => 3,
    'pid' => '469000',
  ),
  469029 => 
  array (
    'id' => '469029',
    'name' => '保亭黎族苗族自治县',
    'level' => 3,
    'pid' => '469000',
  ),
  469030 => 
  array (
    'id' => '469030',
    'name' => '琼中黎族苗族自治县',
    'level' => 3,
    'pid' => '469000',
  ),
  500000 => 
  array (
    'id' => '500000',
    'name' => '重庆市',
    'level' => 1,
    'pid' => 0,
  ),
  500100 => 
  array (
    'id' => '500100',
    'name' => '市辖区',
    'level' => 2,
    'pid' => '500000',
  ),
  500101 => 
  array (
    'id' => '500101',
    'name' => '万州区',
    'level' => 3,
    'pid' => '500100',
  ),
  500102 => 
  array (
    'id' => '500102',
    'name' => '涪陵区',
    'level' => 3,
    'pid' => '500100',
  ),
  500103 => 
  array (
    'id' => '500103',
    'name' => '渝中区',
    'level' => 3,
    'pid' => '500100',
  ),
  500104 => 
  array (
    'id' => '500104',
    'name' => '大渡口区',
    'level' => 3,
    'pid' => '500100',
  ),
  500105 => 
  array (
    'id' => '500105',
    'name' => '江北区',
    'level' => 3,
    'pid' => '500100',
  ),
  500106 => 
  array (
    'id' => '500106',
    'name' => '沙坪坝区',
    'level' => 3,
    'pid' => '500100',
  ),
  500107 => 
  array (
    'id' => '500107',
    'name' => '九龙坡区',
    'level' => 3,
    'pid' => '500100',
  ),
  500108 => 
  array (
    'id' => '500108',
    'name' => '南岸区',
    'level' => 3,
    'pid' => '500100',
  ),
  500109 => 
  array (
    'id' => '500109',
    'name' => '北碚区',
    'level' => 3,
    'pid' => '500100',
  ),
  500110 => 
  array (
    'id' => '500110',
    'name' => '綦江区',
    'level' => 3,
    'pid' => '500100',
  ),
  500111 => 
  array (
    'id' => '500111',
    'name' => '大足区',
    'level' => 3,
    'pid' => '500100',
  ),
  500112 => 
  array (
    'id' => '500112',
    'name' => '渝北区',
    'level' => 3,
    'pid' => '500100',
  ),
  500113 => 
  array (
    'id' => '500113',
    'name' => '巴南区',
    'level' => 3,
    'pid' => '500100',
  ),
  500114 => 
  array (
    'id' => '500114',
    'name' => '黔江区',
    'level' => 3,
    'pid' => '500100',
  ),
  500115 => 
  array (
    'id' => '500115',
    'name' => '长寿区',
    'level' => 3,
    'pid' => '500100',
  ),
  500116 => 
  array (
    'id' => '500116',
    'name' => '江津区',
    'level' => 3,
    'pid' => '500100',
  ),
  500117 => 
  array (
    'id' => '500117',
    'name' => '合川区',
    'level' => 3,
    'pid' => '500100',
  ),
  500118 => 
  array (
    'id' => '500118',
    'name' => '永川区',
    'level' => 3,
    'pid' => '500100',
  ),
  500119 => 
  array (
    'id' => '500119',
    'name' => '南川区',
    'level' => 3,
    'pid' => '500100',
  ),
  500120 => 
  array (
    'id' => '500120',
    'name' => '璧山区',
    'level' => 3,
    'pid' => '500100',
  ),
  500151 => 
  array (
    'id' => '500151',
    'name' => '铜梁区',
    'level' => 3,
    'pid' => '500100',
  ),
  500152 => 
  array (
    'id' => '500152',
    'name' => '潼南区',
    'level' => 3,
    'pid' => '500100',
  ),
  500153 => 
  array (
    'id' => '500153',
    'name' => '荣昌区',
    'level' => 3,
    'pid' => '500100',
  ),
  500200 => 
  array (
    'id' => '500200',
    'name' => '县',
    'level' => 2,
    'pid' => '500000',
  ),
  500228 => 
  array (
    'id' => '500228',
    'name' => '梁平县',
    'level' => 3,
    'pid' => '500200',
  ),
  500229 => 
  array (
    'id' => '500229',
    'name' => '城口县',
    'level' => 3,
    'pid' => '500200',
  ),
  500230 => 
  array (
    'id' => '500230',
    'name' => '丰都县',
    'level' => 3,
    'pid' => '500200',
  ),
  500231 => 
  array (
    'id' => '500231',
    'name' => '垫江县',
    'level' => 3,
    'pid' => '500200',
  ),
  500232 => 
  array (
    'id' => '500232',
    'name' => '武隆县',
    'level' => 3,
    'pid' => '500200',
  ),
  500233 => 
  array (
    'id' => '500233',
    'name' => '忠县',
    'level' => 3,
    'pid' => '500200',
  ),
  500234 => 
  array (
    'id' => '500234',
    'name' => '开县',
    'level' => 3,
    'pid' => '500200',
  ),
  500235 => 
  array (
    'id' => '500235',
    'name' => '云阳县',
    'level' => 3,
    'pid' => '500200',
  ),
  500236 => 
  array (
    'id' => '500236',
    'name' => '奉节县',
    'level' => 3,
    'pid' => '500200',
  ),
  500237 => 
  array (
    'id' => '500237',
    'name' => '巫山县',
    'level' => 3,
    'pid' => '500200',
  ),
  500238 => 
  array (
    'id' => '500238',
    'name' => '巫溪县',
    'level' => 3,
    'pid' => '500200',
  ),
  500240 => 
  array (
    'id' => '500240',
    'name' => '石柱土家族自治县',
    'level' => 3,
    'pid' => '500200',
  ),
  500241 => 
  array (
    'id' => '500241',
    'name' => '秀山土家族苗族自治县',
    'level' => 3,
    'pid' => '500200',
  ),
  500242 => 
  array (
    'id' => '500242',
    'name' => '酉阳土家族苗族自治县',
    'level' => 3,
    'pid' => '500200',
  ),
  500243 => 
  array (
    'id' => '500243',
    'name' => '彭水苗族土家族自治县',
    'level' => 3,
    'pid' => '500200',
  ),
  510000 => 
  array (
    'id' => '510000',
    'name' => '四川省',
    'level' => 1,
    'pid' => 0,
  ),
  510100 => 
  array (
    'id' => '510100',
    'name' => '成都市',
    'level' => 2,
    'pid' => '510000',
  ),
  510101 => 
  array (
    'id' => '510101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510100',
  ),
  510104 => 
  array (
    'id' => '510104',
    'name' => '锦江区',
    'level' => 3,
    'pid' => '510100',
  ),
  510105 => 
  array (
    'id' => '510105',
    'name' => '青羊区',
    'level' => 3,
    'pid' => '510100',
  ),
  510106 => 
  array (
    'id' => '510106',
    'name' => '金牛区',
    'level' => 3,
    'pid' => '510100',
  ),
  510107 => 
  array (
    'id' => '510107',
    'name' => '武侯区',
    'level' => 3,
    'pid' => '510100',
  ),
  510108 => 
  array (
    'id' => '510108',
    'name' => '成华区',
    'level' => 3,
    'pid' => '510100',
  ),
  510112 => 
  array (
    'id' => '510112',
    'name' => '龙泉驿区',
    'level' => 3,
    'pid' => '510100',
  ),
  510113 => 
  array (
    'id' => '510113',
    'name' => '青白江区',
    'level' => 3,
    'pid' => '510100',
  ),
  510114 => 
  array (
    'id' => '510114',
    'name' => '新都区',
    'level' => 3,
    'pid' => '510100',
  ),
  510115 => 
  array (
    'id' => '510115',
    'name' => '温江区',
    'level' => 3,
    'pid' => '510100',
  ),
  510121 => 
  array (
    'id' => '510121',
    'name' => '金堂县',
    'level' => 3,
    'pid' => '510100',
  ),
  510122 => 
  array (
    'id' => '510122',
    'name' => '双流县',
    'level' => 3,
    'pid' => '510100',
  ),
  510124 => 
  array (
    'id' => '510124',
    'name' => '郫县',
    'level' => 3,
    'pid' => '510100',
  ),
  510129 => 
  array (
    'id' => '510129',
    'name' => '大邑县',
    'level' => 3,
    'pid' => '510100',
  ),
  510131 => 
  array (
    'id' => '510131',
    'name' => '蒲江县',
    'level' => 3,
    'pid' => '510100',
  ),
  510132 => 
  array (
    'id' => '510132',
    'name' => '新津县',
    'level' => 3,
    'pid' => '510100',
  ),
  510181 => 
  array (
    'id' => '510181',
    'name' => '都江堰市',
    'level' => 3,
    'pid' => '510100',
  ),
  510182 => 
  array (
    'id' => '510182',
    'name' => '彭州市',
    'level' => 3,
    'pid' => '510100',
  ),
  510183 => 
  array (
    'id' => '510183',
    'name' => '邛崃市',
    'level' => 3,
    'pid' => '510100',
  ),
  510184 => 
  array (
    'id' => '510184',
    'name' => '崇州市',
    'level' => 3,
    'pid' => '510100',
  ),
  510300 => 
  array (
    'id' => '510300',
    'name' => '自贡市',
    'level' => 2,
    'pid' => '510000',
  ),
  510301 => 
  array (
    'id' => '510301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510300',
  ),
  510302 => 
  array (
    'id' => '510302',
    'name' => '自流井区',
    'level' => 3,
    'pid' => '510300',
  ),
  510303 => 
  array (
    'id' => '510303',
    'name' => '贡井区',
    'level' => 3,
    'pid' => '510300',
  ),
  510304 => 
  array (
    'id' => '510304',
    'name' => '大安区',
    'level' => 3,
    'pid' => '510300',
  ),
  510311 => 
  array (
    'id' => '510311',
    'name' => '沿滩区',
    'level' => 3,
    'pid' => '510300',
  ),
  510321 => 
  array (
    'id' => '510321',
    'name' => '荣县',
    'level' => 3,
    'pid' => '510300',
  ),
  510322 => 
  array (
    'id' => '510322',
    'name' => '富顺县',
    'level' => 3,
    'pid' => '510300',
  ),
  510400 => 
  array (
    'id' => '510400',
    'name' => '攀枝花市',
    'level' => 2,
    'pid' => '510000',
  ),
  510401 => 
  array (
    'id' => '510401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510400',
  ),
  510402 => 
  array (
    'id' => '510402',
    'name' => '东区',
    'level' => 3,
    'pid' => '510400',
  ),
  510403 => 
  array (
    'id' => '510403',
    'name' => '西区',
    'level' => 3,
    'pid' => '510400',
  ),
  510411 => 
  array (
    'id' => '510411',
    'name' => '仁和区',
    'level' => 3,
    'pid' => '510400',
  ),
  510421 => 
  array (
    'id' => '510421',
    'name' => '米易县',
    'level' => 3,
    'pid' => '510400',
  ),
  510422 => 
  array (
    'id' => '510422',
    'name' => '盐边县',
    'level' => 3,
    'pid' => '510400',
  ),
  510500 => 
  array (
    'id' => '510500',
    'name' => '泸州市',
    'level' => 2,
    'pid' => '510000',
  ),
  510501 => 
  array (
    'id' => '510501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510500',
  ),
  510502 => 
  array (
    'id' => '510502',
    'name' => '江阳区',
    'level' => 3,
    'pid' => '510500',
  ),
  510503 => 
  array (
    'id' => '510503',
    'name' => '纳溪区',
    'level' => 3,
    'pid' => '510500',
  ),
  510504 => 
  array (
    'id' => '510504',
    'name' => '龙马潭区',
    'level' => 3,
    'pid' => '510500',
  ),
  510521 => 
  array (
    'id' => '510521',
    'name' => '泸县',
    'level' => 3,
    'pid' => '510500',
  ),
  510522 => 
  array (
    'id' => '510522',
    'name' => '合江县',
    'level' => 3,
    'pid' => '510500',
  ),
  510524 => 
  array (
    'id' => '510524',
    'name' => '叙永县',
    'level' => 3,
    'pid' => '510500',
  ),
  510525 => 
  array (
    'id' => '510525',
    'name' => '古蔺县',
    'level' => 3,
    'pid' => '510500',
  ),
  510600 => 
  array (
    'id' => '510600',
    'name' => '德阳市',
    'level' => 2,
    'pid' => '510000',
  ),
  510601 => 
  array (
    'id' => '510601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510600',
  ),
  510603 => 
  array (
    'id' => '510603',
    'name' => '旌阳区',
    'level' => 3,
    'pid' => '510600',
  ),
  510623 => 
  array (
    'id' => '510623',
    'name' => '中江县',
    'level' => 3,
    'pid' => '510600',
  ),
  510626 => 
  array (
    'id' => '510626',
    'name' => '罗江县',
    'level' => 3,
    'pid' => '510600',
  ),
  510681 => 
  array (
    'id' => '510681',
    'name' => '广汉市',
    'level' => 3,
    'pid' => '510600',
  ),
  510682 => 
  array (
    'id' => '510682',
    'name' => '什邡市',
    'level' => 3,
    'pid' => '510600',
  ),
  510683 => 
  array (
    'id' => '510683',
    'name' => '绵竹市',
    'level' => 3,
    'pid' => '510600',
  ),
  510700 => 
  array (
    'id' => '510700',
    'name' => '绵阳市',
    'level' => 2,
    'pid' => '510000',
  ),
  510701 => 
  array (
    'id' => '510701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510700',
  ),
  510703 => 
  array (
    'id' => '510703',
    'name' => '涪城区',
    'level' => 3,
    'pid' => '510700',
  ),
  510704 => 
  array (
    'id' => '510704',
    'name' => '游仙区',
    'level' => 3,
    'pid' => '510700',
  ),
  510722 => 
  array (
    'id' => '510722',
    'name' => '三台县',
    'level' => 3,
    'pid' => '510700',
  ),
  510723 => 
  array (
    'id' => '510723',
    'name' => '盐亭县',
    'level' => 3,
    'pid' => '510700',
  ),
  510724 => 
  array (
    'id' => '510724',
    'name' => '安县',
    'level' => 3,
    'pid' => '510700',
  ),
  510725 => 
  array (
    'id' => '510725',
    'name' => '梓潼县',
    'level' => 3,
    'pid' => '510700',
  ),
  510726 => 
  array (
    'id' => '510726',
    'name' => '北川羌族自治县',
    'level' => 3,
    'pid' => '510700',
  ),
  510727 => 
  array (
    'id' => '510727',
    'name' => '平武县',
    'level' => 3,
    'pid' => '510700',
  ),
  510781 => 
  array (
    'id' => '510781',
    'name' => '江油市',
    'level' => 3,
    'pid' => '510700',
  ),
  510800 => 
  array (
    'id' => '510800',
    'name' => '广元市',
    'level' => 2,
    'pid' => '510000',
  ),
  510801 => 
  array (
    'id' => '510801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510800',
  ),
  510802 => 
  array (
    'id' => '510802',
    'name' => '利州区',
    'level' => 3,
    'pid' => '510800',
  ),
  510811 => 
  array (
    'id' => '510811',
    'name' => '昭化区',
    'level' => 3,
    'pid' => '510800',
  ),
  510812 => 
  array (
    'id' => '510812',
    'name' => '朝天区',
    'level' => 3,
    'pid' => '510800',
  ),
  510821 => 
  array (
    'id' => '510821',
    'name' => '旺苍县',
    'level' => 3,
    'pid' => '510800',
  ),
  510822 => 
  array (
    'id' => '510822',
    'name' => '青川县',
    'level' => 3,
    'pid' => '510800',
  ),
  510823 => 
  array (
    'id' => '510823',
    'name' => '剑阁县',
    'level' => 3,
    'pid' => '510800',
  ),
  510824 => 
  array (
    'id' => '510824',
    'name' => '苍溪县',
    'level' => 3,
    'pid' => '510800',
  ),
  510900 => 
  array (
    'id' => '510900',
    'name' => '遂宁市',
    'level' => 2,
    'pid' => '510000',
  ),
  510901 => 
  array (
    'id' => '510901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '510900',
  ),
  510903 => 
  array (
    'id' => '510903',
    'name' => '船山区',
    'level' => 3,
    'pid' => '510900',
  ),
  510904 => 
  array (
    'id' => '510904',
    'name' => '安居区',
    'level' => 3,
    'pid' => '510900',
  ),
  510921 => 
  array (
    'id' => '510921',
    'name' => '蓬溪县',
    'level' => 3,
    'pid' => '510900',
  ),
  510922 => 
  array (
    'id' => '510922',
    'name' => '射洪县',
    'level' => 3,
    'pid' => '510900',
  ),
  510923 => 
  array (
    'id' => '510923',
    'name' => '大英县',
    'level' => 3,
    'pid' => '510900',
  ),
  511000 => 
  array (
    'id' => '511000',
    'name' => '内江市',
    'level' => 2,
    'pid' => '510000',
  ),
  511001 => 
  array (
    'id' => '511001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511000',
  ),
  511002 => 
  array (
    'id' => '511002',
    'name' => '市中区',
    'level' => 3,
    'pid' => '511000',
  ),
  511011 => 
  array (
    'id' => '511011',
    'name' => '东兴区',
    'level' => 3,
    'pid' => '511000',
  ),
  511024 => 
  array (
    'id' => '511024',
    'name' => '威远县',
    'level' => 3,
    'pid' => '511000',
  ),
  511025 => 
  array (
    'id' => '511025',
    'name' => '资中县',
    'level' => 3,
    'pid' => '511000',
  ),
  511028 => 
  array (
    'id' => '511028',
    'name' => '隆昌县',
    'level' => 3,
    'pid' => '511000',
  ),
  511100 => 
  array (
    'id' => '511100',
    'name' => '乐山市',
    'level' => 2,
    'pid' => '510000',
  ),
  511101 => 
  array (
    'id' => '511101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511100',
  ),
  511102 => 
  array (
    'id' => '511102',
    'name' => '市中区',
    'level' => 3,
    'pid' => '511100',
  ),
  511111 => 
  array (
    'id' => '511111',
    'name' => '沙湾区',
    'level' => 3,
    'pid' => '511100',
  ),
  511112 => 
  array (
    'id' => '511112',
    'name' => '五通桥区',
    'level' => 3,
    'pid' => '511100',
  ),
  511113 => 
  array (
    'id' => '511113',
    'name' => '金口河区',
    'level' => 3,
    'pid' => '511100',
  ),
  511123 => 
  array (
    'id' => '511123',
    'name' => '犍为县',
    'level' => 3,
    'pid' => '511100',
  ),
  511124 => 
  array (
    'id' => '511124',
    'name' => '井研县',
    'level' => 3,
    'pid' => '511100',
  ),
  511126 => 
  array (
    'id' => '511126',
    'name' => '夹江县',
    'level' => 3,
    'pid' => '511100',
  ),
  511129 => 
  array (
    'id' => '511129',
    'name' => '沐川县',
    'level' => 3,
    'pid' => '511100',
  ),
  511132 => 
  array (
    'id' => '511132',
    'name' => '峨边彝族自治县',
    'level' => 3,
    'pid' => '511100',
  ),
  511133 => 
  array (
    'id' => '511133',
    'name' => '马边彝族自治县',
    'level' => 3,
    'pid' => '511100',
  ),
  511181 => 
  array (
    'id' => '511181',
    'name' => '峨眉山市',
    'level' => 3,
    'pid' => '511100',
  ),
  511300 => 
  array (
    'id' => '511300',
    'name' => '南充市',
    'level' => 2,
    'pid' => '510000',
  ),
  511301 => 
  array (
    'id' => '511301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511300',
  ),
  511302 => 
  array (
    'id' => '511302',
    'name' => '顺庆区',
    'level' => 3,
    'pid' => '511300',
  ),
  511303 => 
  array (
    'id' => '511303',
    'name' => '高坪区',
    'level' => 3,
    'pid' => '511300',
  ),
  511304 => 
  array (
    'id' => '511304',
    'name' => '嘉陵区',
    'level' => 3,
    'pid' => '511300',
  ),
  511321 => 
  array (
    'id' => '511321',
    'name' => '南部县',
    'level' => 3,
    'pid' => '511300',
  ),
  511322 => 
  array (
    'id' => '511322',
    'name' => '营山县',
    'level' => 3,
    'pid' => '511300',
  ),
  511323 => 
  array (
    'id' => '511323',
    'name' => '蓬安县',
    'level' => 3,
    'pid' => '511300',
  ),
  511324 => 
  array (
    'id' => '511324',
    'name' => '仪陇县',
    'level' => 3,
    'pid' => '511300',
  ),
  511325 => 
  array (
    'id' => '511325',
    'name' => '西充县',
    'level' => 3,
    'pid' => '511300',
  ),
  511381 => 
  array (
    'id' => '511381',
    'name' => '阆中市',
    'level' => 3,
    'pid' => '511300',
  ),
  511400 => 
  array (
    'id' => '511400',
    'name' => '眉山市',
    'level' => 2,
    'pid' => '510000',
  ),
  511401 => 
  array (
    'id' => '511401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511400',
  ),
  511402 => 
  array (
    'id' => '511402',
    'name' => '东坡区',
    'level' => 3,
    'pid' => '511400',
  ),
  511403 => 
  array (
    'id' => '511403',
    'name' => '彭山区',
    'level' => 3,
    'pid' => '511400',
  ),
  511421 => 
  array (
    'id' => '511421',
    'name' => '仁寿县',
    'level' => 3,
    'pid' => '511400',
  ),
  511423 => 
  array (
    'id' => '511423',
    'name' => '洪雅县',
    'level' => 3,
    'pid' => '511400',
  ),
  511424 => 
  array (
    'id' => '511424',
    'name' => '丹棱县',
    'level' => 3,
    'pid' => '511400',
  ),
  511425 => 
  array (
    'id' => '511425',
    'name' => '青神县',
    'level' => 3,
    'pid' => '511400',
  ),
  511500 => 
  array (
    'id' => '511500',
    'name' => '宜宾市',
    'level' => 2,
    'pid' => '510000',
  ),
  511501 => 
  array (
    'id' => '511501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511500',
  ),
  511502 => 
  array (
    'id' => '511502',
    'name' => '翠屏区',
    'level' => 3,
    'pid' => '511500',
  ),
  511503 => 
  array (
    'id' => '511503',
    'name' => '南溪区',
    'level' => 3,
    'pid' => '511500',
  ),
  511521 => 
  array (
    'id' => '511521',
    'name' => '宜宾县',
    'level' => 3,
    'pid' => '511500',
  ),
  511523 => 
  array (
    'id' => '511523',
    'name' => '江安县',
    'level' => 3,
    'pid' => '511500',
  ),
  511524 => 
  array (
    'id' => '511524',
    'name' => '长宁县',
    'level' => 3,
    'pid' => '511500',
  ),
  511525 => 
  array (
    'id' => '511525',
    'name' => '高县',
    'level' => 3,
    'pid' => '511500',
  ),
  511526 => 
  array (
    'id' => '511526',
    'name' => '珙县',
    'level' => 3,
    'pid' => '511500',
  ),
  511527 => 
  array (
    'id' => '511527',
    'name' => '筠连县',
    'level' => 3,
    'pid' => '511500',
  ),
  511528 => 
  array (
    'id' => '511528',
    'name' => '兴文县',
    'level' => 3,
    'pid' => '511500',
  ),
  511529 => 
  array (
    'id' => '511529',
    'name' => '屏山县',
    'level' => 3,
    'pid' => '511500',
  ),
  511600 => 
  array (
    'id' => '511600',
    'name' => '广安市',
    'level' => 2,
    'pid' => '510000',
  ),
  511601 => 
  array (
    'id' => '511601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511600',
  ),
  511602 => 
  array (
    'id' => '511602',
    'name' => '广安区',
    'level' => 3,
    'pid' => '511600',
  ),
  511603 => 
  array (
    'id' => '511603',
    'name' => '前锋区',
    'level' => 3,
    'pid' => '511600',
  ),
  511621 => 
  array (
    'id' => '511621',
    'name' => '岳池县',
    'level' => 3,
    'pid' => '511600',
  ),
  511622 => 
  array (
    'id' => '511622',
    'name' => '武胜县',
    'level' => 3,
    'pid' => '511600',
  ),
  511623 => 
  array (
    'id' => '511623',
    'name' => '邻水县',
    'level' => 3,
    'pid' => '511600',
  ),
  511681 => 
  array (
    'id' => '511681',
    'name' => '华蓥市',
    'level' => 3,
    'pid' => '511600',
  ),
  511700 => 
  array (
    'id' => '511700',
    'name' => '达州市',
    'level' => 2,
    'pid' => '510000',
  ),
  511701 => 
  array (
    'id' => '511701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511700',
  ),
  511702 => 
  array (
    'id' => '511702',
    'name' => '通川区',
    'level' => 3,
    'pid' => '511700',
  ),
  511703 => 
  array (
    'id' => '511703',
    'name' => '达川区',
    'level' => 3,
    'pid' => '511700',
  ),
  511722 => 
  array (
    'id' => '511722',
    'name' => '宣汉县',
    'level' => 3,
    'pid' => '511700',
  ),
  511723 => 
  array (
    'id' => '511723',
    'name' => '开江县',
    'level' => 3,
    'pid' => '511700',
  ),
  511724 => 
  array (
    'id' => '511724',
    'name' => '大竹县',
    'level' => 3,
    'pid' => '511700',
  ),
  511725 => 
  array (
    'id' => '511725',
    'name' => '渠县',
    'level' => 3,
    'pid' => '511700',
  ),
  511781 => 
  array (
    'id' => '511781',
    'name' => '万源市',
    'level' => 3,
    'pid' => '511700',
  ),
  511800 => 
  array (
    'id' => '511800',
    'name' => '雅安市',
    'level' => 2,
    'pid' => '510000',
  ),
  511801 => 
  array (
    'id' => '511801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511800',
  ),
  511802 => 
  array (
    'id' => '511802',
    'name' => '雨城区',
    'level' => 3,
    'pid' => '511800',
  ),
  511803 => 
  array (
    'id' => '511803',
    'name' => '名山区',
    'level' => 3,
    'pid' => '511800',
  ),
  511822 => 
  array (
    'id' => '511822',
    'name' => '荥经县',
    'level' => 3,
    'pid' => '511800',
  ),
  511823 => 
  array (
    'id' => '511823',
    'name' => '汉源县',
    'level' => 3,
    'pid' => '511800',
  ),
  511824 => 
  array (
    'id' => '511824',
    'name' => '石棉县',
    'level' => 3,
    'pid' => '511800',
  ),
  511825 => 
  array (
    'id' => '511825',
    'name' => '天全县',
    'level' => 3,
    'pid' => '511800',
  ),
  511826 => 
  array (
    'id' => '511826',
    'name' => '芦山县',
    'level' => 3,
    'pid' => '511800',
  ),
  511827 => 
  array (
    'id' => '511827',
    'name' => '宝兴县',
    'level' => 3,
    'pid' => '511800',
  ),
  511900 => 
  array (
    'id' => '511900',
    'name' => '巴中市',
    'level' => 2,
    'pid' => '510000',
  ),
  511901 => 
  array (
    'id' => '511901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '511900',
  ),
  511902 => 
  array (
    'id' => '511902',
    'name' => '巴州区',
    'level' => 3,
    'pid' => '511900',
  ),
  511903 => 
  array (
    'id' => '511903',
    'name' => '恩阳区',
    'level' => 3,
    'pid' => '511900',
  ),
  511921 => 
  array (
    'id' => '511921',
    'name' => '通江县',
    'level' => 3,
    'pid' => '511900',
  ),
  511922 => 
  array (
    'id' => '511922',
    'name' => '南江县',
    'level' => 3,
    'pid' => '511900',
  ),
  511923 => 
  array (
    'id' => '511923',
    'name' => '平昌县',
    'level' => 3,
    'pid' => '511900',
  ),
  512000 => 
  array (
    'id' => '512000',
    'name' => '资阳市',
    'level' => 2,
    'pid' => '510000',
  ),
  512001 => 
  array (
    'id' => '512001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '512000',
  ),
  512002 => 
  array (
    'id' => '512002',
    'name' => '雁江区',
    'level' => 3,
    'pid' => '512000',
  ),
  512021 => 
  array (
    'id' => '512021',
    'name' => '安岳县',
    'level' => 3,
    'pid' => '512000',
  ),
  512022 => 
  array (
    'id' => '512022',
    'name' => '乐至县',
    'level' => 3,
    'pid' => '512000',
  ),
  512081 => 
  array (
    'id' => '512081',
    'name' => '简阳市',
    'level' => 3,
    'pid' => '512000',
  ),
  513200 => 
  array (
    'id' => '513200',
    'name' => '阿坝藏族羌族自治州',
    'level' => 2,
    'pid' => '510000',
  ),
  513221 => 
  array (
    'id' => '513221',
    'name' => '汶川县',
    'level' => 3,
    'pid' => '513200',
  ),
  513222 => 
  array (
    'id' => '513222',
    'name' => '理县',
    'level' => 3,
    'pid' => '513200',
  ),
  513223 => 
  array (
    'id' => '513223',
    'name' => '茂县',
    'level' => 3,
    'pid' => '513200',
  ),
  513224 => 
  array (
    'id' => '513224',
    'name' => '松潘县',
    'level' => 3,
    'pid' => '513200',
  ),
  513225 => 
  array (
    'id' => '513225',
    'name' => '九寨沟县',
    'level' => 3,
    'pid' => '513200',
  ),
  513226 => 
  array (
    'id' => '513226',
    'name' => '金川县',
    'level' => 3,
    'pid' => '513200',
  ),
  513227 => 
  array (
    'id' => '513227',
    'name' => '小金县',
    'level' => 3,
    'pid' => '513200',
  ),
  513228 => 
  array (
    'id' => '513228',
    'name' => '黑水县',
    'level' => 3,
    'pid' => '513200',
  ),
  513229 => 
  array (
    'id' => '513229',
    'name' => '马尔康县',
    'level' => 3,
    'pid' => '513200',
  ),
  513230 => 
  array (
    'id' => '513230',
    'name' => '壤塘县',
    'level' => 3,
    'pid' => '513200',
  ),
  513231 => 
  array (
    'id' => '513231',
    'name' => '阿坝县',
    'level' => 3,
    'pid' => '513200',
  ),
  513232 => 
  array (
    'id' => '513232',
    'name' => '若尔盖县',
    'level' => 3,
    'pid' => '513200',
  ),
  513233 => 
  array (
    'id' => '513233',
    'name' => '红原县',
    'level' => 3,
    'pid' => '513200',
  ),
  513300 => 
  array (
    'id' => '513300',
    'name' => '甘孜藏族自治州',
    'level' => 2,
    'pid' => '510000',
  ),
  513301 => 
  array (
    'id' => '513301',
    'name' => '康定市',
    'level' => 3,
    'pid' => '513300',
  ),
  513322 => 
  array (
    'id' => '513322',
    'name' => '泸定县',
    'level' => 3,
    'pid' => '513300',
  ),
  513323 => 
  array (
    'id' => '513323',
    'name' => '丹巴县',
    'level' => 3,
    'pid' => '513300',
  ),
  513324 => 
  array (
    'id' => '513324',
    'name' => '九龙县',
    'level' => 3,
    'pid' => '513300',
  ),
  513325 => 
  array (
    'id' => '513325',
    'name' => '雅江县',
    'level' => 3,
    'pid' => '513300',
  ),
  513326 => 
  array (
    'id' => '513326',
    'name' => '道孚县',
    'level' => 3,
    'pid' => '513300',
  ),
  513327 => 
  array (
    'id' => '513327',
    'name' => '炉霍县',
    'level' => 3,
    'pid' => '513300',
  ),
  513328 => 
  array (
    'id' => '513328',
    'name' => '甘孜县',
    'level' => 3,
    'pid' => '513300',
  ),
  513329 => 
  array (
    'id' => '513329',
    'name' => '新龙县',
    'level' => 3,
    'pid' => '513300',
  ),
  513330 => 
  array (
    'id' => '513330',
    'name' => '德格县',
    'level' => 3,
    'pid' => '513300',
  ),
  513331 => 
  array (
    'id' => '513331',
    'name' => '白玉县',
    'level' => 3,
    'pid' => '513300',
  ),
  513332 => 
  array (
    'id' => '513332',
    'name' => '石渠县',
    'level' => 3,
    'pid' => '513300',
  ),
  513333 => 
  array (
    'id' => '513333',
    'name' => '色达县',
    'level' => 3,
    'pid' => '513300',
  ),
  513334 => 
  array (
    'id' => '513334',
    'name' => '理塘县',
    'level' => 3,
    'pid' => '513300',
  ),
  513335 => 
  array (
    'id' => '513335',
    'name' => '巴塘县',
    'level' => 3,
    'pid' => '513300',
  ),
  513336 => 
  array (
    'id' => '513336',
    'name' => '乡城县',
    'level' => 3,
    'pid' => '513300',
  ),
  513337 => 
  array (
    'id' => '513337',
    'name' => '稻城县',
    'level' => 3,
    'pid' => '513300',
  ),
  513338 => 
  array (
    'id' => '513338',
    'name' => '得荣县',
    'level' => 3,
    'pid' => '513300',
  ),
  513400 => 
  array (
    'id' => '513400',
    'name' => '凉山彝族自治州',
    'level' => 2,
    'pid' => '510000',
  ),
  513401 => 
  array (
    'id' => '513401',
    'name' => '西昌市',
    'level' => 3,
    'pid' => '513400',
  ),
  513422 => 
  array (
    'id' => '513422',
    'name' => '木里藏族自治县',
    'level' => 3,
    'pid' => '513400',
  ),
  513423 => 
  array (
    'id' => '513423',
    'name' => '盐源县',
    'level' => 3,
    'pid' => '513400',
  ),
  513424 => 
  array (
    'id' => '513424',
    'name' => '德昌县',
    'level' => 3,
    'pid' => '513400',
  ),
  513425 => 
  array (
    'id' => '513425',
    'name' => '会理县',
    'level' => 3,
    'pid' => '513400',
  ),
  513426 => 
  array (
    'id' => '513426',
    'name' => '会东县',
    'level' => 3,
    'pid' => '513400',
  ),
  513427 => 
  array (
    'id' => '513427',
    'name' => '宁南县',
    'level' => 3,
    'pid' => '513400',
  ),
  513428 => 
  array (
    'id' => '513428',
    'name' => '普格县',
    'level' => 3,
    'pid' => '513400',
  ),
  513429 => 
  array (
    'id' => '513429',
    'name' => '布拖县',
    'level' => 3,
    'pid' => '513400',
  ),
  513430 => 
  array (
    'id' => '513430',
    'name' => '金阳县',
    'level' => 3,
    'pid' => '513400',
  ),
  513431 => 
  array (
    'id' => '513431',
    'name' => '昭觉县',
    'level' => 3,
    'pid' => '513400',
  ),
  513432 => 
  array (
    'id' => '513432',
    'name' => '喜德县',
    'level' => 3,
    'pid' => '513400',
  ),
  513433 => 
  array (
    'id' => '513433',
    'name' => '冕宁县',
    'level' => 3,
    'pid' => '513400',
  ),
  513434 => 
  array (
    'id' => '513434',
    'name' => '越西县',
    'level' => 3,
    'pid' => '513400',
  ),
  513435 => 
  array (
    'id' => '513435',
    'name' => '甘洛县',
    'level' => 3,
    'pid' => '513400',
  ),
  513436 => 
  array (
    'id' => '513436',
    'name' => '美姑县',
    'level' => 3,
    'pid' => '513400',
  ),
  513437 => 
  array (
    'id' => '513437',
    'name' => '雷波县',
    'level' => 3,
    'pid' => '513400',
  ),
  520000 => 
  array (
    'id' => '520000',
    'name' => '贵州省',
    'level' => 1,
    'pid' => 0,
  ),
  520100 => 
  array (
    'id' => '520100',
    'name' => '贵阳市',
    'level' => 2,
    'pid' => '520000',
  ),
  520101 => 
  array (
    'id' => '520101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '520100',
  ),
  520102 => 
  array (
    'id' => '520102',
    'name' => '南明区',
    'level' => 3,
    'pid' => '520100',
  ),
  520103 => 
  array (
    'id' => '520103',
    'name' => '云岩区',
    'level' => 3,
    'pid' => '520100',
  ),
  520111 => 
  array (
    'id' => '520111',
    'name' => '花溪区',
    'level' => 3,
    'pid' => '520100',
  ),
  520112 => 
  array (
    'id' => '520112',
    'name' => '乌当区',
    'level' => 3,
    'pid' => '520100',
  ),
  520113 => 
  array (
    'id' => '520113',
    'name' => '白云区',
    'level' => 3,
    'pid' => '520100',
  ),
  520115 => 
  array (
    'id' => '520115',
    'name' => '观山湖区',
    'level' => 3,
    'pid' => '520100',
  ),
  520121 => 
  array (
    'id' => '520121',
    'name' => '开阳县',
    'level' => 3,
    'pid' => '520100',
  ),
  520122 => 
  array (
    'id' => '520122',
    'name' => '息烽县',
    'level' => 3,
    'pid' => '520100',
  ),
  520123 => 
  array (
    'id' => '520123',
    'name' => '修文县',
    'level' => 3,
    'pid' => '520100',
  ),
  520181 => 
  array (
    'id' => '520181',
    'name' => '清镇市',
    'level' => 3,
    'pid' => '520100',
  ),
  520200 => 
  array (
    'id' => '520200',
    'name' => '六盘水市',
    'level' => 2,
    'pid' => '520000',
  ),
  520201 => 
  array (
    'id' => '520201',
    'name' => '钟山区',
    'level' => 3,
    'pid' => '520200',
  ),
  520203 => 
  array (
    'id' => '520203',
    'name' => '六枝特区',
    'level' => 3,
    'pid' => '520200',
  ),
  520221 => 
  array (
    'id' => '520221',
    'name' => '水城县',
    'level' => 3,
    'pid' => '520200',
  ),
  520222 => 
  array (
    'id' => '520222',
    'name' => '盘县',
    'level' => 3,
    'pid' => '520200',
  ),
  520300 => 
  array (
    'id' => '520300',
    'name' => '遵义市',
    'level' => 2,
    'pid' => '520000',
  ),
  520301 => 
  array (
    'id' => '520301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '520300',
  ),
  520302 => 
  array (
    'id' => '520302',
    'name' => '红花岗区',
    'level' => 3,
    'pid' => '520300',
  ),
  520303 => 
  array (
    'id' => '520303',
    'name' => '汇川区',
    'level' => 3,
    'pid' => '520300',
  ),
  520321 => 
  array (
    'id' => '520321',
    'name' => '遵义县',
    'level' => 3,
    'pid' => '520300',
  ),
  520322 => 
  array (
    'id' => '520322',
    'name' => '桐梓县',
    'level' => 3,
    'pid' => '520300',
  ),
  520323 => 
  array (
    'id' => '520323',
    'name' => '绥阳县',
    'level' => 3,
    'pid' => '520300',
  ),
  520324 => 
  array (
    'id' => '520324',
    'name' => '正安县',
    'level' => 3,
    'pid' => '520300',
  ),
  520325 => 
  array (
    'id' => '520325',
    'name' => '道真仡佬族苗族自治县',
    'level' => 3,
    'pid' => '520300',
  ),
  520326 => 
  array (
    'id' => '520326',
    'name' => '务川仡佬族苗族自治县',
    'level' => 3,
    'pid' => '520300',
  ),
  520327 => 
  array (
    'id' => '520327',
    'name' => '凤冈县',
    'level' => 3,
    'pid' => '520300',
  ),
  520328 => 
  array (
    'id' => '520328',
    'name' => '湄潭县',
    'level' => 3,
    'pid' => '520300',
  ),
  520329 => 
  array (
    'id' => '520329',
    'name' => '余庆县',
    'level' => 3,
    'pid' => '520300',
  ),
  520330 => 
  array (
    'id' => '520330',
    'name' => '习水县',
    'level' => 3,
    'pid' => '520300',
  ),
  520381 => 
  array (
    'id' => '520381',
    'name' => '赤水市',
    'level' => 3,
    'pid' => '520300',
  ),
  520382 => 
  array (
    'id' => '520382',
    'name' => '仁怀市',
    'level' => 3,
    'pid' => '520300',
  ),
  520400 => 
  array (
    'id' => '520400',
    'name' => '安顺市',
    'level' => 2,
    'pid' => '520000',
  ),
  520401 => 
  array (
    'id' => '520401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '520400',
  ),
  520402 => 
  array (
    'id' => '520402',
    'name' => '西秀区',
    'level' => 3,
    'pid' => '520400',
  ),
  520403 => 
  array (
    'id' => '520403',
    'name' => '平坝区',
    'level' => 3,
    'pid' => '520400',
  ),
  520422 => 
  array (
    'id' => '520422',
    'name' => '普定县',
    'level' => 3,
    'pid' => '520400',
  ),
  520423 => 
  array (
    'id' => '520423',
    'name' => '镇宁布依族苗族自治县',
    'level' => 3,
    'pid' => '520400',
  ),
  520424 => 
  array (
    'id' => '520424',
    'name' => '关岭布依族苗族自治县',
    'level' => 3,
    'pid' => '520400',
  ),
  520425 => 
  array (
    'id' => '520425',
    'name' => '紫云苗族布依族自治县',
    'level' => 3,
    'pid' => '520400',
  ),
  520500 => 
  array (
    'id' => '520500',
    'name' => '毕节市',
    'level' => 2,
    'pid' => '520000',
  ),
  520501 => 
  array (
    'id' => '520501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '520500',
  ),
  520502 => 
  array (
    'id' => '520502',
    'name' => '七星关区',
    'level' => 3,
    'pid' => '520500',
  ),
  520521 => 
  array (
    'id' => '520521',
    'name' => '大方县',
    'level' => 3,
    'pid' => '520500',
  ),
  520522 => 
  array (
    'id' => '520522',
    'name' => '黔西县',
    'level' => 3,
    'pid' => '520500',
  ),
  520523 => 
  array (
    'id' => '520523',
    'name' => '金沙县',
    'level' => 3,
    'pid' => '520500',
  ),
  520524 => 
  array (
    'id' => '520524',
    'name' => '织金县',
    'level' => 3,
    'pid' => '520500',
  ),
  520525 => 
  array (
    'id' => '520525',
    'name' => '纳雍县',
    'level' => 3,
    'pid' => '520500',
  ),
  520526 => 
  array (
    'id' => '520526',
    'name' => '威宁彝族回族苗族自治县',
    'level' => 3,
    'pid' => '520500',
  ),
  520527 => 
  array (
    'id' => '520527',
    'name' => '赫章县',
    'level' => 3,
    'pid' => '520500',
  ),
  520600 => 
  array (
    'id' => '520600',
    'name' => '铜仁市',
    'level' => 2,
    'pid' => '520000',
  ),
  520601 => 
  array (
    'id' => '520601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '520600',
  ),
  520602 => 
  array (
    'id' => '520602',
    'name' => '碧江区',
    'level' => 3,
    'pid' => '520600',
  ),
  520603 => 
  array (
    'id' => '520603',
    'name' => '万山区',
    'level' => 3,
    'pid' => '520600',
  ),
  520621 => 
  array (
    'id' => '520621',
    'name' => '江口县',
    'level' => 3,
    'pid' => '520600',
  ),
  520622 => 
  array (
    'id' => '520622',
    'name' => '玉屏侗族自治县',
    'level' => 3,
    'pid' => '520600',
  ),
  520623 => 
  array (
    'id' => '520623',
    'name' => '石阡县',
    'level' => 3,
    'pid' => '520600',
  ),
  520624 => 
  array (
    'id' => '520624',
    'name' => '思南县',
    'level' => 3,
    'pid' => '520600',
  ),
  520625 => 
  array (
    'id' => '520625',
    'name' => '印江土家族苗族自治县',
    'level' => 3,
    'pid' => '520600',
  ),
  520626 => 
  array (
    'id' => '520626',
    'name' => '德江县',
    'level' => 3,
    'pid' => '520600',
  ),
  520627 => 
  array (
    'id' => '520627',
    'name' => '沿河土家族自治县',
    'level' => 3,
    'pid' => '520600',
  ),
  520628 => 
  array (
    'id' => '520628',
    'name' => '松桃苗族自治县',
    'level' => 3,
    'pid' => '520600',
  ),
  522300 => 
  array (
    'id' => '522300',
    'name' => '黔西南布依族苗族自治州',
    'level' => 2,
    'pid' => '520000',
  ),
  522301 => 
  array (
    'id' => '522301',
    'name' => '兴义市',
    'level' => 3,
    'pid' => '522300',
  ),
  522322 => 
  array (
    'id' => '522322',
    'name' => '兴仁县',
    'level' => 3,
    'pid' => '522300',
  ),
  522323 => 
  array (
    'id' => '522323',
    'name' => '普安县',
    'level' => 3,
    'pid' => '522300',
  ),
  522324 => 
  array (
    'id' => '522324',
    'name' => '晴隆县',
    'level' => 3,
    'pid' => '522300',
  ),
  522325 => 
  array (
    'id' => '522325',
    'name' => '贞丰县',
    'level' => 3,
    'pid' => '522300',
  ),
  522326 => 
  array (
    'id' => '522326',
    'name' => '望谟县',
    'level' => 3,
    'pid' => '522300',
  ),
  522327 => 
  array (
    'id' => '522327',
    'name' => '册亨县',
    'level' => 3,
    'pid' => '522300',
  ),
  522328 => 
  array (
    'id' => '522328',
    'name' => '安龙县',
    'level' => 3,
    'pid' => '522300',
  ),
  522600 => 
  array (
    'id' => '522600',
    'name' => '黔东南苗族侗族自治州',
    'level' => 2,
    'pid' => '520000',
  ),
  522601 => 
  array (
    'id' => '522601',
    'name' => '凯里市',
    'level' => 3,
    'pid' => '522600',
  ),
  522622 => 
  array (
    'id' => '522622',
    'name' => '黄平县',
    'level' => 3,
    'pid' => '522600',
  ),
  522623 => 
  array (
    'id' => '522623',
    'name' => '施秉县',
    'level' => 3,
    'pid' => '522600',
  ),
  522624 => 
  array (
    'id' => '522624',
    'name' => '三穗县',
    'level' => 3,
    'pid' => '522600',
  ),
  522625 => 
  array (
    'id' => '522625',
    'name' => '镇远县',
    'level' => 3,
    'pid' => '522600',
  ),
  522626 => 
  array (
    'id' => '522626',
    'name' => '岑巩县',
    'level' => 3,
    'pid' => '522600',
  ),
  522627 => 
  array (
    'id' => '522627',
    'name' => '天柱县',
    'level' => 3,
    'pid' => '522600',
  ),
  522628 => 
  array (
    'id' => '522628',
    'name' => '锦屏县',
    'level' => 3,
    'pid' => '522600',
  ),
  522629 => 
  array (
    'id' => '522629',
    'name' => '剑河县',
    'level' => 3,
    'pid' => '522600',
  ),
  522630 => 
  array (
    'id' => '522630',
    'name' => '台江县',
    'level' => 3,
    'pid' => '522600',
  ),
  522631 => 
  array (
    'id' => '522631',
    'name' => '黎平县',
    'level' => 3,
    'pid' => '522600',
  ),
  522632 => 
  array (
    'id' => '522632',
    'name' => '榕江县',
    'level' => 3,
    'pid' => '522600',
  ),
  522633 => 
  array (
    'id' => '522633',
    'name' => '从江县',
    'level' => 3,
    'pid' => '522600',
  ),
  522634 => 
  array (
    'id' => '522634',
    'name' => '雷山县',
    'level' => 3,
    'pid' => '522600',
  ),
  522635 => 
  array (
    'id' => '522635',
    'name' => '麻江县',
    'level' => 3,
    'pid' => '522600',
  ),
  522636 => 
  array (
    'id' => '522636',
    'name' => '丹寨县',
    'level' => 3,
    'pid' => '522600',
  ),
  522700 => 
  array (
    'id' => '522700',
    'name' => '黔南布依族苗族自治州',
    'level' => 2,
    'pid' => '520000',
  ),
  522701 => 
  array (
    'id' => '522701',
    'name' => '都匀市',
    'level' => 3,
    'pid' => '522700',
  ),
  522702 => 
  array (
    'id' => '522702',
    'name' => '福泉市',
    'level' => 3,
    'pid' => '522700',
  ),
  522722 => 
  array (
    'id' => '522722',
    'name' => '荔波县',
    'level' => 3,
    'pid' => '522700',
  ),
  522723 => 
  array (
    'id' => '522723',
    'name' => '贵定县',
    'level' => 3,
    'pid' => '522700',
  ),
  522725 => 
  array (
    'id' => '522725',
    'name' => '瓮安县',
    'level' => 3,
    'pid' => '522700',
  ),
  522726 => 
  array (
    'id' => '522726',
    'name' => '独山县',
    'level' => 3,
    'pid' => '522700',
  ),
  522727 => 
  array (
    'id' => '522727',
    'name' => '平塘县',
    'level' => 3,
    'pid' => '522700',
  ),
  522728 => 
  array (
    'id' => '522728',
    'name' => '罗甸县',
    'level' => 3,
    'pid' => '522700',
  ),
  522729 => 
  array (
    'id' => '522729',
    'name' => '长顺县',
    'level' => 3,
    'pid' => '522700',
  ),
  522730 => 
  array (
    'id' => '522730',
    'name' => '龙里县',
    'level' => 3,
    'pid' => '522700',
  ),
  522731 => 
  array (
    'id' => '522731',
    'name' => '惠水县',
    'level' => 3,
    'pid' => '522700',
  ),
  522732 => 
  array (
    'id' => '522732',
    'name' => '三都水族自治县',
    'level' => 3,
    'pid' => '522700',
  ),
  530000 => 
  array (
    'id' => '530000',
    'name' => '云南省',
    'level' => 1,
    'pid' => 0,
  ),
  530100 => 
  array (
    'id' => '530100',
    'name' => '昆明市',
    'level' => 2,
    'pid' => '530000',
  ),
  530101 => 
  array (
    'id' => '530101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530100',
  ),
  530102 => 
  array (
    'id' => '530102',
    'name' => '五华区',
    'level' => 3,
    'pid' => '530100',
  ),
  530103 => 
  array (
    'id' => '530103',
    'name' => '盘龙区',
    'level' => 3,
    'pid' => '530100',
  ),
  530111 => 
  array (
    'id' => '530111',
    'name' => '官渡区',
    'level' => 3,
    'pid' => '530100',
  ),
  530112 => 
  array (
    'id' => '530112',
    'name' => '西山区',
    'level' => 3,
    'pid' => '530100',
  ),
  530113 => 
  array (
    'id' => '530113',
    'name' => '东川区',
    'level' => 3,
    'pid' => '530100',
  ),
  530114 => 
  array (
    'id' => '530114',
    'name' => '呈贡区',
    'level' => 3,
    'pid' => '530100',
  ),
  530122 => 
  array (
    'id' => '530122',
    'name' => '晋宁县',
    'level' => 3,
    'pid' => '530100',
  ),
  530124 => 
  array (
    'id' => '530124',
    'name' => '富民县',
    'level' => 3,
    'pid' => '530100',
  ),
  530125 => 
  array (
    'id' => '530125',
    'name' => '宜良县',
    'level' => 3,
    'pid' => '530100',
  ),
  530126 => 
  array (
    'id' => '530126',
    'name' => '石林彝族自治县',
    'level' => 3,
    'pid' => '530100',
  ),
  530127 => 
  array (
    'id' => '530127',
    'name' => '嵩明县',
    'level' => 3,
    'pid' => '530100',
  ),
  530128 => 
  array (
    'id' => '530128',
    'name' => '禄劝彝族苗族自治县',
    'level' => 3,
    'pid' => '530100',
  ),
  530129 => 
  array (
    'id' => '530129',
    'name' => '寻甸回族彝族自治县',
    'level' => 3,
    'pid' => '530100',
  ),
  530181 => 
  array (
    'id' => '530181',
    'name' => '安宁市',
    'level' => 3,
    'pid' => '530100',
  ),
  530300 => 
  array (
    'id' => '530300',
    'name' => '曲靖市',
    'level' => 2,
    'pid' => '530000',
  ),
  530301 => 
  array (
    'id' => '530301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530300',
  ),
  530302 => 
  array (
    'id' => '530302',
    'name' => '麒麟区',
    'level' => 3,
    'pid' => '530300',
  ),
  530321 => 
  array (
    'id' => '530321',
    'name' => '马龙县',
    'level' => 3,
    'pid' => '530300',
  ),
  530322 => 
  array (
    'id' => '530322',
    'name' => '陆良县',
    'level' => 3,
    'pid' => '530300',
  ),
  530323 => 
  array (
    'id' => '530323',
    'name' => '师宗县',
    'level' => 3,
    'pid' => '530300',
  ),
  530324 => 
  array (
    'id' => '530324',
    'name' => '罗平县',
    'level' => 3,
    'pid' => '530300',
  ),
  530325 => 
  array (
    'id' => '530325',
    'name' => '富源县',
    'level' => 3,
    'pid' => '530300',
  ),
  530326 => 
  array (
    'id' => '530326',
    'name' => '会泽县',
    'level' => 3,
    'pid' => '530300',
  ),
  530328 => 
  array (
    'id' => '530328',
    'name' => '沾益县',
    'level' => 3,
    'pid' => '530300',
  ),
  530381 => 
  array (
    'id' => '530381',
    'name' => '宣威市',
    'level' => 3,
    'pid' => '530300',
  ),
  530400 => 
  array (
    'id' => '530400',
    'name' => '玉溪市',
    'level' => 2,
    'pid' => '530000',
  ),
  530401 => 
  array (
    'id' => '530401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530400',
  ),
  530402 => 
  array (
    'id' => '530402',
    'name' => '红塔区',
    'level' => 3,
    'pid' => '530400',
  ),
  530421 => 
  array (
    'id' => '530421',
    'name' => '江川县',
    'level' => 3,
    'pid' => '530400',
  ),
  530422 => 
  array (
    'id' => '530422',
    'name' => '澄江县',
    'level' => 3,
    'pid' => '530400',
  ),
  530423 => 
  array (
    'id' => '530423',
    'name' => '通海县',
    'level' => 3,
    'pid' => '530400',
  ),
  530424 => 
  array (
    'id' => '530424',
    'name' => '华宁县',
    'level' => 3,
    'pid' => '530400',
  ),
  530425 => 
  array (
    'id' => '530425',
    'name' => '易门县',
    'level' => 3,
    'pid' => '530400',
  ),
  530426 => 
  array (
    'id' => '530426',
    'name' => '峨山彝族自治县',
    'level' => 3,
    'pid' => '530400',
  ),
  530427 => 
  array (
    'id' => '530427',
    'name' => '新平彝族傣族自治县',
    'level' => 3,
    'pid' => '530400',
  ),
  530428 => 
  array (
    'id' => '530428',
    'name' => '元江哈尼族彝族傣族自治县',
    'level' => 3,
    'pid' => '530400',
  ),
  530500 => 
  array (
    'id' => '530500',
    'name' => '保山市',
    'level' => 2,
    'pid' => '530000',
  ),
  530501 => 
  array (
    'id' => '530501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530500',
  ),
  530502 => 
  array (
    'id' => '530502',
    'name' => '隆阳区',
    'level' => 3,
    'pid' => '530500',
  ),
  530521 => 
  array (
    'id' => '530521',
    'name' => '施甸县',
    'level' => 3,
    'pid' => '530500',
  ),
  530523 => 
  array (
    'id' => '530523',
    'name' => '龙陵县',
    'level' => 3,
    'pid' => '530500',
  ),
  530524 => 
  array (
    'id' => '530524',
    'name' => '昌宁县',
    'level' => 3,
    'pid' => '530500',
  ),
  530581 => 
  array (
    'id' => '530581',
    'name' => '腾冲市',
    'level' => 3,
    'pid' => '530500',
  ),
  530600 => 
  array (
    'id' => '530600',
    'name' => '昭通市',
    'level' => 2,
    'pid' => '530000',
  ),
  530601 => 
  array (
    'id' => '530601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530600',
  ),
  530602 => 
  array (
    'id' => '530602',
    'name' => '昭阳区',
    'level' => 3,
    'pid' => '530600',
  ),
  530621 => 
  array (
    'id' => '530621',
    'name' => '鲁甸县',
    'level' => 3,
    'pid' => '530600',
  ),
  530622 => 
  array (
    'id' => '530622',
    'name' => '巧家县',
    'level' => 3,
    'pid' => '530600',
  ),
  530623 => 
  array (
    'id' => '530623',
    'name' => '盐津县',
    'level' => 3,
    'pid' => '530600',
  ),
  530624 => 
  array (
    'id' => '530624',
    'name' => '大关县',
    'level' => 3,
    'pid' => '530600',
  ),
  530625 => 
  array (
    'id' => '530625',
    'name' => '永善县',
    'level' => 3,
    'pid' => '530600',
  ),
  530626 => 
  array (
    'id' => '530626',
    'name' => '绥江县',
    'level' => 3,
    'pid' => '530600',
  ),
  530627 => 
  array (
    'id' => '530627',
    'name' => '镇雄县',
    'level' => 3,
    'pid' => '530600',
  ),
  530628 => 
  array (
    'id' => '530628',
    'name' => '彝良县',
    'level' => 3,
    'pid' => '530600',
  ),
  530629 => 
  array (
    'id' => '530629',
    'name' => '威信县',
    'level' => 3,
    'pid' => '530600',
  ),
  530630 => 
  array (
    'id' => '530630',
    'name' => '水富县',
    'level' => 3,
    'pid' => '530600',
  ),
  530700 => 
  array (
    'id' => '530700',
    'name' => '丽江市',
    'level' => 2,
    'pid' => '530000',
  ),
  530701 => 
  array (
    'id' => '530701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530700',
  ),
  530702 => 
  array (
    'id' => '530702',
    'name' => '古城区',
    'level' => 3,
    'pid' => '530700',
  ),
  530721 => 
  array (
    'id' => '530721',
    'name' => '玉龙纳西族自治县',
    'level' => 3,
    'pid' => '530700',
  ),
  530722 => 
  array (
    'id' => '530722',
    'name' => '永胜县',
    'level' => 3,
    'pid' => '530700',
  ),
  530723 => 
  array (
    'id' => '530723',
    'name' => '华坪县',
    'level' => 3,
    'pid' => '530700',
  ),
  530724 => 
  array (
    'id' => '530724',
    'name' => '宁蒗彝族自治县',
    'level' => 3,
    'pid' => '530700',
  ),
  530800 => 
  array (
    'id' => '530800',
    'name' => '普洱市',
    'level' => 2,
    'pid' => '530000',
  ),
  530801 => 
  array (
    'id' => '530801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530800',
  ),
  530802 => 
  array (
    'id' => '530802',
    'name' => '思茅区',
    'level' => 3,
    'pid' => '530800',
  ),
  530821 => 
  array (
    'id' => '530821',
    'name' => '宁洱哈尼族彝族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530822 => 
  array (
    'id' => '530822',
    'name' => '墨江哈尼族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530823 => 
  array (
    'id' => '530823',
    'name' => '景东彝族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530824 => 
  array (
    'id' => '530824',
    'name' => '景谷傣族彝族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530825 => 
  array (
    'id' => '530825',
    'name' => '镇沅彝族哈尼族拉祜族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530826 => 
  array (
    'id' => '530826',
    'name' => '江城哈尼族彝族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530827 => 
  array (
    'id' => '530827',
    'name' => '孟连傣族拉祜族佤族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530828 => 
  array (
    'id' => '530828',
    'name' => '澜沧拉祜族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530829 => 
  array (
    'id' => '530829',
    'name' => '西盟佤族自治县',
    'level' => 3,
    'pid' => '530800',
  ),
  530900 => 
  array (
    'id' => '530900',
    'name' => '临沧市',
    'level' => 2,
    'pid' => '530000',
  ),
  530901 => 
  array (
    'id' => '530901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '530900',
  ),
  530902 => 
  array (
    'id' => '530902',
    'name' => '临翔区',
    'level' => 3,
    'pid' => '530900',
  ),
  530921 => 
  array (
    'id' => '530921',
    'name' => '凤庆县',
    'level' => 3,
    'pid' => '530900',
  ),
  530922 => 
  array (
    'id' => '530922',
    'name' => '云县',
    'level' => 3,
    'pid' => '530900',
  ),
  530923 => 
  array (
    'id' => '530923',
    'name' => '永德县',
    'level' => 3,
    'pid' => '530900',
  ),
  530924 => 
  array (
    'id' => '530924',
    'name' => '镇康县',
    'level' => 3,
    'pid' => '530900',
  ),
  530925 => 
  array (
    'id' => '530925',
    'name' => '双江拉祜族佤族布朗族傣族自治县',
    'level' => 3,
    'pid' => '530900',
  ),
  530926 => 
  array (
    'id' => '530926',
    'name' => '耿马傣族佤族自治县',
    'level' => 3,
    'pid' => '530900',
  ),
  530927 => 
  array (
    'id' => '530927',
    'name' => '沧源佤族自治县',
    'level' => 3,
    'pid' => '530900',
  ),
  532300 => 
  array (
    'id' => '532300',
    'name' => '楚雄彝族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  532301 => 
  array (
    'id' => '532301',
    'name' => '楚雄市',
    'level' => 3,
    'pid' => '532300',
  ),
  532322 => 
  array (
    'id' => '532322',
    'name' => '双柏县',
    'level' => 3,
    'pid' => '532300',
  ),
  532323 => 
  array (
    'id' => '532323',
    'name' => '牟定县',
    'level' => 3,
    'pid' => '532300',
  ),
  532324 => 
  array (
    'id' => '532324',
    'name' => '南华县',
    'level' => 3,
    'pid' => '532300',
  ),
  532325 => 
  array (
    'id' => '532325',
    'name' => '姚安县',
    'level' => 3,
    'pid' => '532300',
  ),
  532326 => 
  array (
    'id' => '532326',
    'name' => '大姚县',
    'level' => 3,
    'pid' => '532300',
  ),
  532327 => 
  array (
    'id' => '532327',
    'name' => '永仁县',
    'level' => 3,
    'pid' => '532300',
  ),
  532328 => 
  array (
    'id' => '532328',
    'name' => '元谋县',
    'level' => 3,
    'pid' => '532300',
  ),
  532329 => 
  array (
    'id' => '532329',
    'name' => '武定县',
    'level' => 3,
    'pid' => '532300',
  ),
  532331 => 
  array (
    'id' => '532331',
    'name' => '禄丰县',
    'level' => 3,
    'pid' => '532300',
  ),
  532500 => 
  array (
    'id' => '532500',
    'name' => '红河哈尼族彝族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  532501 => 
  array (
    'id' => '532501',
    'name' => '个旧市',
    'level' => 3,
    'pid' => '532500',
  ),
  532502 => 
  array (
    'id' => '532502',
    'name' => '开远市',
    'level' => 3,
    'pid' => '532500',
  ),
  532503 => 
  array (
    'id' => '532503',
    'name' => '蒙自市',
    'level' => 3,
    'pid' => '532500',
  ),
  532504 => 
  array (
    'id' => '532504',
    'name' => '弥勒市',
    'level' => 3,
    'pid' => '532500',
  ),
  532523 => 
  array (
    'id' => '532523',
    'name' => '屏边苗族自治县',
    'level' => 3,
    'pid' => '532500',
  ),
  532524 => 
  array (
    'id' => '532524',
    'name' => '建水县',
    'level' => 3,
    'pid' => '532500',
  ),
  532525 => 
  array (
    'id' => '532525',
    'name' => '石屏县',
    'level' => 3,
    'pid' => '532500',
  ),
  532527 => 
  array (
    'id' => '532527',
    'name' => '泸西县',
    'level' => 3,
    'pid' => '532500',
  ),
  532528 => 
  array (
    'id' => '532528',
    'name' => '元阳县',
    'level' => 3,
    'pid' => '532500',
  ),
  532529 => 
  array (
    'id' => '532529',
    'name' => '红河县',
    'level' => 3,
    'pid' => '532500',
  ),
  532530 => 
  array (
    'id' => '532530',
    'name' => '金平苗族瑶族傣族自治县',
    'level' => 3,
    'pid' => '532500',
  ),
  532531 => 
  array (
    'id' => '532531',
    'name' => '绿春县',
    'level' => 3,
    'pid' => '532500',
  ),
  532532 => 
  array (
    'id' => '532532',
    'name' => '河口瑶族自治县',
    'level' => 3,
    'pid' => '532500',
  ),
  532600 => 
  array (
    'id' => '532600',
    'name' => '文山壮族苗族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  532601 => 
  array (
    'id' => '532601',
    'name' => '文山市',
    'level' => 3,
    'pid' => '532600',
  ),
  532622 => 
  array (
    'id' => '532622',
    'name' => '砚山县',
    'level' => 3,
    'pid' => '532600',
  ),
  532623 => 
  array (
    'id' => '532623',
    'name' => '西畴县',
    'level' => 3,
    'pid' => '532600',
  ),
  532624 => 
  array (
    'id' => '532624',
    'name' => '麻栗坡县',
    'level' => 3,
    'pid' => '532600',
  ),
  532625 => 
  array (
    'id' => '532625',
    'name' => '马关县',
    'level' => 3,
    'pid' => '532600',
  ),
  532626 => 
  array (
    'id' => '532626',
    'name' => '丘北县',
    'level' => 3,
    'pid' => '532600',
  ),
  532627 => 
  array (
    'id' => '532627',
    'name' => '广南县',
    'level' => 3,
    'pid' => '532600',
  ),
  532628 => 
  array (
    'id' => '532628',
    'name' => '富宁县',
    'level' => 3,
    'pid' => '532600',
  ),
  532800 => 
  array (
    'id' => '532800',
    'name' => '西双版纳傣族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  532801 => 
  array (
    'id' => '532801',
    'name' => '景洪市',
    'level' => 3,
    'pid' => '532800',
  ),
  532822 => 
  array (
    'id' => '532822',
    'name' => '勐海县',
    'level' => 3,
    'pid' => '532800',
  ),
  532823 => 
  array (
    'id' => '532823',
    'name' => '勐腊县',
    'level' => 3,
    'pid' => '532800',
  ),
  532900 => 
  array (
    'id' => '532900',
    'name' => '大理白族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  532901 => 
  array (
    'id' => '532901',
    'name' => '大理市',
    'level' => 3,
    'pid' => '532900',
  ),
  532922 => 
  array (
    'id' => '532922',
    'name' => '漾濞彝族自治县',
    'level' => 3,
    'pid' => '532900',
  ),
  532923 => 
  array (
    'id' => '532923',
    'name' => '祥云县',
    'level' => 3,
    'pid' => '532900',
  ),
  532924 => 
  array (
    'id' => '532924',
    'name' => '宾川县',
    'level' => 3,
    'pid' => '532900',
  ),
  532925 => 
  array (
    'id' => '532925',
    'name' => '弥渡县',
    'level' => 3,
    'pid' => '532900',
  ),
  532926 => 
  array (
    'id' => '532926',
    'name' => '南涧彝族自治县',
    'level' => 3,
    'pid' => '532900',
  ),
  532927 => 
  array (
    'id' => '532927',
    'name' => '巍山彝族回族自治县',
    'level' => 3,
    'pid' => '532900',
  ),
  532928 => 
  array (
    'id' => '532928',
    'name' => '永平县',
    'level' => 3,
    'pid' => '532900',
  ),
  532929 => 
  array (
    'id' => '532929',
    'name' => '云龙县',
    'level' => 3,
    'pid' => '532900',
  ),
  532930 => 
  array (
    'id' => '532930',
    'name' => '洱源县',
    'level' => 3,
    'pid' => '532900',
  ),
  532931 => 
  array (
    'id' => '532931',
    'name' => '剑川县',
    'level' => 3,
    'pid' => '532900',
  ),
  532932 => 
  array (
    'id' => '532932',
    'name' => '鹤庆县',
    'level' => 3,
    'pid' => '532900',
  ),
  533100 => 
  array (
    'id' => '533100',
    'name' => '德宏傣族景颇族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  533102 => 
  array (
    'id' => '533102',
    'name' => '瑞丽市',
    'level' => 3,
    'pid' => '533100',
  ),
  533103 => 
  array (
    'id' => '533103',
    'name' => '芒市',
    'level' => 3,
    'pid' => '533100',
  ),
  533122 => 
  array (
    'id' => '533122',
    'name' => '梁河县',
    'level' => 3,
    'pid' => '533100',
  ),
  533123 => 
  array (
    'id' => '533123',
    'name' => '盈江县',
    'level' => 3,
    'pid' => '533100',
  ),
  533124 => 
  array (
    'id' => '533124',
    'name' => '陇川县',
    'level' => 3,
    'pid' => '533100',
  ),
  533300 => 
  array (
    'id' => '533300',
    'name' => '怒江傈僳族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  533321 => 
  array (
    'id' => '533321',
    'name' => '泸水县',
    'level' => 3,
    'pid' => '533300',
  ),
  533323 => 
  array (
    'id' => '533323',
    'name' => '福贡县',
    'level' => 3,
    'pid' => '533300',
  ),
  533324 => 
  array (
    'id' => '533324',
    'name' => '贡山独龙族怒族自治县',
    'level' => 3,
    'pid' => '533300',
  ),
  533325 => 
  array (
    'id' => '533325',
    'name' => '兰坪白族普米族自治县',
    'level' => 3,
    'pid' => '533300',
  ),
  533400 => 
  array (
    'id' => '533400',
    'name' => '迪庆藏族自治州',
    'level' => 2,
    'pid' => '530000',
  ),
  533401 => 
  array (
    'id' => '533401',
    'name' => '香格里拉市',
    'level' => 3,
    'pid' => '533400',
  ),
  533422 => 
  array (
    'id' => '533422',
    'name' => '德钦县',
    'level' => 3,
    'pid' => '533400',
  ),
  533423 => 
  array (
    'id' => '533423',
    'name' => '维西傈僳族自治县',
    'level' => 3,
    'pid' => '533400',
  ),
  540000 => 
  array (
    'id' => '540000',
    'name' => '西藏自治区',
    'level' => 1,
    'pid' => 0,
  ),
  540100 => 
  array (
    'id' => '540100',
    'name' => '拉萨市',
    'level' => 2,
    'pid' => '540000',
  ),
  540101 => 
  array (
    'id' => '540101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '540100',
  ),
  540102 => 
  array (
    'id' => '540102',
    'name' => '城关区',
    'level' => 3,
    'pid' => '540100',
  ),
  540121 => 
  array (
    'id' => '540121',
    'name' => '林周县',
    'level' => 3,
    'pid' => '540100',
  ),
  540122 => 
  array (
    'id' => '540122',
    'name' => '当雄县',
    'level' => 3,
    'pid' => '540100',
  ),
  540123 => 
  array (
    'id' => '540123',
    'name' => '尼木县',
    'level' => 3,
    'pid' => '540100',
  ),
  540124 => 
  array (
    'id' => '540124',
    'name' => '曲水县',
    'level' => 3,
    'pid' => '540100',
  ),
  540125 => 
  array (
    'id' => '540125',
    'name' => '堆龙德庆县',
    'level' => 3,
    'pid' => '540100',
  ),
  540126 => 
  array (
    'id' => '540126',
    'name' => '达孜县',
    'level' => 3,
    'pid' => '540100',
  ),
  540127 => 
  array (
    'id' => '540127',
    'name' => '墨竹工卡县',
    'level' => 3,
    'pid' => '540100',
  ),
  540200 => 
  array (
    'id' => '540200',
    'name' => '日喀则市',
    'level' => 2,
    'pid' => '540000',
  ),
  540202 => 
  array (
    'id' => '540202',
    'name' => '桑珠孜区',
    'level' => 3,
    'pid' => '540200',
  ),
  540221 => 
  array (
    'id' => '540221',
    'name' => '南木林县',
    'level' => 3,
    'pid' => '540200',
  ),
  540222 => 
  array (
    'id' => '540222',
    'name' => '江孜县',
    'level' => 3,
    'pid' => '540200',
  ),
  540223 => 
  array (
    'id' => '540223',
    'name' => '定日县',
    'level' => 3,
    'pid' => '540200',
  ),
  540224 => 
  array (
    'id' => '540224',
    'name' => '萨迦县',
    'level' => 3,
    'pid' => '540200',
  ),
  540225 => 
  array (
    'id' => '540225',
    'name' => '拉孜县',
    'level' => 3,
    'pid' => '540200',
  ),
  540226 => 
  array (
    'id' => '540226',
    'name' => '昂仁县',
    'level' => 3,
    'pid' => '540200',
  ),
  540227 => 
  array (
    'id' => '540227',
    'name' => '谢通门县',
    'level' => 3,
    'pid' => '540200',
  ),
  540228 => 
  array (
    'id' => '540228',
    'name' => '白朗县',
    'level' => 3,
    'pid' => '540200',
  ),
  540229 => 
  array (
    'id' => '540229',
    'name' => '仁布县',
    'level' => 3,
    'pid' => '540200',
  ),
  540230 => 
  array (
    'id' => '540230',
    'name' => '康马县',
    'level' => 3,
    'pid' => '540200',
  ),
  540231 => 
  array (
    'id' => '540231',
    'name' => '定结县',
    'level' => 3,
    'pid' => '540200',
  ),
  540232 => 
  array (
    'id' => '540232',
    'name' => '仲巴县',
    'level' => 3,
    'pid' => '540200',
  ),
  540233 => 
  array (
    'id' => '540233',
    'name' => '亚东县',
    'level' => 3,
    'pid' => '540200',
  ),
  540234 => 
  array (
    'id' => '540234',
    'name' => '吉隆县',
    'level' => 3,
    'pid' => '540200',
  ),
  540235 => 
  array (
    'id' => '540235',
    'name' => '聂拉木县',
    'level' => 3,
    'pid' => '540200',
  ),
  540236 => 
  array (
    'id' => '540236',
    'name' => '萨嘎县',
    'level' => 3,
    'pid' => '540200',
  ),
  540237 => 
  array (
    'id' => '540237',
    'name' => '岗巴县',
    'level' => 3,
    'pid' => '540200',
  ),
  540300 => 
  array (
    'id' => '540300',
    'name' => '昌都市',
    'level' => 2,
    'pid' => '540000',
  ),
  540302 => 
  array (
    'id' => '540302',
    'name' => '卡若区',
    'level' => 3,
    'pid' => '540300',
  ),
  540321 => 
  array (
    'id' => '540321',
    'name' => '江达县',
    'level' => 3,
    'pid' => '540300',
  ),
  540322 => 
  array (
    'id' => '540322',
    'name' => '贡觉县',
    'level' => 3,
    'pid' => '540300',
  ),
  540323 => 
  array (
    'id' => '540323',
    'name' => '类乌齐县',
    'level' => 3,
    'pid' => '540300',
  ),
  540324 => 
  array (
    'id' => '540324',
    'name' => '丁青县',
    'level' => 3,
    'pid' => '540300',
  ),
  540325 => 
  array (
    'id' => '540325',
    'name' => '察雅县',
    'level' => 3,
    'pid' => '540300',
  ),
  540326 => 
  array (
    'id' => '540326',
    'name' => '八宿县',
    'level' => 3,
    'pid' => '540300',
  ),
  540327 => 
  array (
    'id' => '540327',
    'name' => '左贡县',
    'level' => 3,
    'pid' => '540300',
  ),
  540328 => 
  array (
    'id' => '540328',
    'name' => '芒康县',
    'level' => 3,
    'pid' => '540300',
  ),
  540329 => 
  array (
    'id' => '540329',
    'name' => '洛隆县',
    'level' => 3,
    'pid' => '540300',
  ),
  540330 => 
  array (
    'id' => '540330',
    'name' => '边坝县',
    'level' => 3,
    'pid' => '540300',
  ),
  540400 => 
  array (
    'id' => '540400',
    'name' => '林芝市',
    'level' => 2,
    'pid' => '540000',
  ),
  540402 => 
  array (
    'id' => '540402',
    'name' => '巴宜区',
    'level' => 3,
    'pid' => '540400',
  ),
  540421 => 
  array (
    'id' => '540421',
    'name' => '工布江达县',
    'level' => 3,
    'pid' => '540400',
  ),
  540422 => 
  array (
    'id' => '540422',
    'name' => '米林县',
    'level' => 3,
    'pid' => '540400',
  ),
  540423 => 
  array (
    'id' => '540423',
    'name' => '墨脱县',
    'level' => 3,
    'pid' => '540400',
  ),
  540424 => 
  array (
    'id' => '540424',
    'name' => '波密县',
    'level' => 3,
    'pid' => '540400',
  ),
  540425 => 
  array (
    'id' => '540425',
    'name' => '察隅县',
    'level' => 3,
    'pid' => '540400',
  ),
  540426 => 
  array (
    'id' => '540426',
    'name' => '朗县',
    'level' => 3,
    'pid' => '540400',
  ),
  542200 => 
  array (
    'id' => '542200',
    'name' => '山南地区',
    'level' => 2,
    'pid' => '540000',
  ),
  542221 => 
  array (
    'id' => '542221',
    'name' => '乃东县',
    'level' => 3,
    'pid' => '542200',
  ),
  542222 => 
  array (
    'id' => '542222',
    'name' => '扎囊县',
    'level' => 3,
    'pid' => '542200',
  ),
  542223 => 
  array (
    'id' => '542223',
    'name' => '贡嘎县',
    'level' => 3,
    'pid' => '542200',
  ),
  542224 => 
  array (
    'id' => '542224',
    'name' => '桑日县',
    'level' => 3,
    'pid' => '542200',
  ),
  542225 => 
  array (
    'id' => '542225',
    'name' => '琼结县',
    'level' => 3,
    'pid' => '542200',
  ),
  542226 => 
  array (
    'id' => '542226',
    'name' => '曲松县',
    'level' => 3,
    'pid' => '542200',
  ),
  542227 => 
  array (
    'id' => '542227',
    'name' => '措美县',
    'level' => 3,
    'pid' => '542200',
  ),
  542228 => 
  array (
    'id' => '542228',
    'name' => '洛扎县',
    'level' => 3,
    'pid' => '542200',
  ),
  542229 => 
  array (
    'id' => '542229',
    'name' => '加查县',
    'level' => 3,
    'pid' => '542200',
  ),
  542231 => 
  array (
    'id' => '542231',
    'name' => '隆子县',
    'level' => 3,
    'pid' => '542200',
  ),
  542232 => 
  array (
    'id' => '542232',
    'name' => '错那县',
    'level' => 3,
    'pid' => '542200',
  ),
  542233 => 
  array (
    'id' => '542233',
    'name' => '浪卡子县',
    'level' => 3,
    'pid' => '542200',
  ),
  542400 => 
  array (
    'id' => '542400',
    'name' => '那曲地区',
    'level' => 2,
    'pid' => '540000',
  ),
  542421 => 
  array (
    'id' => '542421',
    'name' => '那曲县',
    'level' => 3,
    'pid' => '542400',
  ),
  542422 => 
  array (
    'id' => '542422',
    'name' => '嘉黎县',
    'level' => 3,
    'pid' => '542400',
  ),
  542423 => 
  array (
    'id' => '542423',
    'name' => '比如县',
    'level' => 3,
    'pid' => '542400',
  ),
  542424 => 
  array (
    'id' => '542424',
    'name' => '聂荣县',
    'level' => 3,
    'pid' => '542400',
  ),
  542425 => 
  array (
    'id' => '542425',
    'name' => '安多县',
    'level' => 3,
    'pid' => '542400',
  ),
  542426 => 
  array (
    'id' => '542426',
    'name' => '申扎县',
    'level' => 3,
    'pid' => '542400',
  ),
  542427 => 
  array (
    'id' => '542427',
    'name' => '索县',
    'level' => 3,
    'pid' => '542400',
  ),
  542428 => 
  array (
    'id' => '542428',
    'name' => '班戈县',
    'level' => 3,
    'pid' => '542400',
  ),
  542429 => 
  array (
    'id' => '542429',
    'name' => '巴青县',
    'level' => 3,
    'pid' => '542400',
  ),
  542430 => 
  array (
    'id' => '542430',
    'name' => '尼玛县',
    'level' => 3,
    'pid' => '542400',
  ),
  542431 => 
  array (
    'id' => '542431',
    'name' => '双湖县',
    'level' => 3,
    'pid' => '542400',
  ),
  542500 => 
  array (
    'id' => '542500',
    'name' => '阿里地区',
    'level' => 2,
    'pid' => '540000',
  ),
  542521 => 
  array (
    'id' => '542521',
    'name' => '普兰县',
    'level' => 3,
    'pid' => '542500',
  ),
  542522 => 
  array (
    'id' => '542522',
    'name' => '札达县',
    'level' => 3,
    'pid' => '542500',
  ),
  542523 => 
  array (
    'id' => '542523',
    'name' => '噶尔县',
    'level' => 3,
    'pid' => '542500',
  ),
  542524 => 
  array (
    'id' => '542524',
    'name' => '日土县',
    'level' => 3,
    'pid' => '542500',
  ),
  542525 => 
  array (
    'id' => '542525',
    'name' => '革吉县',
    'level' => 3,
    'pid' => '542500',
  ),
  542526 => 
  array (
    'id' => '542526',
    'name' => '改则县',
    'level' => 3,
    'pid' => '542500',
  ),
  542527 => 
  array (
    'id' => '542527',
    'name' => '措勤县',
    'level' => 3,
    'pid' => '542500',
  ),
  610000 => 
  array (
    'id' => '610000',
    'name' => '陕西省',
    'level' => 1,
    'pid' => 0,
  ),
  610100 => 
  array (
    'id' => '610100',
    'name' => '西安市',
    'level' => 2,
    'pid' => '610000',
  ),
  610101 => 
  array (
    'id' => '610101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610100',
  ),
  610102 => 
  array (
    'id' => '610102',
    'name' => '新城区',
    'level' => 3,
    'pid' => '610100',
  ),
  610103 => 
  array (
    'id' => '610103',
    'name' => '碑林区',
    'level' => 3,
    'pid' => '610100',
  ),
  610104 => 
  array (
    'id' => '610104',
    'name' => '莲湖区',
    'level' => 3,
    'pid' => '610100',
  ),
  610111 => 
  array (
    'id' => '610111',
    'name' => '灞桥区',
    'level' => 3,
    'pid' => '610100',
  ),
  610112 => 
  array (
    'id' => '610112',
    'name' => '未央区',
    'level' => 3,
    'pid' => '610100',
  ),
  610113 => 
  array (
    'id' => '610113',
    'name' => '雁塔区',
    'level' => 3,
    'pid' => '610100',
  ),
  610114 => 
  array (
    'id' => '610114',
    'name' => '阎良区',
    'level' => 3,
    'pid' => '610100',
  ),
  610115 => 
  array (
    'id' => '610115',
    'name' => '临潼区',
    'level' => 3,
    'pid' => '610100',
  ),
  610116 => 
  array (
    'id' => '610116',
    'name' => '长安区',
    'level' => 3,
    'pid' => '610100',
  ),
  610117 => 
  array (
    'id' => '610117',
    'name' => '高陵区',
    'level' => 3,
    'pid' => '610100',
  ),
  610122 => 
  array (
    'id' => '610122',
    'name' => '蓝田县',
    'level' => 3,
    'pid' => '610100',
  ),
  610124 => 
  array (
    'id' => '610124',
    'name' => '周至县',
    'level' => 3,
    'pid' => '610100',
  ),
  610125 => 
  array (
    'id' => '610125',
    'name' => '户县',
    'level' => 3,
    'pid' => '610100',
  ),
  610200 => 
  array (
    'id' => '610200',
    'name' => '铜川市',
    'level' => 2,
    'pid' => '610000',
  ),
  610201 => 
  array (
    'id' => '610201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610200',
  ),
  610202 => 
  array (
    'id' => '610202',
    'name' => '王益区',
    'level' => 3,
    'pid' => '610200',
  ),
  610203 => 
  array (
    'id' => '610203',
    'name' => '印台区',
    'level' => 3,
    'pid' => '610200',
  ),
  610204 => 
  array (
    'id' => '610204',
    'name' => '耀州区',
    'level' => 3,
    'pid' => '610200',
  ),
  610222 => 
  array (
    'id' => '610222',
    'name' => '宜君县',
    'level' => 3,
    'pid' => '610200',
  ),
  610300 => 
  array (
    'id' => '610300',
    'name' => '宝鸡市',
    'level' => 2,
    'pid' => '610000',
  ),
  610301 => 
  array (
    'id' => '610301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610300',
  ),
  610302 => 
  array (
    'id' => '610302',
    'name' => '渭滨区',
    'level' => 3,
    'pid' => '610300',
  ),
  610303 => 
  array (
    'id' => '610303',
    'name' => '金台区',
    'level' => 3,
    'pid' => '610300',
  ),
  610304 => 
  array (
    'id' => '610304',
    'name' => '陈仓区',
    'level' => 3,
    'pid' => '610300',
  ),
  610322 => 
  array (
    'id' => '610322',
    'name' => '凤翔县',
    'level' => 3,
    'pid' => '610300',
  ),
  610323 => 
  array (
    'id' => '610323',
    'name' => '岐山县',
    'level' => 3,
    'pid' => '610300',
  ),
  610324 => 
  array (
    'id' => '610324',
    'name' => '扶风县',
    'level' => 3,
    'pid' => '610300',
  ),
  610326 => 
  array (
    'id' => '610326',
    'name' => '眉县',
    'level' => 3,
    'pid' => '610300',
  ),
  610327 => 
  array (
    'id' => '610327',
    'name' => '陇县',
    'level' => 3,
    'pid' => '610300',
  ),
  610328 => 
  array (
    'id' => '610328',
    'name' => '千阳县',
    'level' => 3,
    'pid' => '610300',
  ),
  610329 => 
  array (
    'id' => '610329',
    'name' => '麟游县',
    'level' => 3,
    'pid' => '610300',
  ),
  610330 => 
  array (
    'id' => '610330',
    'name' => '凤县',
    'level' => 3,
    'pid' => '610300',
  ),
  610331 => 
  array (
    'id' => '610331',
    'name' => '太白县',
    'level' => 3,
    'pid' => '610300',
  ),
  610400 => 
  array (
    'id' => '610400',
    'name' => '咸阳市',
    'level' => 2,
    'pid' => '610000',
  ),
  610401 => 
  array (
    'id' => '610401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610400',
  ),
  610402 => 
  array (
    'id' => '610402',
    'name' => '秦都区',
    'level' => 3,
    'pid' => '610400',
  ),
  610403 => 
  array (
    'id' => '610403',
    'name' => '杨陵区',
    'level' => 3,
    'pid' => '610400',
  ),
  610404 => 
  array (
    'id' => '610404',
    'name' => '渭城区',
    'level' => 3,
    'pid' => '610400',
  ),
  610422 => 
  array (
    'id' => '610422',
    'name' => '三原县',
    'level' => 3,
    'pid' => '610400',
  ),
  610423 => 
  array (
    'id' => '610423',
    'name' => '泾阳县',
    'level' => 3,
    'pid' => '610400',
  ),
  610424 => 
  array (
    'id' => '610424',
    'name' => '乾县',
    'level' => 3,
    'pid' => '610400',
  ),
  610425 => 
  array (
    'id' => '610425',
    'name' => '礼泉县',
    'level' => 3,
    'pid' => '610400',
  ),
  610426 => 
  array (
    'id' => '610426',
    'name' => '永寿县',
    'level' => 3,
    'pid' => '610400',
  ),
  610427 => 
  array (
    'id' => '610427',
    'name' => '彬县',
    'level' => 3,
    'pid' => '610400',
  ),
  610428 => 
  array (
    'id' => '610428',
    'name' => '长武县',
    'level' => 3,
    'pid' => '610400',
  ),
  610429 => 
  array (
    'id' => '610429',
    'name' => '旬邑县',
    'level' => 3,
    'pid' => '610400',
  ),
  610430 => 
  array (
    'id' => '610430',
    'name' => '淳化县',
    'level' => 3,
    'pid' => '610400',
  ),
  610431 => 
  array (
    'id' => '610431',
    'name' => '武功县',
    'level' => 3,
    'pid' => '610400',
  ),
  610481 => 
  array (
    'id' => '610481',
    'name' => '兴平市',
    'level' => 3,
    'pid' => '610400',
  ),
  610500 => 
  array (
    'id' => '610500',
    'name' => '渭南市',
    'level' => 2,
    'pid' => '610000',
  ),
  610501 => 
  array (
    'id' => '610501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610500',
  ),
  610502 => 
  array (
    'id' => '610502',
    'name' => '临渭区',
    'level' => 3,
    'pid' => '610500',
  ),
  610521 => 
  array (
    'id' => '610521',
    'name' => '华县',
    'level' => 3,
    'pid' => '610500',
  ),
  610522 => 
  array (
    'id' => '610522',
    'name' => '潼关县',
    'level' => 3,
    'pid' => '610500',
  ),
  610523 => 
  array (
    'id' => '610523',
    'name' => '大荔县',
    'level' => 3,
    'pid' => '610500',
  ),
  610524 => 
  array (
    'id' => '610524',
    'name' => '合阳县',
    'level' => 3,
    'pid' => '610500',
  ),
  610525 => 
  array (
    'id' => '610525',
    'name' => '澄城县',
    'level' => 3,
    'pid' => '610500',
  ),
  610526 => 
  array (
    'id' => '610526',
    'name' => '蒲城县',
    'level' => 3,
    'pid' => '610500',
  ),
  610527 => 
  array (
    'id' => '610527',
    'name' => '白水县',
    'level' => 3,
    'pid' => '610500',
  ),
  610528 => 
  array (
    'id' => '610528',
    'name' => '富平县',
    'level' => 3,
    'pid' => '610500',
  ),
  610581 => 
  array (
    'id' => '610581',
    'name' => '韩城市',
    'level' => 3,
    'pid' => '610500',
  ),
  610582 => 
  array (
    'id' => '610582',
    'name' => '华阴市',
    'level' => 3,
    'pid' => '610500',
  ),
  610600 => 
  array (
    'id' => '610600',
    'name' => '延安市',
    'level' => 2,
    'pid' => '610000',
  ),
  610601 => 
  array (
    'id' => '610601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610600',
  ),
  610602 => 
  array (
    'id' => '610602',
    'name' => '宝塔区',
    'level' => 3,
    'pid' => '610600',
  ),
  610621 => 
  array (
    'id' => '610621',
    'name' => '延长县',
    'level' => 3,
    'pid' => '610600',
  ),
  610622 => 
  array (
    'id' => '610622',
    'name' => '延川县',
    'level' => 3,
    'pid' => '610600',
  ),
  610623 => 
  array (
    'id' => '610623',
    'name' => '子长县',
    'level' => 3,
    'pid' => '610600',
  ),
  610624 => 
  array (
    'id' => '610624',
    'name' => '安塞县',
    'level' => 3,
    'pid' => '610600',
  ),
  610625 => 
  array (
    'id' => '610625',
    'name' => '志丹县',
    'level' => 3,
    'pid' => '610600',
  ),
  610626 => 
  array (
    'id' => '610626',
    'name' => '吴起县',
    'level' => 3,
    'pid' => '610600',
  ),
  610627 => 
  array (
    'id' => '610627',
    'name' => '甘泉县',
    'level' => 3,
    'pid' => '610600',
  ),
  610628 => 
  array (
    'id' => '610628',
    'name' => '富县',
    'level' => 3,
    'pid' => '610600',
  ),
  610629 => 
  array (
    'id' => '610629',
    'name' => '洛川县',
    'level' => 3,
    'pid' => '610600',
  ),
  610630 => 
  array (
    'id' => '610630',
    'name' => '宜川县',
    'level' => 3,
    'pid' => '610600',
  ),
  610631 => 
  array (
    'id' => '610631',
    'name' => '黄龙县',
    'level' => 3,
    'pid' => '610600',
  ),
  610632 => 
  array (
    'id' => '610632',
    'name' => '黄陵县',
    'level' => 3,
    'pid' => '610600',
  ),
  610700 => 
  array (
    'id' => '610700',
    'name' => '汉中市',
    'level' => 2,
    'pid' => '610000',
  ),
  610701 => 
  array (
    'id' => '610701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610700',
  ),
  610702 => 
  array (
    'id' => '610702',
    'name' => '汉台区',
    'level' => 3,
    'pid' => '610700',
  ),
  610721 => 
  array (
    'id' => '610721',
    'name' => '南郑县',
    'level' => 3,
    'pid' => '610700',
  ),
  610722 => 
  array (
    'id' => '610722',
    'name' => '城固县',
    'level' => 3,
    'pid' => '610700',
  ),
  610723 => 
  array (
    'id' => '610723',
    'name' => '洋县',
    'level' => 3,
    'pid' => '610700',
  ),
  610724 => 
  array (
    'id' => '610724',
    'name' => '西乡县',
    'level' => 3,
    'pid' => '610700',
  ),
  610725 => 
  array (
    'id' => '610725',
    'name' => '勉县',
    'level' => 3,
    'pid' => '610700',
  ),
  610726 => 
  array (
    'id' => '610726',
    'name' => '宁强县',
    'level' => 3,
    'pid' => '610700',
  ),
  610727 => 
  array (
    'id' => '610727',
    'name' => '略阳县',
    'level' => 3,
    'pid' => '610700',
  ),
  610728 => 
  array (
    'id' => '610728',
    'name' => '镇巴县',
    'level' => 3,
    'pid' => '610700',
  ),
  610729 => 
  array (
    'id' => '610729',
    'name' => '留坝县',
    'level' => 3,
    'pid' => '610700',
  ),
  610730 => 
  array (
    'id' => '610730',
    'name' => '佛坪县',
    'level' => 3,
    'pid' => '610700',
  ),
  610800 => 
  array (
    'id' => '610800',
    'name' => '榆林市',
    'level' => 2,
    'pid' => '610000',
  ),
  610801 => 
  array (
    'id' => '610801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610800',
  ),
  610802 => 
  array (
    'id' => '610802',
    'name' => '榆阳区',
    'level' => 3,
    'pid' => '610800',
  ),
  610821 => 
  array (
    'id' => '610821',
    'name' => '神木县',
    'level' => 3,
    'pid' => '610800',
  ),
  610822 => 
  array (
    'id' => '610822',
    'name' => '府谷县',
    'level' => 3,
    'pid' => '610800',
  ),
  610823 => 
  array (
    'id' => '610823',
    'name' => '横山县',
    'level' => 3,
    'pid' => '610800',
  ),
  610824 => 
  array (
    'id' => '610824',
    'name' => '靖边县',
    'level' => 3,
    'pid' => '610800',
  ),
  610825 => 
  array (
    'id' => '610825',
    'name' => '定边县',
    'level' => 3,
    'pid' => '610800',
  ),
  610826 => 
  array (
    'id' => '610826',
    'name' => '绥德县',
    'level' => 3,
    'pid' => '610800',
  ),
  610827 => 
  array (
    'id' => '610827',
    'name' => '米脂县',
    'level' => 3,
    'pid' => '610800',
  ),
  610828 => 
  array (
    'id' => '610828',
    'name' => '佳县',
    'level' => 3,
    'pid' => '610800',
  ),
  610829 => 
  array (
    'id' => '610829',
    'name' => '吴堡县',
    'level' => 3,
    'pid' => '610800',
  ),
  610830 => 
  array (
    'id' => '610830',
    'name' => '清涧县',
    'level' => 3,
    'pid' => '610800',
  ),
  610831 => 
  array (
    'id' => '610831',
    'name' => '子洲县',
    'level' => 3,
    'pid' => '610800',
  ),
  610900 => 
  array (
    'id' => '610900',
    'name' => '安康市',
    'level' => 2,
    'pid' => '610000',
  ),
  610901 => 
  array (
    'id' => '610901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '610900',
  ),
  610902 => 
  array (
    'id' => '610902',
    'name' => '汉滨区',
    'level' => 3,
    'pid' => '610900',
  ),
  610921 => 
  array (
    'id' => '610921',
    'name' => '汉阴县',
    'level' => 3,
    'pid' => '610900',
  ),
  610922 => 
  array (
    'id' => '610922',
    'name' => '石泉县',
    'level' => 3,
    'pid' => '610900',
  ),
  610923 => 
  array (
    'id' => '610923',
    'name' => '宁陕县',
    'level' => 3,
    'pid' => '610900',
  ),
  610924 => 
  array (
    'id' => '610924',
    'name' => '紫阳县',
    'level' => 3,
    'pid' => '610900',
  ),
  610925 => 
  array (
    'id' => '610925',
    'name' => '岚皋县',
    'level' => 3,
    'pid' => '610900',
  ),
  610926 => 
  array (
    'id' => '610926',
    'name' => '平利县',
    'level' => 3,
    'pid' => '610900',
  ),
  610927 => 
  array (
    'id' => '610927',
    'name' => '镇坪县',
    'level' => 3,
    'pid' => '610900',
  ),
  610928 => 
  array (
    'id' => '610928',
    'name' => '旬阳县',
    'level' => 3,
    'pid' => '610900',
  ),
  610929 => 
  array (
    'id' => '610929',
    'name' => '白河县',
    'level' => 3,
    'pid' => '610900',
  ),
  611000 => 
  array (
    'id' => '611000',
    'name' => '商洛市',
    'level' => 2,
    'pid' => '610000',
  ),
  611001 => 
  array (
    'id' => '611001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '611000',
  ),
  611002 => 
  array (
    'id' => '611002',
    'name' => '商州区',
    'level' => 3,
    'pid' => '611000',
  ),
  611021 => 
  array (
    'id' => '611021',
    'name' => '洛南县',
    'level' => 3,
    'pid' => '611000',
  ),
  611022 => 
  array (
    'id' => '611022',
    'name' => '丹凤县',
    'level' => 3,
    'pid' => '611000',
  ),
  611023 => 
  array (
    'id' => '611023',
    'name' => '商南县',
    'level' => 3,
    'pid' => '611000',
  ),
  611024 => 
  array (
    'id' => '611024',
    'name' => '山阳县',
    'level' => 3,
    'pid' => '611000',
  ),
  611025 => 
  array (
    'id' => '611025',
    'name' => '镇安县',
    'level' => 3,
    'pid' => '611000',
  ),
  611026 => 
  array (
    'id' => '611026',
    'name' => '柞水县',
    'level' => 3,
    'pid' => '611000',
  ),
  620000 => 
  array (
    'id' => '620000',
    'name' => '甘肃省',
    'level' => 1,
    'pid' => 0,
  ),
  620100 => 
  array (
    'id' => '620100',
    'name' => '兰州市',
    'level' => 2,
    'pid' => '620000',
  ),
  620101 => 
  array (
    'id' => '620101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620100',
  ),
  620102 => 
  array (
    'id' => '620102',
    'name' => '城关区',
    'level' => 3,
    'pid' => '620100',
  ),
  620103 => 
  array (
    'id' => '620103',
    'name' => '七里河区',
    'level' => 3,
    'pid' => '620100',
  ),
  620104 => 
  array (
    'id' => '620104',
    'name' => '西固区',
    'level' => 3,
    'pid' => '620100',
  ),
  620105 => 
  array (
    'id' => '620105',
    'name' => '安宁区',
    'level' => 3,
    'pid' => '620100',
  ),
  620111 => 
  array (
    'id' => '620111',
    'name' => '红古区',
    'level' => 3,
    'pid' => '620100',
  ),
  620121 => 
  array (
    'id' => '620121',
    'name' => '永登县',
    'level' => 3,
    'pid' => '620100',
  ),
  620122 => 
  array (
    'id' => '620122',
    'name' => '皋兰县',
    'level' => 3,
    'pid' => '620100',
  ),
  620123 => 
  array (
    'id' => '620123',
    'name' => '榆中县',
    'level' => 3,
    'pid' => '620100',
  ),
  620200 => 
  array (
    'id' => '620200',
    'name' => '嘉峪关市',
    'level' => 2,
    'pid' => '620000',
  ),
  620201 => 
  array (
    'id' => '620201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620200',
  ),
  620300 => 
  array (
    'id' => '620300',
    'name' => '金昌市',
    'level' => 2,
    'pid' => '620000',
  ),
  620301 => 
  array (
    'id' => '620301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620300',
  ),
  620302 => 
  array (
    'id' => '620302',
    'name' => '金川区',
    'level' => 3,
    'pid' => '620300',
  ),
  620321 => 
  array (
    'id' => '620321',
    'name' => '永昌县',
    'level' => 3,
    'pid' => '620300',
  ),
  620400 => 
  array (
    'id' => '620400',
    'name' => '白银市',
    'level' => 2,
    'pid' => '620000',
  ),
  620401 => 
  array (
    'id' => '620401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620400',
  ),
  620402 => 
  array (
    'id' => '620402',
    'name' => '白银区',
    'level' => 3,
    'pid' => '620400',
  ),
  620403 => 
  array (
    'id' => '620403',
    'name' => '平川区',
    'level' => 3,
    'pid' => '620400',
  ),
  620421 => 
  array (
    'id' => '620421',
    'name' => '靖远县',
    'level' => 3,
    'pid' => '620400',
  ),
  620422 => 
  array (
    'id' => '620422',
    'name' => '会宁县',
    'level' => 3,
    'pid' => '620400',
  ),
  620423 => 
  array (
    'id' => '620423',
    'name' => '景泰县',
    'level' => 3,
    'pid' => '620400',
  ),
  620500 => 
  array (
    'id' => '620500',
    'name' => '天水市',
    'level' => 2,
    'pid' => '620000',
  ),
  620501 => 
  array (
    'id' => '620501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620500',
  ),
  620502 => 
  array (
    'id' => '620502',
    'name' => '秦州区',
    'level' => 3,
    'pid' => '620500',
  ),
  620503 => 
  array (
    'id' => '620503',
    'name' => '麦积区',
    'level' => 3,
    'pid' => '620500',
  ),
  620521 => 
  array (
    'id' => '620521',
    'name' => '清水县',
    'level' => 3,
    'pid' => '620500',
  ),
  620522 => 
  array (
    'id' => '620522',
    'name' => '秦安县',
    'level' => 3,
    'pid' => '620500',
  ),
  620523 => 
  array (
    'id' => '620523',
    'name' => '甘谷县',
    'level' => 3,
    'pid' => '620500',
  ),
  620524 => 
  array (
    'id' => '620524',
    'name' => '武山县',
    'level' => 3,
    'pid' => '620500',
  ),
  620525 => 
  array (
    'id' => '620525',
    'name' => '张家川回族自治县',
    'level' => 3,
    'pid' => '620500',
  ),
  620600 => 
  array (
    'id' => '620600',
    'name' => '武威市',
    'level' => 2,
    'pid' => '620000',
  ),
  620601 => 
  array (
    'id' => '620601',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620600',
  ),
  620602 => 
  array (
    'id' => '620602',
    'name' => '凉州区',
    'level' => 3,
    'pid' => '620600',
  ),
  620621 => 
  array (
    'id' => '620621',
    'name' => '民勤县',
    'level' => 3,
    'pid' => '620600',
  ),
  620622 => 
  array (
    'id' => '620622',
    'name' => '古浪县',
    'level' => 3,
    'pid' => '620600',
  ),
  620623 => 
  array (
    'id' => '620623',
    'name' => '天祝藏族自治县',
    'level' => 3,
    'pid' => '620600',
  ),
  620700 => 
  array (
    'id' => '620700',
    'name' => '张掖市',
    'level' => 2,
    'pid' => '620000',
  ),
  620701 => 
  array (
    'id' => '620701',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620700',
  ),
  620702 => 
  array (
    'id' => '620702',
    'name' => '甘州区',
    'level' => 3,
    'pid' => '620700',
  ),
  620721 => 
  array (
    'id' => '620721',
    'name' => '肃南裕固族自治县',
    'level' => 3,
    'pid' => '620700',
  ),
  620722 => 
  array (
    'id' => '620722',
    'name' => '民乐县',
    'level' => 3,
    'pid' => '620700',
  ),
  620723 => 
  array (
    'id' => '620723',
    'name' => '临泽县',
    'level' => 3,
    'pid' => '620700',
  ),
  620724 => 
  array (
    'id' => '620724',
    'name' => '高台县',
    'level' => 3,
    'pid' => '620700',
  ),
  620725 => 
  array (
    'id' => '620725',
    'name' => '山丹县',
    'level' => 3,
    'pid' => '620700',
  ),
  620800 => 
  array (
    'id' => '620800',
    'name' => '平凉市',
    'level' => 2,
    'pid' => '620000',
  ),
  620801 => 
  array (
    'id' => '620801',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620800',
  ),
  620802 => 
  array (
    'id' => '620802',
    'name' => '崆峒区',
    'level' => 3,
    'pid' => '620800',
  ),
  620821 => 
  array (
    'id' => '620821',
    'name' => '泾川县',
    'level' => 3,
    'pid' => '620800',
  ),
  620822 => 
  array (
    'id' => '620822',
    'name' => '灵台县',
    'level' => 3,
    'pid' => '620800',
  ),
  620823 => 
  array (
    'id' => '620823',
    'name' => '崇信县',
    'level' => 3,
    'pid' => '620800',
  ),
  620824 => 
  array (
    'id' => '620824',
    'name' => '华亭县',
    'level' => 3,
    'pid' => '620800',
  ),
  620825 => 
  array (
    'id' => '620825',
    'name' => '庄浪县',
    'level' => 3,
    'pid' => '620800',
  ),
  620826 => 
  array (
    'id' => '620826',
    'name' => '静宁县',
    'level' => 3,
    'pid' => '620800',
  ),
  620900 => 
  array (
    'id' => '620900',
    'name' => '酒泉市',
    'level' => 2,
    'pid' => '620000',
  ),
  620901 => 
  array (
    'id' => '620901',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '620900',
  ),
  620902 => 
  array (
    'id' => '620902',
    'name' => '肃州区',
    'level' => 3,
    'pid' => '620900',
  ),
  620921 => 
  array (
    'id' => '620921',
    'name' => '金塔县',
    'level' => 3,
    'pid' => '620900',
  ),
  620922 => 
  array (
    'id' => '620922',
    'name' => '瓜州县',
    'level' => 3,
    'pid' => '620900',
  ),
  620923 => 
  array (
    'id' => '620923',
    'name' => '肃北蒙古族自治县',
    'level' => 3,
    'pid' => '620900',
  ),
  620924 => 
  array (
    'id' => '620924',
    'name' => '阿克塞哈萨克族自治县',
    'level' => 3,
    'pid' => '620900',
  ),
  620981 => 
  array (
    'id' => '620981',
    'name' => '玉门市',
    'level' => 3,
    'pid' => '620900',
  ),
  620982 => 
  array (
    'id' => '620982',
    'name' => '敦煌市',
    'level' => 3,
    'pid' => '620900',
  ),
  621000 => 
  array (
    'id' => '621000',
    'name' => '庆阳市',
    'level' => 2,
    'pid' => '620000',
  ),
  621001 => 
  array (
    'id' => '621001',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '621000',
  ),
  621002 => 
  array (
    'id' => '621002',
    'name' => '西峰区',
    'level' => 3,
    'pid' => '621000',
  ),
  621021 => 
  array (
    'id' => '621021',
    'name' => '庆城县',
    'level' => 3,
    'pid' => '621000',
  ),
  621022 => 
  array (
    'id' => '621022',
    'name' => '环县',
    'level' => 3,
    'pid' => '621000',
  ),
  621023 => 
  array (
    'id' => '621023',
    'name' => '华池县',
    'level' => 3,
    'pid' => '621000',
  ),
  621024 => 
  array (
    'id' => '621024',
    'name' => '合水县',
    'level' => 3,
    'pid' => '621000',
  ),
  621025 => 
  array (
    'id' => '621025',
    'name' => '正宁县',
    'level' => 3,
    'pid' => '621000',
  ),
  621026 => 
  array (
    'id' => '621026',
    'name' => '宁县',
    'level' => 3,
    'pid' => '621000',
  ),
  621027 => 
  array (
    'id' => '621027',
    'name' => '镇原县',
    'level' => 3,
    'pid' => '621000',
  ),
  621100 => 
  array (
    'id' => '621100',
    'name' => '定西市',
    'level' => 2,
    'pid' => '620000',
  ),
  621101 => 
  array (
    'id' => '621101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '621100',
  ),
  621102 => 
  array (
    'id' => '621102',
    'name' => '安定区',
    'level' => 3,
    'pid' => '621100',
  ),
  621121 => 
  array (
    'id' => '621121',
    'name' => '通渭县',
    'level' => 3,
    'pid' => '621100',
  ),
  621122 => 
  array (
    'id' => '621122',
    'name' => '陇西县',
    'level' => 3,
    'pid' => '621100',
  ),
  621123 => 
  array (
    'id' => '621123',
    'name' => '渭源县',
    'level' => 3,
    'pid' => '621100',
  ),
  621124 => 
  array (
    'id' => '621124',
    'name' => '临洮县',
    'level' => 3,
    'pid' => '621100',
  ),
  621125 => 
  array (
    'id' => '621125',
    'name' => '漳县',
    'level' => 3,
    'pid' => '621100',
  ),
  621126 => 
  array (
    'id' => '621126',
    'name' => '岷县',
    'level' => 3,
    'pid' => '621100',
  ),
  621200 => 
  array (
    'id' => '621200',
    'name' => '陇南市',
    'level' => 2,
    'pid' => '620000',
  ),
  621201 => 
  array (
    'id' => '621201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '621200',
  ),
  621202 => 
  array (
    'id' => '621202',
    'name' => '武都区',
    'level' => 3,
    'pid' => '621200',
  ),
  621221 => 
  array (
    'id' => '621221',
    'name' => '成县',
    'level' => 3,
    'pid' => '621200',
  ),
  621222 => 
  array (
    'id' => '621222',
    'name' => '文县',
    'level' => 3,
    'pid' => '621200',
  ),
  621223 => 
  array (
    'id' => '621223',
    'name' => '宕昌县',
    'level' => 3,
    'pid' => '621200',
  ),
  621224 => 
  array (
    'id' => '621224',
    'name' => '康县',
    'level' => 3,
    'pid' => '621200',
  ),
  621225 => 
  array (
    'id' => '621225',
    'name' => '西和县',
    'level' => 3,
    'pid' => '621200',
  ),
  621226 => 
  array (
    'id' => '621226',
    'name' => '礼县',
    'level' => 3,
    'pid' => '621200',
  ),
  621227 => 
  array (
    'id' => '621227',
    'name' => '徽县',
    'level' => 3,
    'pid' => '621200',
  ),
  621228 => 
  array (
    'id' => '621228',
    'name' => '两当县',
    'level' => 3,
    'pid' => '621200',
  ),
  622900 => 
  array (
    'id' => '622900',
    'name' => '临夏回族自治州',
    'level' => 2,
    'pid' => '620000',
  ),
  622901 => 
  array (
    'id' => '622901',
    'name' => '临夏市',
    'level' => 3,
    'pid' => '622900',
  ),
  622921 => 
  array (
    'id' => '622921',
    'name' => '临夏县',
    'level' => 3,
    'pid' => '622900',
  ),
  622922 => 
  array (
    'id' => '622922',
    'name' => '康乐县',
    'level' => 3,
    'pid' => '622900',
  ),
  622923 => 
  array (
    'id' => '622923',
    'name' => '永靖县',
    'level' => 3,
    'pid' => '622900',
  ),
  622924 => 
  array (
    'id' => '622924',
    'name' => '广河县',
    'level' => 3,
    'pid' => '622900',
  ),
  622925 => 
  array (
    'id' => '622925',
    'name' => '和政县',
    'level' => 3,
    'pid' => '622900',
  ),
  622926 => 
  array (
    'id' => '622926',
    'name' => '东乡族自治县',
    'level' => 3,
    'pid' => '622900',
  ),
  622927 => 
  array (
    'id' => '622927',
    'name' => '积石山保安族东乡族撒拉族自治县',
    'level' => 3,
    'pid' => '622900',
  ),
  623000 => 
  array (
    'id' => '623000',
    'name' => '甘南藏族自治州',
    'level' => 2,
    'pid' => '620000',
  ),
  623001 => 
  array (
    'id' => '623001',
    'name' => '合作市',
    'level' => 3,
    'pid' => '623000',
  ),
  623021 => 
  array (
    'id' => '623021',
    'name' => '临潭县',
    'level' => 3,
    'pid' => '623000',
  ),
  623022 => 
  array (
    'id' => '623022',
    'name' => '卓尼县',
    'level' => 3,
    'pid' => '623000',
  ),
  623023 => 
  array (
    'id' => '623023',
    'name' => '舟曲县',
    'level' => 3,
    'pid' => '623000',
  ),
  623024 => 
  array (
    'id' => '623024',
    'name' => '迭部县',
    'level' => 3,
    'pid' => '623000',
  ),
  623025 => 
  array (
    'id' => '623025',
    'name' => '玛曲县',
    'level' => 3,
    'pid' => '623000',
  ),
  623026 => 
  array (
    'id' => '623026',
    'name' => '碌曲县',
    'level' => 3,
    'pid' => '623000',
  ),
  623027 => 
  array (
    'id' => '623027',
    'name' => '夏河县',
    'level' => 3,
    'pid' => '623000',
  ),
  630000 => 
  array (
    'id' => '630000',
    'name' => '青海省',
    'level' => 1,
    'pid' => 0,
  ),
  630100 => 
  array (
    'id' => '630100',
    'name' => '西宁市',
    'level' => 2,
    'pid' => '630000',
  ),
  630101 => 
  array (
    'id' => '630101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '630100',
  ),
  630102 => 
  array (
    'id' => '630102',
    'name' => '城东区',
    'level' => 3,
    'pid' => '630100',
  ),
  630103 => 
  array (
    'id' => '630103',
    'name' => '城中区',
    'level' => 3,
    'pid' => '630100',
  ),
  630104 => 
  array (
    'id' => '630104',
    'name' => '城西区',
    'level' => 3,
    'pid' => '630100',
  ),
  630105 => 
  array (
    'id' => '630105',
    'name' => '城北区',
    'level' => 3,
    'pid' => '630100',
  ),
  630121 => 
  array (
    'id' => '630121',
    'name' => '大通回族土族自治县',
    'level' => 3,
    'pid' => '630100',
  ),
  630122 => 
  array (
    'id' => '630122',
    'name' => '湟中县',
    'level' => 3,
    'pid' => '630100',
  ),
  630123 => 
  array (
    'id' => '630123',
    'name' => '湟源县',
    'level' => 3,
    'pid' => '630100',
  ),
  630200 => 
  array (
    'id' => '630200',
    'name' => '海东市',
    'level' => 2,
    'pid' => '630000',
  ),
  630202 => 
  array (
    'id' => '630202',
    'name' => '乐都区',
    'level' => 3,
    'pid' => '630200',
  ),
  630203 => 
  array (
    'id' => '630203',
    'name' => '平安区',
    'level' => 3,
    'pid' => '630200',
  ),
  630222 => 
  array (
    'id' => '630222',
    'name' => '民和回族土族自治县',
    'level' => 3,
    'pid' => '630200',
  ),
  630223 => 
  array (
    'id' => '630223',
    'name' => '互助土族自治县',
    'level' => 3,
    'pid' => '630200',
  ),
  630224 => 
  array (
    'id' => '630224',
    'name' => '化隆回族自治县',
    'level' => 3,
    'pid' => '630200',
  ),
  630225 => 
  array (
    'id' => '630225',
    'name' => '循化撒拉族自治县',
    'level' => 3,
    'pid' => '630200',
  ),
  632200 => 
  array (
    'id' => '632200',
    'name' => '海北藏族自治州',
    'level' => 2,
    'pid' => '630000',
  ),
  632221 => 
  array (
    'id' => '632221',
    'name' => '门源回族自治县',
    'level' => 3,
    'pid' => '632200',
  ),
  632222 => 
  array (
    'id' => '632222',
    'name' => '祁连县',
    'level' => 3,
    'pid' => '632200',
  ),
  632223 => 
  array (
    'id' => '632223',
    'name' => '海晏县',
    'level' => 3,
    'pid' => '632200',
  ),
  632224 => 
  array (
    'id' => '632224',
    'name' => '刚察县',
    'level' => 3,
    'pid' => '632200',
  ),
  632300 => 
  array (
    'id' => '632300',
    'name' => '黄南藏族自治州',
    'level' => 2,
    'pid' => '630000',
  ),
  632321 => 
  array (
    'id' => '632321',
    'name' => '同仁县',
    'level' => 3,
    'pid' => '632300',
  ),
  632322 => 
  array (
    'id' => '632322',
    'name' => '尖扎县',
    'level' => 3,
    'pid' => '632300',
  ),
  632323 => 
  array (
    'id' => '632323',
    'name' => '泽库县',
    'level' => 3,
    'pid' => '632300',
  ),
  632324 => 
  array (
    'id' => '632324',
    'name' => '河南蒙古族自治县',
    'level' => 3,
    'pid' => '632300',
  ),
  632500 => 
  array (
    'id' => '632500',
    'name' => '海南藏族自治州',
    'level' => 2,
    'pid' => '630000',
  ),
  632521 => 
  array (
    'id' => '632521',
    'name' => '共和县',
    'level' => 3,
    'pid' => '632500',
  ),
  632522 => 
  array (
    'id' => '632522',
    'name' => '同德县',
    'level' => 3,
    'pid' => '632500',
  ),
  632523 => 
  array (
    'id' => '632523',
    'name' => '贵德县',
    'level' => 3,
    'pid' => '632500',
  ),
  632524 => 
  array (
    'id' => '632524',
    'name' => '兴海县',
    'level' => 3,
    'pid' => '632500',
  ),
  632525 => 
  array (
    'id' => '632525',
    'name' => '贵南县',
    'level' => 3,
    'pid' => '632500',
  ),
  632600 => 
  array (
    'id' => '632600',
    'name' => '果洛藏族自治州',
    'level' => 2,
    'pid' => '630000',
  ),
  632621 => 
  array (
    'id' => '632621',
    'name' => '玛沁县',
    'level' => 3,
    'pid' => '632600',
  ),
  632622 => 
  array (
    'id' => '632622',
    'name' => '班玛县',
    'level' => 3,
    'pid' => '632600',
  ),
  632623 => 
  array (
    'id' => '632623',
    'name' => '甘德县',
    'level' => 3,
    'pid' => '632600',
  ),
  632624 => 
  array (
    'id' => '632624',
    'name' => '达日县',
    'level' => 3,
    'pid' => '632600',
  ),
  632625 => 
  array (
    'id' => '632625',
    'name' => '久治县',
    'level' => 3,
    'pid' => '632600',
  ),
  632626 => 
  array (
    'id' => '632626',
    'name' => '玛多县',
    'level' => 3,
    'pid' => '632600',
  ),
  632700 => 
  array (
    'id' => '632700',
    'name' => '玉树藏族自治州',
    'level' => 2,
    'pid' => '630000',
  ),
  632701 => 
  array (
    'id' => '632701',
    'name' => '玉树市',
    'level' => 3,
    'pid' => '632700',
  ),
  632722 => 
  array (
    'id' => '632722',
    'name' => '杂多县',
    'level' => 3,
    'pid' => '632700',
  ),
  632723 => 
  array (
    'id' => '632723',
    'name' => '称多县',
    'level' => 3,
    'pid' => '632700',
  ),
  632724 => 
  array (
    'id' => '632724',
    'name' => '治多县',
    'level' => 3,
    'pid' => '632700',
  ),
  632725 => 
  array (
    'id' => '632725',
    'name' => '囊谦县',
    'level' => 3,
    'pid' => '632700',
  ),
  632726 => 
  array (
    'id' => '632726',
    'name' => '曲麻莱县',
    'level' => 3,
    'pid' => '632700',
  ),
  632800 => 
  array (
    'id' => '632800',
    'name' => '海西蒙古族藏族自治州',
    'level' => 2,
    'pid' => '630000',
  ),
  632801 => 
  array (
    'id' => '632801',
    'name' => '格尔木市',
    'level' => 3,
    'pid' => '632800',
  ),
  632802 => 
  array (
    'id' => '632802',
    'name' => '德令哈市',
    'level' => 3,
    'pid' => '632800',
  ),
  632821 => 
  array (
    'id' => '632821',
    'name' => '乌兰县',
    'level' => 3,
    'pid' => '632800',
  ),
  632822 => 
  array (
    'id' => '632822',
    'name' => '都兰县',
    'level' => 3,
    'pid' => '632800',
  ),
  632823 => 
  array (
    'id' => '632823',
    'name' => '天峻县',
    'level' => 3,
    'pid' => '632800',
  ),
  640000 => 
  array (
    'id' => '640000',
    'name' => '宁夏回族自治区',
    'level' => 1,
    'pid' => 0,
  ),
  640100 => 
  array (
    'id' => '640100',
    'name' => '银川市',
    'level' => 2,
    'pid' => '640000',
  ),
  640101 => 
  array (
    'id' => '640101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '640100',
  ),
  640104 => 
  array (
    'id' => '640104',
    'name' => '兴庆区',
    'level' => 3,
    'pid' => '640100',
  ),
  640105 => 
  array (
    'id' => '640105',
    'name' => '西夏区',
    'level' => 3,
    'pid' => '640100',
  ),
  640106 => 
  array (
    'id' => '640106',
    'name' => '金凤区',
    'level' => 3,
    'pid' => '640100',
  ),
  640121 => 
  array (
    'id' => '640121',
    'name' => '永宁县',
    'level' => 3,
    'pid' => '640100',
  ),
  640122 => 
  array (
    'id' => '640122',
    'name' => '贺兰县',
    'level' => 3,
    'pid' => '640100',
  ),
  640181 => 
  array (
    'id' => '640181',
    'name' => '灵武市',
    'level' => 3,
    'pid' => '640100',
  ),
  640200 => 
  array (
    'id' => '640200',
    'name' => '石嘴山市',
    'level' => 2,
    'pid' => '640000',
  ),
  640201 => 
  array (
    'id' => '640201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '640200',
  ),
  640202 => 
  array (
    'id' => '640202',
    'name' => '大武口区',
    'level' => 3,
    'pid' => '640200',
  ),
  640205 => 
  array (
    'id' => '640205',
    'name' => '惠农区',
    'level' => 3,
    'pid' => '640200',
  ),
  640221 => 
  array (
    'id' => '640221',
    'name' => '平罗县',
    'level' => 3,
    'pid' => '640200',
  ),
  640300 => 
  array (
    'id' => '640300',
    'name' => '吴忠市',
    'level' => 2,
    'pid' => '640000',
  ),
  640301 => 
  array (
    'id' => '640301',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '640300',
  ),
  640302 => 
  array (
    'id' => '640302',
    'name' => '利通区',
    'level' => 3,
    'pid' => '640300',
  ),
  640303 => 
  array (
    'id' => '640303',
    'name' => '红寺堡区',
    'level' => 3,
    'pid' => '640300',
  ),
  640323 => 
  array (
    'id' => '640323',
    'name' => '盐池县',
    'level' => 3,
    'pid' => '640300',
  ),
  640324 => 
  array (
    'id' => '640324',
    'name' => '同心县',
    'level' => 3,
    'pid' => '640300',
  ),
  640381 => 
  array (
    'id' => '640381',
    'name' => '青铜峡市',
    'level' => 3,
    'pid' => '640300',
  ),
  640400 => 
  array (
    'id' => '640400',
    'name' => '固原市',
    'level' => 2,
    'pid' => '640000',
  ),
  640401 => 
  array (
    'id' => '640401',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '640400',
  ),
  640402 => 
  array (
    'id' => '640402',
    'name' => '原州区',
    'level' => 3,
    'pid' => '640400',
  ),
  640422 => 
  array (
    'id' => '640422',
    'name' => '西吉县',
    'level' => 3,
    'pid' => '640400',
  ),
  640423 => 
  array (
    'id' => '640423',
    'name' => '隆德县',
    'level' => 3,
    'pid' => '640400',
  ),
  640424 => 
  array (
    'id' => '640424',
    'name' => '泾源县',
    'level' => 3,
    'pid' => '640400',
  ),
  640425 => 
  array (
    'id' => '640425',
    'name' => '彭阳县',
    'level' => 3,
    'pid' => '640400',
  ),
  640500 => 
  array (
    'id' => '640500',
    'name' => '中卫市',
    'level' => 2,
    'pid' => '640000',
  ),
  640501 => 
  array (
    'id' => '640501',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '640500',
  ),
  640502 => 
  array (
    'id' => '640502',
    'name' => '沙坡头区',
    'level' => 3,
    'pid' => '640500',
  ),
  640521 => 
  array (
    'id' => '640521',
    'name' => '中宁县',
    'level' => 3,
    'pid' => '640500',
  ),
  640522 => 
  array (
    'id' => '640522',
    'name' => '海原县',
    'level' => 3,
    'pid' => '640500',
  ),
  650000 => 
  array (
    'id' => '650000',
    'name' => '新疆维吾尔自治区',
    'level' => 1,
    'pid' => 0,
  ),
  650100 => 
  array (
    'id' => '650100',
    'name' => '乌鲁木齐市',
    'level' => 2,
    'pid' => '650000',
  ),
  650101 => 
  array (
    'id' => '650101',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '650100',
  ),
  650102 => 
  array (
    'id' => '650102',
    'name' => '天山区',
    'level' => 3,
    'pid' => '650100',
  ),
  650103 => 
  array (
    'id' => '650103',
    'name' => '沙依巴克区',
    'level' => 3,
    'pid' => '650100',
  ),
  650104 => 
  array (
    'id' => '650104',
    'name' => '新市区',
    'level' => 3,
    'pid' => '650100',
  ),
  650105 => 
  array (
    'id' => '650105',
    'name' => '水磨沟区',
    'level' => 3,
    'pid' => '650100',
  ),
  650106 => 
  array (
    'id' => '650106',
    'name' => '头屯河区',
    'level' => 3,
    'pid' => '650100',
  ),
  650107 => 
  array (
    'id' => '650107',
    'name' => '达坂城区',
    'level' => 3,
    'pid' => '650100',
  ),
  650109 => 
  array (
    'id' => '650109',
    'name' => '米东区',
    'level' => 3,
    'pid' => '650100',
  ),
  650121 => 
  array (
    'id' => '650121',
    'name' => '乌鲁木齐县',
    'level' => 3,
    'pid' => '650100',
  ),
  650200 => 
  array (
    'id' => '650200',
    'name' => '克拉玛依市',
    'level' => 2,
    'pid' => '650000',
  ),
  650201 => 
  array (
    'id' => '650201',
    'name' => '市辖区',
    'level' => 3,
    'pid' => '650200',
  ),
  650202 => 
  array (
    'id' => '650202',
    'name' => '独山子区',
    'level' => 3,
    'pid' => '650200',
  ),
  650203 => 
  array (
    'id' => '650203',
    'name' => '克拉玛依区',
    'level' => 3,
    'pid' => '650200',
  ),
  650204 => 
  array (
    'id' => '650204',
    'name' => '白碱滩区',
    'level' => 3,
    'pid' => '650200',
  ),
  650205 => 
  array (
    'id' => '650205',
    'name' => '乌尔禾区',
    'level' => 3,
    'pid' => '650200',
  ),
  650400 => 
  array (
    'id' => '650400',
    'name' => '吐鲁番市',
    'level' => 2,
    'pid' => '650000',
  ),
  650402 => 
  array (
    'id' => '650402',
    'name' => '高昌区',
    'level' => 3,
    'pid' => '650400',
  ),
  650421 => 
  array (
    'id' => '650421',
    'name' => '鄯善县',
    'level' => 3,
    'pid' => '650400',
  ),
  650422 => 
  array (
    'id' => '650422',
    'name' => '托克逊县',
    'level' => 3,
    'pid' => '650400',
  ),
  652200 => 
  array (
    'id' => '652200',
    'name' => '哈密地区',
    'level' => 2,
    'pid' => '650000',
  ),
  652201 => 
  array (
    'id' => '652201',
    'name' => '哈密市',
    'level' => 3,
    'pid' => '652200',
  ),
  652222 => 
  array (
    'id' => '652222',
    'name' => '巴里坤哈萨克自治县',
    'level' => 3,
    'pid' => '652200',
  ),
  652223 => 
  array (
    'id' => '652223',
    'name' => '伊吾县',
    'level' => 3,
    'pid' => '652200',
  ),
  652300 => 
  array (
    'id' => '652300',
    'name' => '昌吉回族自治州',
    'level' => 2,
    'pid' => '650000',
  ),
  652301 => 
  array (
    'id' => '652301',
    'name' => '昌吉市',
    'level' => 3,
    'pid' => '652300',
  ),
  652302 => 
  array (
    'id' => '652302',
    'name' => '阜康市',
    'level' => 3,
    'pid' => '652300',
  ),
  652323 => 
  array (
    'id' => '652323',
    'name' => '呼图壁县',
    'level' => 3,
    'pid' => '652300',
  ),
  652324 => 
  array (
    'id' => '652324',
    'name' => '玛纳斯县',
    'level' => 3,
    'pid' => '652300',
  ),
  652325 => 
  array (
    'id' => '652325',
    'name' => '奇台县',
    'level' => 3,
    'pid' => '652300',
  ),
  652327 => 
  array (
    'id' => '652327',
    'name' => '吉木萨尔县',
    'level' => 3,
    'pid' => '652300',
  ),
  652328 => 
  array (
    'id' => '652328',
    'name' => '木垒哈萨克自治县',
    'level' => 3,
    'pid' => '652300',
  ),
  652700 => 
  array (
    'id' => '652700',
    'name' => '博尔塔拉蒙古自治州',
    'level' => 2,
    'pid' => '650000',
  ),
  652701 => 
  array (
    'id' => '652701',
    'name' => '博乐市',
    'level' => 3,
    'pid' => '652700',
  ),
  652702 => 
  array (
    'id' => '652702',
    'name' => '阿拉山口市',
    'level' => 3,
    'pid' => '652700',
  ),
  652722 => 
  array (
    'id' => '652722',
    'name' => '精河县',
    'level' => 3,
    'pid' => '652700',
  ),
  652723 => 
  array (
    'id' => '652723',
    'name' => '温泉县',
    'level' => 3,
    'pid' => '652700',
  ),
  652800 => 
  array (
    'id' => '652800',
    'name' => '巴音郭楞蒙古自治州',
    'level' => 2,
    'pid' => '650000',
  ),
  652801 => 
  array (
    'id' => '652801',
    'name' => '库尔勒市',
    'level' => 3,
    'pid' => '652800',
  ),
  652822 => 
  array (
    'id' => '652822',
    'name' => '轮台县',
    'level' => 3,
    'pid' => '652800',
  ),
  652823 => 
  array (
    'id' => '652823',
    'name' => '尉犁县',
    'level' => 3,
    'pid' => '652800',
  ),
  652824 => 
  array (
    'id' => '652824',
    'name' => '若羌县',
    'level' => 3,
    'pid' => '652800',
  ),
  652825 => 
  array (
    'id' => '652825',
    'name' => '且末县',
    'level' => 3,
    'pid' => '652800',
  ),
  652826 => 
  array (
    'id' => '652826',
    'name' => '焉耆回族自治县',
    'level' => 3,
    'pid' => '652800',
  ),
  652827 => 
  array (
    'id' => '652827',
    'name' => '和静县',
    'level' => 3,
    'pid' => '652800',
  ),
  652828 => 
  array (
    'id' => '652828',
    'name' => '和硕县',
    'level' => 3,
    'pid' => '652800',
  ),
  652829 => 
  array (
    'id' => '652829',
    'name' => '博湖县',
    'level' => 3,
    'pid' => '652800',
  ),
  652900 => 
  array (
    'id' => '652900',
    'name' => '阿克苏地区',
    'level' => 2,
    'pid' => '650000',
  ),
  652901 => 
  array (
    'id' => '652901',
    'name' => '阿克苏市',
    'level' => 3,
    'pid' => '652900',
  ),
  652922 => 
  array (
    'id' => '652922',
    'name' => '温宿县',
    'level' => 3,
    'pid' => '652900',
  ),
  652923 => 
  array (
    'id' => '652923',
    'name' => '库车县',
    'level' => 3,
    'pid' => '652900',
  ),
  652924 => 
  array (
    'id' => '652924',
    'name' => '沙雅县',
    'level' => 3,
    'pid' => '652900',
  ),
  652925 => 
  array (
    'id' => '652925',
    'name' => '新和县',
    'level' => 3,
    'pid' => '652900',
  ),
  652926 => 
  array (
    'id' => '652926',
    'name' => '拜城县',
    'level' => 3,
    'pid' => '652900',
  ),
  652927 => 
  array (
    'id' => '652927',
    'name' => '乌什县',
    'level' => 3,
    'pid' => '652900',
  ),
  652928 => 
  array (
    'id' => '652928',
    'name' => '阿瓦提县',
    'level' => 3,
    'pid' => '652900',
  ),
  652929 => 
  array (
    'id' => '652929',
    'name' => '柯坪县',
    'level' => 3,
    'pid' => '652900',
  ),
  653000 => 
  array (
    'id' => '653000',
    'name' => '克孜勒苏柯尔克孜自治州',
    'level' => 2,
    'pid' => '650000',
  ),
  653001 => 
  array (
    'id' => '653001',
    'name' => '阿图什市',
    'level' => 3,
    'pid' => '653000',
  ),
  653022 => 
  array (
    'id' => '653022',
    'name' => '阿克陶县',
    'level' => 3,
    'pid' => '653000',
  ),
  653023 => 
  array (
    'id' => '653023',
    'name' => '阿合奇县',
    'level' => 3,
    'pid' => '653000',
  ),
  653024 => 
  array (
    'id' => '653024',
    'name' => '乌恰县',
    'level' => 3,
    'pid' => '653000',
  ),
  653100 => 
  array (
    'id' => '653100',
    'name' => '喀什地区',
    'level' => 2,
    'pid' => '650000',
  ),
  653101 => 
  array (
    'id' => '653101',
    'name' => '喀什市',
    'level' => 3,
    'pid' => '653100',
  ),
  653121 => 
  array (
    'id' => '653121',
    'name' => '疏附县',
    'level' => 3,
    'pid' => '653100',
  ),
  653122 => 
  array (
    'id' => '653122',
    'name' => '疏勒县',
    'level' => 3,
    'pid' => '653100',
  ),
  653123 => 
  array (
    'id' => '653123',
    'name' => '英吉沙县',
    'level' => 3,
    'pid' => '653100',
  ),
  653124 => 
  array (
    'id' => '653124',
    'name' => '泽普县',
    'level' => 3,
    'pid' => '653100',
  ),
  653125 => 
  array (
    'id' => '653125',
    'name' => '莎车县',
    'level' => 3,
    'pid' => '653100',
  ),
  653126 => 
  array (
    'id' => '653126',
    'name' => '叶城县',
    'level' => 3,
    'pid' => '653100',
  ),
  653127 => 
  array (
    'id' => '653127',
    'name' => '麦盖提县',
    'level' => 3,
    'pid' => '653100',
  ),
  653128 => 
  array (
    'id' => '653128',
    'name' => '岳普湖县',
    'level' => 3,
    'pid' => '653100',
  ),
  653129 => 
  array (
    'id' => '653129',
    'name' => '伽师县',
    'level' => 3,
    'pid' => '653100',
  ),
  653130 => 
  array (
    'id' => '653130',
    'name' => '巴楚县',
    'level' => 3,
    'pid' => '653100',
  ),
  653131 => 
  array (
    'id' => '653131',
    'name' => '塔什库尔干塔吉克自治县',
    'level' => 3,
    'pid' => '653100',
  ),
  653200 => 
  array (
    'id' => '653200',
    'name' => '和田地区',
    'level' => 2,
    'pid' => '650000',
  ),
  653201 => 
  array (
    'id' => '653201',
    'name' => '和田市',
    'level' => 3,
    'pid' => '653200',
  ),
  653221 => 
  array (
    'id' => '653221',
    'name' => '和田县',
    'level' => 3,
    'pid' => '653200',
  ),
  653222 => 
  array (
    'id' => '653222',
    'name' => '墨玉县',
    'level' => 3,
    'pid' => '653200',
  ),
  653223 => 
  array (
    'id' => '653223',
    'name' => '皮山县',
    'level' => 3,
    'pid' => '653200',
  ),
  653224 => 
  array (
    'id' => '653224',
    'name' => '洛浦县',
    'level' => 3,
    'pid' => '653200',
  ),
  653225 => 
  array (
    'id' => '653225',
    'name' => '策勒县',
    'level' => 3,
    'pid' => '653200',
  ),
  653226 => 
  array (
    'id' => '653226',
    'name' => '于田县',
    'level' => 3,
    'pid' => '653200',
  ),
  653227 => 
  array (
    'id' => '653227',
    'name' => '民丰县',
    'level' => 3,
    'pid' => '653200',
  ),
  654000 => 
  array (
    'id' => '654000',
    'name' => '伊犁哈萨克自治州',
    'level' => 2,
    'pid' => '650000',
  ),
  654002 => 
  array (
    'id' => '654002',
    'name' => '伊宁市',
    'level' => 3,
    'pid' => '654000',
  ),
  654003 => 
  array (
    'id' => '654003',
    'name' => '奎屯市',
    'level' => 3,
    'pid' => '654000',
  ),
  654004 => 
  array (
    'id' => '654004',
    'name' => '霍尔果斯市',
    'level' => 3,
    'pid' => '654000',
  ),
  654021 => 
  array (
    'id' => '654021',
    'name' => '伊宁县',
    'level' => 3,
    'pid' => '654000',
  ),
  654022 => 
  array (
    'id' => '654022',
    'name' => '察布查尔锡伯自治县',
    'level' => 3,
    'pid' => '654000',
  ),
  654023 => 
  array (
    'id' => '654023',
    'name' => '霍城县',
    'level' => 3,
    'pid' => '654000',
  ),
  654024 => 
  array (
    'id' => '654024',
    'name' => '巩留县',
    'level' => 3,
    'pid' => '654000',
  ),
  654025 => 
  array (
    'id' => '654025',
    'name' => '新源县',
    'level' => 3,
    'pid' => '654000',
  ),
  654026 => 
  array (
    'id' => '654026',
    'name' => '昭苏县',
    'level' => 3,
    'pid' => '654000',
  ),
  654027 => 
  array (
    'id' => '654027',
    'name' => '特克斯县',
    'level' => 3,
    'pid' => '654000',
  ),
  654028 => 
  array (
    'id' => '654028',
    'name' => '尼勒克县',
    'level' => 3,
    'pid' => '654000',
  ),
  654200 => 
  array (
    'id' => '654200',
    'name' => '塔城地区',
    'level' => 2,
    'pid' => '650000',
  ),
  654201 => 
  array (
    'id' => '654201',
    'name' => '塔城市',
    'level' => 3,
    'pid' => '654200',
  ),
  654202 => 
  array (
    'id' => '654202',
    'name' => '乌苏市',
    'level' => 3,
    'pid' => '654200',
  ),
  654221 => 
  array (
    'id' => '654221',
    'name' => '额敏县',
    'level' => 3,
    'pid' => '654200',
  ),
  654223 => 
  array (
    'id' => '654223',
    'name' => '沙湾县',
    'level' => 3,
    'pid' => '654200',
  ),
  654224 => 
  array (
    'id' => '654224',
    'name' => '托里县',
    'level' => 3,
    'pid' => '654200',
  ),
  654225 => 
  array (
    'id' => '654225',
    'name' => '裕民县',
    'level' => 3,
    'pid' => '654200',
  ),
  654226 => 
  array (
    'id' => '654226',
    'name' => '和布克赛尔蒙古自治县',
    'level' => 3,
    'pid' => '654200',
  ),
  654300 => 
  array (
    'id' => '654300',
    'name' => '阿勒泰地区',
    'level' => 2,
    'pid' => '650000',
  ),
  654301 => 
  array (
    'id' => '654301',
    'name' => '阿勒泰市',
    'level' => 3,
    'pid' => '654300',
  ),
  654321 => 
  array (
    'id' => '654321',
    'name' => '布尔津县',
    'level' => 3,
    'pid' => '654300',
  ),
  654322 => 
  array (
    'id' => '654322',
    'name' => '富蕴县',
    'level' => 3,
    'pid' => '654300',
  ),
  654323 => 
  array (
    'id' => '654323',
    'name' => '福海县',
    'level' => 3,
    'pid' => '654300',
  ),
  654324 => 
  array (
    'id' => '654324',
    'name' => '哈巴河县',
    'level' => 3,
    'pid' => '654300',
  ),
  654325 => 
  array (
    'id' => '654325',
    'name' => '青河县',
    'level' => 3,
    'pid' => '654300',
  ),
  654326 => 
  array (
    'id' => '654326',
    'name' => '吉木乃县',
    'level' => 3,
    'pid' => '654300',
  ),
  659000 => 
  array (
    'id' => '659000',
    'name' => '自治区直辖县级行政区划',
    'level' => 2,
    'pid' => '650000',
  ),
  659001 => 
  array (
    'id' => '659001',
    'name' => '石河子市',
    'level' => 3,
    'pid' => '659000',
  ),
  659002 => 
  array (
    'id' => '659002',
    'name' => '阿拉尔市',
    'level' => 3,
    'pid' => '659000',
  ),
  659003 => 
  array (
    'id' => '659003',
    'name' => '图木舒克市',
    'level' => 3,
    'pid' => '659000',
  ),
  659004 => 
  array (
    'id' => '659004',
    'name' => '五家渠市',
    'level' => 3,
    'pid' => '659000',
  ),
  710000 => 
  array (
    'id' => '710000',
    'name' => '台湾省',
    'level' => 1,
    'pid' => 0,
  ),
  810000 => 
  array (
    'id' => '810000',
    'name' => '香港特别行政区',
    'level' => 1,
    'pid' => 0,
  ),
  820000 => 
  array (
    'id' => '820000',
    'name' => '澳门特别行政区',
    'level' => 1,
    'pid' => 0,
  ),
);